SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460jeta_template/common/hc32f460jeta.h
#define bM4_INTC_SEL91_INTSEL0                    (*((volatile unsigned int*)(0x42A23900UL)))
#define bM4_INTC_SEL91_INTSEL1                    (*((volatile unsigned int*)(0x42A23904UL)))
#define bM4_INTC_SEL91_INTSEL2                    (*((volatile unsigned int*)(0x42A23908UL)))
#define bM4_INTC_SEL91_INTSEL3                    (*((volatile unsigned int*)(0x42A2390CUL)))
#define bM4_INTC_SEL91_INTSEL4                    (*((volatile unsigned int*)(0x42A23910UL)))
#define bM4_INTC_SEL91_INTSEL5                    (*((volatile unsigned int*)(0x42A23914UL)))
#define bM4_INTC_SEL91_INTSEL6                    (*((volatile unsigned int*)(0x42A23918UL)))
#define bM4_INTC_SEL91_INTSEL7                    (*((volatile unsigned int*)(0x42A2391CUL)))
#define bM4_INTC_SEL91_INTSEL8                    (*((volatile unsigned int*)(0x42A23920UL)))
#define bM4_INTC_SEL92_INTSEL0                    (*((volatile unsigned int*)(0x42A23980UL)))
#define bM4_INTC_SEL92_INTSEL1                    (*((volatile unsigned int*)(0x42A23984UL)))
#define bM4_INTC_SEL92_INTSEL2                    (*((volatile unsigned int*)(0x42A23988UL)))
#define bM4_INTC_SEL92_INTSEL3                    (*((volatile unsigned int*)(0x42A2398CUL)))
#define bM4_INTC_SEL92_INTSEL4                    (*((volatile unsigned int*)(0x42A23990UL)))
#define bM4_INTC_SEL92_INTSEL5                    (*((volatile unsigned int*)(0x42A23994UL)))
#define bM4_INTC_SEL92_INTSEL6                    (*((volatile unsigned int*)(0x42A23998UL)))
#define bM4_INTC_SEL92_INTSEL7                    (*((volatile unsigned int*)(0x42A2399CUL)))
#define bM4_INTC_SEL92_INTSEL8                    (*((volatile unsigned int*)(0x42A239A0UL)))
#define bM4_INTC_SEL93_INTSEL0                    (*((volatile unsigned int*)(0x42A23A00UL)))
#define bM4_INTC_SEL93_INTSEL1                    (*((volatile unsigned int*)(0x42A23A04UL)))
#define bM4_INTC_SEL93_INTSEL2                    (*((volatile unsigned int*)(0x42A23A08UL)))
#define bM4_INTC_SEL93_INTSEL3                    (*((volatile unsigned int*)(0x42A23A0CUL)))
#define bM4_INTC_SEL93_INTSEL4                    (*((volatile unsigned int*)(0x42A23A10UL)))
#define bM4_INTC_SEL93_INTSEL5                    (*((volatile unsigned int*)(0x42A23A14UL)))
#define bM4_INTC_SEL93_INTSEL6                    (*((volatile unsigned int*)(0x42A23A18UL)))
#define bM4_INTC_SEL93_INTSEL7                    (*((volatile unsigned int*)(0x42A23A1CUL)))
#define bM4_INTC_SEL93_INTSEL8                    (*((volatile unsigned int*)(0x42A23A20UL)))
#define bM4_INTC_SEL94_INTSEL0                    (*((volatile unsigned int*)(0x42A23A80UL)))
#define bM4_INTC_SEL94_INTSEL1                    (*((volatile unsigned int*)(0x42A23A84UL)))
#define bM4_INTC_SEL94_INTSEL2                    (*((volatile unsigned int*)(0x42A23A88UL)))
#define bM4_INTC_SEL94_INTSEL3                    (*((volatile unsigned int*)(0x42A23A8CUL)))
#define bM4_INTC_SEL94_INTSEL4                    (*((volatile unsigned int*)(0x42A23A90UL)))
#define bM4_INTC_SEL94_INTSEL5                    (*((volatile unsigned int*)(0x42A23A94UL)))
#define bM4_INTC_SEL94_INTSEL6                    (*((volatile unsigned int*)(0x42A23A98UL)))
#define bM4_INTC_SEL94_INTSEL7                    (*((volatile unsigned int*)(0x42A23A9CUL)))
#define bM4_INTC_SEL94_INTSEL8                    (*((volatile unsigned int*)(0x42A23AA0UL)))
#define bM4_INTC_SEL95_INTSEL0                    (*((volatile unsigned int*)(0x42A23B00UL)))
#define bM4_INTC_SEL95_INTSEL1                    (*((volatile unsigned int*)(0x42A23B04UL)))
#define bM4_INTC_SEL95_INTSEL2                    (*((volatile unsigned int*)(0x42A23B08UL)))
#define bM4_INTC_SEL95_INTSEL3                    (*((volatile unsigned int*)(0x42A23B0CUL)))
#define bM4_INTC_SEL95_INTSEL4                    (*((volatile unsigned int*)(0x42A23B10UL)))
#define bM4_INTC_SEL95_INTSEL5                    (*((volatile unsigned int*)(0x42A23B14UL)))
#define bM4_INTC_SEL95_INTSEL6                    (*((volatile unsigned int*)(0x42A23B18UL)))
#define bM4_INTC_SEL95_INTSEL7                    (*((volatile unsigned int*)(0x42A23B1CUL)))
#define bM4_INTC_SEL95_INTSEL8                    (*((volatile unsigned int*)(0x42A23B20UL)))
#define bM4_INTC_SEL96_INTSEL0                    (*((volatile unsigned int*)(0x42A23B80UL)))
#define bM4_INTC_SEL96_INTSEL1                    (*((volatile unsigned int*)(0x42A23B84UL)))
#define bM4_INTC_SEL96_INTSEL2                    (*((volatile unsigned int*)(0x42A23B88UL)))
#define bM4_INTC_SEL96_INTSEL3                    (*((volatile unsigned int*)(0x42A23B8CUL)))
#define bM4_INTC_SEL96_INTSEL4                    (*((volatile unsigned int*)(0x42A23B90UL)))
#define bM4_INTC_SEL96_INTSEL5                    (*((volatile unsigned int*)(0x42A23B94UL)))
#define bM4_INTC_SEL96_INTSEL6                    (*((volatile unsigned int*)(0x42A23B98UL)))
#define bM4_INTC_SEL96_INTSEL7                    (*((volatile unsigned int*)(0x42A23B9CUL)))
#define bM4_INTC_SEL96_INTSEL8                    (*((volatile unsigned int*)(0x42A23BA0UL)))
#define bM4_INTC_SEL97_INTSEL0                    (*((volatile unsigned int*)(0x42A23C00UL)))
#define bM4_INTC_SEL97_INTSEL1                    (*((volatile unsigned int*)(0x42A23C04UL)))
#define bM4_INTC_SEL97_INTSEL2                    (*((volatile unsigned int*)(0x42A23C08UL)))
#define bM4_INTC_SEL97_INTSEL3                    (*((volatile unsigned int*)(0x42A23C0CUL)))
#define bM4_INTC_SEL97_INTSEL4                    (*((volatile unsigned int*)(0x42A23C10UL)))
#define bM4_INTC_SEL97_INTSEL5                    (*((volatile unsigned int*)(0x42A23C14UL)))
#define bM4_INTC_SEL97_INTSEL6                    (*((volatile unsigned int*)(0x42A23C18UL)))
#define bM4_INTC_SEL97_INTSEL7                    (*((volatile unsigned int*)(0x42A23C1CUL)))
#define bM4_INTC_SEL97_INTSEL8                    (*((volatile unsigned int*)(0x42A23C20UL)))
#define bM4_INTC_SEL98_INTSEL0                    (*((volatile unsigned int*)(0x42A23C80UL)))
#define bM4_INTC_SEL98_INTSEL1                    (*((volatile unsigned int*)(0x42A23C84UL)))
#define bM4_INTC_SEL98_INTSEL2                    (*((volatile unsigned int*)(0x42A23C88UL)))
#define bM4_INTC_SEL98_INTSEL3                    (*((volatile unsigned int*)(0x42A23C8CUL)))
#define bM4_INTC_SEL98_INTSEL4                    (*((volatile unsigned int*)(0x42A23C90UL)))
#define bM4_INTC_SEL98_INTSEL5                    (*((volatile unsigned int*)(0x42A23C94UL)))
#define bM4_INTC_SEL98_INTSEL6                    (*((volatile unsigned int*)(0x42A23C98UL)))
#define bM4_INTC_SEL98_INTSEL7                    (*((volatile unsigned int*)(0x42A23C9CUL)))
#define bM4_INTC_SEL98_INTSEL8                    (*((volatile unsigned int*)(0x42A23CA0UL)))
#define bM4_INTC_SEL99_INTSEL0                    (*((volatile unsigned int*)(0x42A23D00UL)))
#define bM4_INTC_SEL99_INTSEL1                    (*((volatile unsigned int*)(0x42A23D04UL)))
#define bM4_INTC_SEL99_INTSEL2                    (*((volatile unsigned int*)(0x42A23D08UL)))
#define bM4_INTC_SEL99_INTSEL3                    (*((volatile unsigned int*)(0x42A23D0CUL)))
#define bM4_INTC_SEL99_INTSEL4                    (*((volatile unsigned int*)(0x42A23D10UL)))
#define bM4_INTC_SEL99_INTSEL5                    (*((volatile unsigned int*)(0x42A23D14UL)))
#define bM4_INTC_SEL99_INTSEL6                    (*((volatile unsigned int*)(0x42A23D18UL)))
#define bM4_INTC_SEL99_INTSEL7                    (*((volatile unsigned int*)(0x42A23D1CUL)))
#define bM4_INTC_SEL99_INTSEL8                    (*((volatile unsigned int*)(0x42A23D20UL)))
#define bM4_INTC_SEL100_INTSEL0                   (*((volatile unsigned int*)(0x42A23D80UL)))
#define bM4_INTC_SEL100_INTSEL1                   (*((volatile unsigned int*)(0x42A23D84UL)))
#define bM4_INTC_SEL100_INTSEL2                   (*((volatile unsigned int*)(0x42A23D88UL)))
#define bM4_INTC_SEL100_INTSEL3                   (*((volatile unsigned int*)(0x42A23D8CUL)))
#define bM4_INTC_SEL100_INTSEL4                   (*((volatile unsigned int*)(0x42A23D90UL)))
#define bM4_INTC_SEL100_INTSEL5                   (*((volatile unsigned int*)(0x42A23D94UL)))
#define bM4_INTC_SEL100_INTSEL6                   (*((volatile unsigned int*)(0x42A23D98UL)))
#define bM4_INTC_SEL100_INTSEL7                   (*((volatile unsigned int*)(0x42A23D9CUL)))
#define bM4_INTC_SEL100_INTSEL8                   (*((volatile unsigned int*)(0x42A23DA0UL)))
#define bM4_INTC_SEL101_INTSEL0                   (*((volatile unsigned int*)(0x42A23E00UL)))
#define bM4_INTC_SEL101_INTSEL1                   (*((volatile unsigned int*)(0x42A23E04UL)))
#define bM4_INTC_SEL101_INTSEL2                   (*((volatile unsigned int*)(0x42A23E08UL)))
#define bM4_INTC_SEL101_INTSEL3                   (*((volatile unsigned int*)(0x42A23E0CUL)))
#define bM4_INTC_SEL101_INTSEL4                   (*((volatile unsigned int*)(0x42A23E10UL)))
#define bM4_INTC_SEL101_INTSEL5                   (*((volatile unsigned int*)(0x42A23E14UL)))
#define bM4_INTC_SEL101_INTSEL6                   (*((volatile unsigned int*)(0x42A23E18UL)))
#define bM4_INTC_SEL101_INTSEL7                   (*((volatile unsigned int*)(0x42A23E1CUL)))
#define bM4_INTC_SEL101_INTSEL8                   (*((volatile unsigned int*)(0x42A23E20UL)))
#define bM4_INTC_SEL102_INTSEL0                   (*((volatile unsigned int*)(0x42A23E80UL)))
#define bM4_INTC_SEL102_INTSEL1                   (*((volatile unsigned int*)(0x42A23E84UL)))
#define bM4_INTC_SEL102_INTSEL2                   (*((volatile unsigned int*)(0x42A23E88UL)))
#define bM4_INTC_SEL102_INTSEL3                   (*((volatile unsigned int*)(0x42A23E8CUL)))
#define bM4_INTC_SEL102_INTSEL4                   (*((volatile unsigned int*)(0x42A23E90UL)))
#define bM4_INTC_SEL102_INTSEL5                   (*((volatile unsigned int*)(0x42A23E94UL)))
#define bM4_INTC_SEL102_INTSEL6                   (*((volatile unsigned int*)(0x42A23E98UL)))
#define bM4_INTC_SEL102_INTSEL7                   (*((volatile unsigned int*)(0x42A23E9CUL)))
#define bM4_INTC_SEL102_INTSEL8                   (*((volatile unsigned int*)(0x42A23EA0UL)))
#define bM4_INTC_SEL103_INTSEL0                   (*((volatile unsigned int*)(0x42A23F00UL)))
#define bM4_INTC_SEL103_INTSEL1                   (*((volatile unsigned int*)(0x42A23F04UL)))
#define bM4_INTC_SEL103_INTSEL2                   (*((volatile unsigned int*)(0x42A23F08UL)))
#define bM4_INTC_SEL103_INTSEL3                   (*((volatile unsigned int*)(0x42A23F0CUL)))
#define bM4_INTC_SEL103_INTSEL4                   (*((volatile unsigned int*)(0x42A23F10UL)))
#define bM4_INTC_SEL103_INTSEL5                   (*((volatile unsigned int*)(0x42A23F14UL)))
#define bM4_INTC_SEL103_INTSEL6                   (*((volatile unsigned int*)(0x42A23F18UL)))
#define bM4_INTC_SEL103_INTSEL7                   (*((volatile unsigned int*)(0x42A23F1CUL)))
#define bM4_INTC_SEL103_INTSEL8                   (*((volatile unsigned int*)(0x42A23F20UL)))
#define bM4_INTC_SEL104_INTSEL0                   (*((volatile unsigned int*)(0x42A23F80UL)))
#define bM4_INTC_SEL104_INTSEL1                   (*((volatile unsigned int*)(0x42A23F84UL)))
#define bM4_INTC_SEL104_INTSEL2                   (*((volatile unsigned int*)(0x42A23F88UL)))
#define bM4_INTC_SEL104_INTSEL3                   (*((volatile unsigned int*)(0x42A23F8CUL)))
#define bM4_INTC_SEL104_INTSEL4                   (*((volatile unsigned int*)(0x42A23F90UL)))
#define bM4_INTC_SEL104_INTSEL5                   (*((volatile unsigned int*)(0x42A23F94UL)))
#define bM4_INTC_SEL104_INTSEL6                   (*((volatile unsigned int*)(0x42A23F98UL)))
#define bM4_INTC_SEL104_INTSEL7                   (*((volatile unsigned int*)(0x42A23F9CUL)))
#define bM4_INTC_SEL104_INTSEL8                   (*((volatile unsigned int*)(0x42A23FA0UL)))
#define bM4_INTC_SEL105_INTSEL0                   (*((volatile unsigned int*)(0x42A24000UL)))
#define bM4_INTC_SEL105_INTSEL1                   (*((volatile unsigned int*)(0x42A24004UL)))
#define bM4_INTC_SEL105_INTSEL2                   (*((volatile unsigned int*)(0x42A24008UL)))
#define bM4_INTC_SEL105_INTSEL3                   (*((volatile unsigned int*)(0x42A2400CUL)))
#define bM4_INTC_SEL105_INTSEL4                   (*((volatile unsigned int*)(0x42A24010UL)))
#define bM4_INTC_SEL105_INTSEL5                   (*((volatile unsigned int*)(0x42A24014UL)))
#define bM4_INTC_SEL105_INTSEL6                   (*((volatile unsigned int*)(0x42A24018UL)))
#define bM4_INTC_SEL105_INTSEL7                   (*((volatile unsigned int*)(0x42A2401CUL)))
#define bM4_INTC_SEL105_INTSEL8                   (*((volatile unsigned int*)(0x42A24020UL)))
#define bM4_INTC_SEL106_INTSEL0                   (*((volatile unsigned int*)(0x42A24080UL)))
#define bM4_INTC_SEL106_INTSEL1                   (*((volatile unsigned int*)(0x42A24084UL)))
#define bM4_INTC_SEL106_INTSEL2                   (*((volatile unsigned int*)(0x42A24088UL)))
#define bM4_INTC_SEL106_INTSEL3                   (*((volatile unsigned int*)(0x42A2408CUL)))
#define bM4_INTC_SEL106_INTSEL4                   (*((volatile unsigned int*)(0x42A24090UL)))
#define bM4_INTC_SEL106_INTSEL5                   (*((volatile unsigned int*)(0x42A24094UL)))
#define bM4_INTC_SEL106_INTSEL6                   (*((volatile unsigned int*)(0x42A24098UL)))
#define bM4_INTC_SEL106_INTSEL7                   (*((volatile unsigned int*)(0x42A2409CUL)))
#define bM4_INTC_SEL106_INTSEL8                   (*((volatile unsigned int*)(0x42A240A0UL)))
#define bM4_INTC_SEL107_INTSEL0                   (*((volatile unsigned int*)(0x42A24100UL)))
#define bM4_INTC_SEL107_INTSEL1                   (*((volatile unsigned int*)(0x42A24104UL)))
#define bM4_INTC_SEL107_INTSEL2                   (*((volatile unsigned int*)(0x42A24108UL)))
#define bM4_INTC_SEL107_INTSEL3                   (*((volatile unsigned int*)(0x42A2410CUL)))
#define bM4_INTC_SEL107_INTSEL4                   (*((volatile unsigned int*)(0x42A24110UL)))
#define bM4_INTC_SEL107_INTSEL5                   (*((volatile unsigned int*)(0x42A24114UL)))
#define bM4_INTC_SEL107_INTSEL6                   (*((volatile unsigned int*)(0x42A24118UL)))
#define bM4_INTC_SEL107_INTSEL7                   (*((volatile unsigned int*)(0x42A2411CUL)))
#define bM4_INTC_SEL107_INTSEL8                   (*((volatile unsigned int*)(0x42A24120UL)))
#define bM4_INTC_SEL108_INTSEL0                   (*((volatile unsigned int*)(0x42A24180UL)))
#define bM4_INTC_SEL108_INTSEL1                   (*((volatile unsigned int*)(0x42A24184UL)))
#define bM4_INTC_SEL108_INTSEL2                   (*((volatile unsigned int*)(0x42A24188UL)))
#define bM4_INTC_SEL108_INTSEL3                   (*((volatile unsigned int*)(0x42A2418CUL)))
#define bM4_INTC_SEL108_INTSEL4                   (*((volatile unsigned int*)(0x42A24190UL)))
#define bM4_INTC_SEL108_INTSEL5                   (*((volatile unsigned int*)(0x42A24194UL)))
#define bM4_INTC_SEL108_INTSEL6                   (*((volatile unsigned int*)(0x42A24198UL)))
#define bM4_INTC_SEL108_INTSEL7                   (*((volatile unsigned int*)(0x42A2419CUL)))
#define bM4_INTC_SEL108_INTSEL8                   (*((volatile unsigned int*)(0x42A241A0UL)))
#define bM4_INTC_SEL109_INTSEL0                   (*((volatile unsigned int*)(0x42A24200UL)))
#define bM4_INTC_SEL109_INTSEL1                   (*((volatile unsigned int*)(0x42A24204UL)))
#define bM4_INTC_SEL109_INTSEL2                   (*((volatile unsigned int*)(0x42A24208UL)))
#define bM4_INTC_SEL109_INTSEL3                   (*((volatile unsigned int*)(0x42A2420CUL)))
#define bM4_INTC_SEL109_INTSEL4                   (*((volatile unsigned int*)(0x42A24210UL)))
#define bM4_INTC_SEL109_INTSEL5                   (*((volatile unsigned int*)(0x42A24214UL)))
#define bM4_INTC_SEL109_INTSEL6                   (*((volatile unsigned int*)(0x42A24218UL)))
#define bM4_INTC_SEL109_INTSEL7                   (*((volatile unsigned int*)(0x42A2421CUL)))
#define bM4_INTC_SEL109_INTSEL8                   (*((volatile unsigned int*)(0x42A24220UL)))
#define bM4_INTC_SEL110_INTSEL0                   (*((volatile unsigned int*)(0x42A24280UL)))
#define bM4_INTC_SEL110_INTSEL1                   (*((volatile unsigned int*)(0x42A24284UL)))
#define bM4_INTC_SEL110_INTSEL2                   (*((volatile unsigned int*)(0x42A24288UL)))
#define bM4_INTC_SEL110_INTSEL3                   (*((volatile unsigned int*)(0x42A2428CUL)))
#define bM4_INTC_SEL110_INTSEL4                   (*((volatile unsigned int*)(0x42A24290UL)))
#define bM4_INTC_SEL110_INTSEL5                   (*((volatile unsigned int*)(0x42A24294UL)))
#define bM4_INTC_SEL110_INTSEL6                   (*((volatile unsigned int*)(0x42A24298UL)))
#define bM4_INTC_SEL110_INTSEL7                   (*((volatile unsigned int*)(0x42A2429CUL)))
#define bM4_INTC_SEL110_INTSEL8                   (*((volatile unsigned int*)(0x42A242A0UL)))
#define bM4_INTC_SEL111_INTSEL0                   (*((volatile unsigned int*)(0x42A24300UL)))
#define bM4_INTC_SEL111_INTSEL1                   (*((volatile unsigned int*)(0x42A24304UL)))
#define bM4_INTC_SEL111_INTSEL2                   (*((volatile unsigned int*)(0x42A24308UL)))
#define bM4_INTC_SEL111_INTSEL3                   (*((volatile unsigned int*)(0x42A2430CUL)))
#define bM4_INTC_SEL111_INTSEL4                   (*((volatile unsigned int*)(0x42A24310UL)))
#define bM4_INTC_SEL111_INTSEL5                   (*((volatile unsigned int*)(0x42A24314UL)))
#define bM4_INTC_SEL111_INTSEL6                   (*((volatile unsigned int*)(0x42A24318UL)))
#define bM4_INTC_SEL111_INTSEL7                   (*((volatile unsigned int*)(0x42A2431CUL)))
#define bM4_INTC_SEL111_INTSEL8                   (*((volatile unsigned int*)(0x42A24320UL)))
#define bM4_INTC_SEL112_INTSEL0                   (*((volatile unsigned int*)(0x42A24380UL)))
#define bM4_INTC_SEL112_INTSEL1                   (*((volatile unsigned int*)(0x42A24384UL)))
#define bM4_INTC_SEL112_INTSEL2                   (*((volatile unsigned int*)(0x42A24388UL)))
#define bM4_INTC_SEL112_INTSEL3                   (*((volatile unsigned int*)(0x42A2438CUL)))
#define bM4_INTC_SEL112_INTSEL4                   (*((volatile unsigned int*)(0x42A24390UL)))
#define bM4_INTC_SEL112_INTSEL5                   (*((volatile unsigned int*)(0x42A24394UL)))
#define bM4_INTC_SEL112_INTSEL6                   (*((volatile unsigned int*)(0x42A24398UL)))
#define bM4_INTC_SEL112_INTSEL7                   (*((volatile unsigned int*)(0x42A2439CUL)))
#define bM4_INTC_SEL112_INTSEL8                   (*((volatile unsigned int*)(0x42A243A0UL)))
#define bM4_INTC_SEL113_INTSEL0                   (*((volatile unsigned int*)(0x42A24400UL)))
#define bM4_INTC_SEL113_INTSEL1                   (*((volatile unsigned int*)(0x42A24404UL)))
#define bM4_INTC_SEL113_INTSEL2                   (*((volatile unsigned int*)(0x42A24408UL)))
#define bM4_INTC_SEL113_INTSEL3                   (*((volatile unsigned int*)(0x42A2440CUL)))
#define bM4_INTC_SEL113_INTSEL4                   (*((volatile unsigned int*)(0x42A24410UL)))
#define bM4_INTC_SEL113_INTSEL5                   (*((volatile unsigned int*)(0x42A24414UL)))
#define bM4_INTC_SEL113_INTSEL6                   (*((volatile unsigned int*)(0x42A24418UL)))
#define bM4_INTC_SEL113_INTSEL7                   (*((volatile unsigned int*)(0x42A2441CUL)))
#define bM4_INTC_SEL113_INTSEL8                   (*((volatile unsigned int*)(0x42A24420UL)))
#define bM4_INTC_SEL114_INTSEL0                   (*((volatile unsigned int*)(0x42A24480UL)))
#define bM4_INTC_SEL114_INTSEL1                   (*((volatile unsigned int*)(0x42A24484UL)))
#define bM4_INTC_SEL114_INTSEL2                   (*((volatile unsigned int*)(0x42A24488UL)))
#define bM4_INTC_SEL114_INTSEL3                   (*((volatile unsigned int*)(0x42A2448CUL)))
#define bM4_INTC_SEL114_INTSEL4                   (*((volatile unsigned int*)(0x42A24490UL)))
#define bM4_INTC_SEL114_INTSEL5                   (*((volatile unsigned int*)(0x42A24494UL)))
#define bM4_INTC_SEL114_INTSEL6                   (*((volatile unsigned int*)(0x42A24498UL)))
#define bM4_INTC_SEL114_INTSEL7                   (*((volatile unsigned int*)(0x42A2449CUL)))
#define bM4_INTC_SEL114_INTSEL8                   (*((volatile unsigned int*)(0x42A244A0UL)))
#define bM4_INTC_SEL115_INTSEL0                   (*((volatile unsigned int*)(0x42A24500UL)))
#define bM4_INTC_SEL115_INTSEL1                   (*((volatile unsigned int*)(0x42A24504UL)))
#define bM4_INTC_SEL115_INTSEL2                   (*((volatile unsigned int*)(0x42A24508UL)))
#define bM4_INTC_SEL115_INTSEL3                   (*((volatile unsigned int*)(0x42A2450CUL)))
#define bM4_INTC_SEL115_INTSEL4                   (*((volatile unsigned int*)(0x42A24510UL)))
#define bM4_INTC_SEL115_INTSEL5                   (*((volatile unsigned int*)(0x42A24514UL)))
#define bM4_INTC_SEL115_INTSEL6                   (*((volatile unsigned int*)(0x42A24518UL)))
#define bM4_INTC_SEL115_INTSEL7                   (*((volatile unsigned int*)(0x42A2451CUL)))
#define bM4_INTC_SEL115_INTSEL8                   (*((volatile unsigned int*)(0x42A24520UL)))
#define bM4_INTC_SEL116_INTSEL0                   (*((volatile unsigned int*)(0x42A24580UL)))
#define bM4_INTC_SEL116_INTSEL1                   (*((volatile unsigned int*)(0x42A24584UL)))
#define bM4_INTC_SEL116_INTSEL2                   (*((volatile unsigned int*)(0x42A24588UL)))
#define bM4_INTC_SEL116_INTSEL3                   (*((volatile unsigned int*)(0x42A2458CUL)))
#define bM4_INTC_SEL116_INTSEL4                   (*((volatile unsigned int*)(0x42A24590UL)))
#define bM4_INTC_SEL116_INTSEL5                   (*((volatile unsigned int*)(0x42A24594UL)))
#define bM4_INTC_SEL116_INTSEL6                   (*((volatile unsigned int*)(0x42A24598UL)))
#define bM4_INTC_SEL116_INTSEL7                   (*((volatile unsigned int*)(0x42A2459CUL)))
#define bM4_INTC_SEL116_INTSEL8                   (*((volatile unsigned int*)(0x42A245A0UL)))
#define bM4_INTC_SEL117_INTSEL0                   (*((volatile unsigned int*)(0x42A24600UL)))
#define bM4_INTC_SEL117_INTSEL1                   (*((volatile unsigned int*)(0x42A24604UL)))
#define bM4_INTC_SEL117_INTSEL2                   (*((volatile unsigned int*)(0x42A24608UL)))
#define bM4_INTC_SEL117_INTSEL3                   (*((volatile unsigned int*)(0x42A2460CUL)))
#define bM4_INTC_SEL117_INTSEL4                   (*((volatile unsigned int*)(0x42A24610UL)))
#define bM4_INTC_SEL117_INTSEL5                   (*((volatile unsigned int*)(0x42A24614UL)))
#define bM4_INTC_SEL117_INTSEL6                   (*((volatile unsigned int*)(0x42A24618UL)))
#define bM4_INTC_SEL117_INTSEL7                   (*((volatile unsigned int*)(0x42A2461CUL)))
#define bM4_INTC_SEL117_INTSEL8                   (*((volatile unsigned int*)(0x42A24620UL)))
#define bM4_INTC_SEL118_INTSEL0                   (*((volatile unsigned int*)(0x42A24680UL)))
#define bM4_INTC_SEL118_INTSEL1                   (*((volatile unsigned int*)(0x42A24684UL)))
#define bM4_INTC_SEL118_INTSEL2                   (*((volatile unsigned int*)(0x42A24688UL)))
#define bM4_INTC_SEL118_INTSEL3                   (*((volatile unsigned int*)(0x42A2468CUL)))
#define bM4_INTC_SEL118_INTSEL4                   (*((volatile unsigned int*)(0x42A24690UL)))
#define bM4_INTC_SEL118_INTSEL5                   (*((volatile unsigned int*)(0x42A24694UL)))
#define bM4_INTC_SEL118_INTSEL6                   (*((volatile unsigned int*)(0x42A24698UL)))
#define bM4_INTC_SEL118_INTSEL7                   (*((volatile unsigned int*)(0x42A2469CUL)))
#define bM4_INTC_SEL118_INTSEL8                   (*((volatile unsigned int*)(0x42A246A0UL)))
#define bM4_INTC_SEL119_INTSEL0                   (*((volatile unsigned int*)(0x42A24700UL)))
#define bM4_INTC_SEL119_INTSEL1                   (*((volatile unsigned int*)(0x42A24704UL)))
#define bM4_INTC_SEL119_INTSEL2                   (*((volatile unsigned int*)(0x42A24708UL)))
