SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460jeta_template/common/hc32f460jeta.h
#define bM4_PORT_PCRB13_PUU                       (*((volatile unsigned int*)(0x42A78E98UL)))
#define bM4_PORT_PCRB13_PIN                       (*((volatile unsigned int*)(0x42A78EA0UL)))
#define bM4_PORT_PCRB13_INVE                      (*((volatile unsigned int*)(0x42A78EA4UL)))
#define bM4_PORT_PCRB13_INTE                      (*((volatile unsigned int*)(0x42A78EB0UL)))
#define bM4_PORT_PCRB13_LTE                       (*((volatile unsigned int*)(0x42A78EB8UL)))
#define bM4_PORT_PCRB13_DDIS                      (*((volatile unsigned int*)(0x42A78EBCUL)))
#define bM4_PORT_PFSRB13_FSEL0                    (*((volatile unsigned int*)(0x42A78EC0UL)))
#define bM4_PORT_PFSRB13_FSEL1                    (*((volatile unsigned int*)(0x42A78EC4UL)))
#define bM4_PORT_PFSRB13_FSEL2                    (*((volatile unsigned int*)(0x42A78EC8UL)))
#define bM4_PORT_PFSRB13_FSEL3                    (*((volatile unsigned int*)(0x42A78ECCUL)))
#define bM4_PORT_PFSRB13_FSEL4                    (*((volatile unsigned int*)(0x42A78ED0UL)))
#define bM4_PORT_PFSRB13_FSEL5                    (*((volatile unsigned int*)(0x42A78ED4UL)))
#define bM4_PORT_PFSRB13_BFE                      (*((volatile unsigned int*)(0x42A78EE0UL)))
#define bM4_PORT_PCRB14_POUT                      (*((volatile unsigned int*)(0x42A78F00UL)))
#define bM4_PORT_PCRB14_POUTE                     (*((volatile unsigned int*)(0x42A78F04UL)))
#define bM4_PORT_PCRB14_NOD                       (*((volatile unsigned int*)(0x42A78F08UL)))
#define bM4_PORT_PCRB14_DRV0                      (*((volatile unsigned int*)(0x42A78F10UL)))
#define bM4_PORT_PCRB14_DRV1                      (*((volatile unsigned int*)(0x42A78F14UL)))
#define bM4_PORT_PCRB14_PUU                       (*((volatile unsigned int*)(0x42A78F18UL)))
#define bM4_PORT_PCRB14_PIN                       (*((volatile unsigned int*)(0x42A78F20UL)))
#define bM4_PORT_PCRB14_INVE                      (*((volatile unsigned int*)(0x42A78F24UL)))
#define bM4_PORT_PCRB14_INTE                      (*((volatile unsigned int*)(0x42A78F30UL)))
#define bM4_PORT_PCRB14_LTE                       (*((volatile unsigned int*)(0x42A78F38UL)))
#define bM4_PORT_PCRB14_DDIS                      (*((volatile unsigned int*)(0x42A78F3CUL)))
#define bM4_PORT_PFSRB14_FSEL0                    (*((volatile unsigned int*)(0x42A78F40UL)))
#define bM4_PORT_PFSRB14_FSEL1                    (*((volatile unsigned int*)(0x42A78F44UL)))
#define bM4_PORT_PFSRB14_FSEL2                    (*((volatile unsigned int*)(0x42A78F48UL)))
#define bM4_PORT_PFSRB14_FSEL3                    (*((volatile unsigned int*)(0x42A78F4CUL)))
#define bM4_PORT_PFSRB14_FSEL4                    (*((volatile unsigned int*)(0x42A78F50UL)))
#define bM4_PORT_PFSRB14_FSEL5                    (*((volatile unsigned int*)(0x42A78F54UL)))
#define bM4_PORT_PFSRB14_BFE                      (*((volatile unsigned int*)(0x42A78F60UL)))
#define bM4_PORT_PCRB15_POUT                      (*((volatile unsigned int*)(0x42A78F80UL)))
#define bM4_PORT_PCRB15_POUTE                     (*((volatile unsigned int*)(0x42A78F84UL)))
#define bM4_PORT_PCRB15_NOD                       (*((volatile unsigned int*)(0x42A78F88UL)))
#define bM4_PORT_PCRB15_DRV0                      (*((volatile unsigned int*)(0x42A78F90UL)))
#define bM4_PORT_PCRB15_DRV1                      (*((volatile unsigned int*)(0x42A78F94UL)))
#define bM4_PORT_PCRB15_PUU                       (*((volatile unsigned int*)(0x42A78F98UL)))
#define bM4_PORT_PCRB15_PIN                       (*((volatile unsigned int*)(0x42A78FA0UL)))
#define bM4_PORT_PCRB15_INVE                      (*((volatile unsigned int*)(0x42A78FA4UL)))
#define bM4_PORT_PCRB15_INTE                      (*((volatile unsigned int*)(0x42A78FB0UL)))
#define bM4_PORT_PCRB15_LTE                       (*((volatile unsigned int*)(0x42A78FB8UL)))
#define bM4_PORT_PCRB15_DDIS                      (*((volatile unsigned int*)(0x42A78FBCUL)))
#define bM4_PORT_PFSRB15_FSEL0                    (*((volatile unsigned int*)(0x42A78FC0UL)))
#define bM4_PORT_PFSRB15_FSEL1                    (*((volatile unsigned int*)(0x42A78FC4UL)))
#define bM4_PORT_PFSRB15_FSEL2                    (*((volatile unsigned int*)(0x42A78FC8UL)))
#define bM4_PORT_PFSRB15_FSEL3                    (*((volatile unsigned int*)(0x42A78FCCUL)))
#define bM4_PORT_PFSRB15_FSEL4                    (*((volatile unsigned int*)(0x42A78FD0UL)))
#define bM4_PORT_PFSRB15_FSEL5                    (*((volatile unsigned int*)(0x42A78FD4UL)))
#define bM4_PORT_PFSRB15_BFE                      (*((volatile unsigned int*)(0x42A78FE0UL)))
#define bM4_PORT_PCRC13_POUT                      (*((volatile unsigned int*)(0x42A79680UL)))
#define bM4_PORT_PCRC13_POUTE                     (*((volatile unsigned int*)(0x42A79684UL)))
#define bM4_PORT_PCRC13_NOD                       (*((volatile unsigned int*)(0x42A79688UL)))
#define bM4_PORT_PCRC13_DRV0                      (*((volatile unsigned int*)(0x42A79690UL)))
#define bM4_PORT_PCRC13_DRV1                      (*((volatile unsigned int*)(0x42A79694UL)))
#define bM4_PORT_PCRC13_PUU                       (*((volatile unsigned int*)(0x42A79698UL)))
#define bM4_PORT_PCRC13_PIN                       (*((volatile unsigned int*)(0x42A796A0UL)))
#define bM4_PORT_PCRC13_INVE                      (*((volatile unsigned int*)(0x42A796A4UL)))
#define bM4_PORT_PCRC13_INTE                      (*((volatile unsigned int*)(0x42A796B0UL)))
#define bM4_PORT_PCRC13_LTE                       (*((volatile unsigned int*)(0x42A796B8UL)))
#define bM4_PORT_PCRC13_DDIS                      (*((volatile unsigned int*)(0x42A796BCUL)))
#define bM4_PORT_PFSRC13_FSEL0                    (*((volatile unsigned int*)(0x42A796C0UL)))
#define bM4_PORT_PFSRC13_FSEL1                    (*((volatile unsigned int*)(0x42A796C4UL)))
#define bM4_PORT_PFSRC13_FSEL2                    (*((volatile unsigned int*)(0x42A796C8UL)))
#define bM4_PORT_PFSRC13_FSEL3                    (*((volatile unsigned int*)(0x42A796CCUL)))
#define bM4_PORT_PFSRC13_FSEL4                    (*((volatile unsigned int*)(0x42A796D0UL)))
#define bM4_PORT_PFSRC13_FSEL5                    (*((volatile unsigned int*)(0x42A796D4UL)))
#define bM4_PORT_PFSRC13_BFE                      (*((volatile unsigned int*)(0x42A796E0UL)))
#define bM4_PORT_PCRC14_POUT                      (*((volatile unsigned int*)(0x42A79700UL)))
#define bM4_PORT_PCRC14_POUTE                     (*((volatile unsigned int*)(0x42A79704UL)))
#define bM4_PORT_PCRC14_NOD                       (*((volatile unsigned int*)(0x42A79708UL)))
#define bM4_PORT_PCRC14_DRV0                      (*((volatile unsigned int*)(0x42A79710UL)))
#define bM4_PORT_PCRC14_DRV1                      (*((volatile unsigned int*)(0x42A79714UL)))
#define bM4_PORT_PCRC14_PUU                       (*((volatile unsigned int*)(0x42A79718UL)))
#define bM4_PORT_PCRC14_PIN                       (*((volatile unsigned int*)(0x42A79720UL)))
#define bM4_PORT_PCRC14_INVE                      (*((volatile unsigned int*)(0x42A79724UL)))
#define bM4_PORT_PCRC14_INTE                      (*((volatile unsigned int*)(0x42A79730UL)))
#define bM4_PORT_PCRC14_LTE                       (*((volatile unsigned int*)(0x42A79738UL)))
#define bM4_PORT_PCRC14_DDIS                      (*((volatile unsigned int*)(0x42A7973CUL)))
#define bM4_PORT_PFSRC14_FSEL0                    (*((volatile unsigned int*)(0x42A79740UL)))
#define bM4_PORT_PFSRC14_FSEL1                    (*((volatile unsigned int*)(0x42A79744UL)))
#define bM4_PORT_PFSRC14_FSEL2                    (*((volatile unsigned int*)(0x42A79748UL)))
#define bM4_PORT_PFSRC14_FSEL3                    (*((volatile unsigned int*)(0x42A7974CUL)))
#define bM4_PORT_PFSRC14_FSEL4                    (*((volatile unsigned int*)(0x42A79750UL)))
#define bM4_PORT_PFSRC14_FSEL5                    (*((volatile unsigned int*)(0x42A79754UL)))
#define bM4_PORT_PFSRC14_BFE                      (*((volatile unsigned int*)(0x42A79760UL)))
#define bM4_PORT_PCRC15_POUT                      (*((volatile unsigned int*)(0x42A79780UL)))
#define bM4_PORT_PCRC15_POUTE                     (*((volatile unsigned int*)(0x42A79784UL)))
#define bM4_PORT_PCRC15_NOD                       (*((volatile unsigned int*)(0x42A79788UL)))
#define bM4_PORT_PCRC15_DRV0                      (*((volatile unsigned int*)(0x42A79790UL)))
#define bM4_PORT_PCRC15_DRV1                      (*((volatile unsigned int*)(0x42A79794UL)))
#define bM4_PORT_PCRC15_PUU                       (*((volatile unsigned int*)(0x42A79798UL)))
#define bM4_PORT_PCRC15_PIN                       (*((volatile unsigned int*)(0x42A797A0UL)))
#define bM4_PORT_PCRC15_INVE                      (*((volatile unsigned int*)(0x42A797A4UL)))
#define bM4_PORT_PCRC15_INTE                      (*((volatile unsigned int*)(0x42A797B0UL)))
#define bM4_PORT_PCRC15_LTE                       (*((volatile unsigned int*)(0x42A797B8UL)))
#define bM4_PORT_PCRC15_DDIS                      (*((volatile unsigned int*)(0x42A797BCUL)))
#define bM4_PORT_PFSRC15_FSEL0                    (*((volatile unsigned int*)(0x42A797C0UL)))
#define bM4_PORT_PFSRC15_FSEL1                    (*((volatile unsigned int*)(0x42A797C4UL)))
#define bM4_PORT_PFSRC15_FSEL2                    (*((volatile unsigned int*)(0x42A797C8UL)))
#define bM4_PORT_PFSRC15_FSEL3                    (*((volatile unsigned int*)(0x42A797CCUL)))
#define bM4_PORT_PFSRC15_FSEL4                    (*((volatile unsigned int*)(0x42A797D0UL)))
#define bM4_PORT_PFSRC15_FSEL5                    (*((volatile unsigned int*)(0x42A797D4UL)))
#define bM4_PORT_PFSRC15_BFE                      (*((volatile unsigned int*)(0x42A797E0UL)))
#define bM4_PORT_PCRH0_POUT                       (*((volatile unsigned int*)(0x42A7A800UL)))
#define bM4_PORT_PCRH0_POUTE                      (*((volatile unsigned int*)(0x42A7A804UL)))
#define bM4_PORT_PCRH0_NOD                        (*((volatile unsigned int*)(0x42A7A808UL)))
#define bM4_PORT_PCRH0_DRV0                       (*((volatile unsigned int*)(0x42A7A810UL)))
#define bM4_PORT_PCRH0_DRV1                       (*((volatile unsigned int*)(0x42A7A814UL)))
#define bM4_PORT_PCRH0_PUU                        (*((volatile unsigned int*)(0x42A7A818UL)))
#define bM4_PORT_PCRH0_PIN                        (*((volatile unsigned int*)(0x42A7A820UL)))
#define bM4_PORT_PCRH0_INVE                       (*((volatile unsigned int*)(0x42A7A824UL)))
#define bM4_PORT_PCRH0_INTE                       (*((volatile unsigned int*)(0x42A7A830UL)))
#define bM4_PORT_PCRH0_LTE                        (*((volatile unsigned int*)(0x42A7A838UL)))
#define bM4_PORT_PCRH0_DDIS                       (*((volatile unsigned int*)(0x42A7A83CUL)))
#define bM4_PORT_PFSRH0_FSEL0                     (*((volatile unsigned int*)(0x42A7A840UL)))
#define bM4_PORT_PFSRH0_FSEL1                     (*((volatile unsigned int*)(0x42A7A844UL)))
#define bM4_PORT_PFSRH0_FSEL2                     (*((volatile unsigned int*)(0x42A7A848UL)))
#define bM4_PORT_PFSRH0_FSEL3                     (*((volatile unsigned int*)(0x42A7A84CUL)))
#define bM4_PORT_PFSRH0_FSEL4                     (*((volatile unsigned int*)(0x42A7A850UL)))
#define bM4_PORT_PFSRH0_FSEL5                     (*((volatile unsigned int*)(0x42A7A854UL)))
#define bM4_PORT_PFSRH0_BFE                       (*((volatile unsigned int*)(0x42A7A860UL)))
#define bM4_PORT_PCRH1_POUT                       (*((volatile unsigned int*)(0x42A7A880UL)))
#define bM4_PORT_PCRH1_POUTE                      (*((volatile unsigned int*)(0x42A7A884UL)))
#define bM4_PORT_PCRH1_NOD                        (*((volatile unsigned int*)(0x42A7A888UL)))
#define bM4_PORT_PCRH1_DRV0                       (*((volatile unsigned int*)(0x42A7A890UL)))
#define bM4_PORT_PCRH1_DRV1                       (*((volatile unsigned int*)(0x42A7A894UL)))
#define bM4_PORT_PCRH1_PUU                        (*((volatile unsigned int*)(0x42A7A898UL)))
#define bM4_PORT_PCRH1_PIN                        (*((volatile unsigned int*)(0x42A7A8A0UL)))
#define bM4_PORT_PCRH1_INVE                       (*((volatile unsigned int*)(0x42A7A8A4UL)))
#define bM4_PORT_PCRH1_INTE                       (*((volatile unsigned int*)(0x42A7A8B0UL)))
#define bM4_PORT_PCRH1_LTE                        (*((volatile unsigned int*)(0x42A7A8B8UL)))
#define bM4_PORT_PCRH1_DDIS                       (*((volatile unsigned int*)(0x42A7A8BCUL)))
#define bM4_PORT_PFSRH1_FSEL0                     (*((volatile unsigned int*)(0x42A7A8C0UL)))
#define bM4_PORT_PFSRH1_FSEL1                     (*((volatile unsigned int*)(0x42A7A8C4UL)))
#define bM4_PORT_PFSRH1_FSEL2                     (*((volatile unsigned int*)(0x42A7A8C8UL)))
#define bM4_PORT_PFSRH1_FSEL3                     (*((volatile unsigned int*)(0x42A7A8CCUL)))
#define bM4_PORT_PFSRH1_FSEL4                     (*((volatile unsigned int*)(0x42A7A8D0UL)))
#define bM4_PORT_PFSRH1_FSEL5                     (*((volatile unsigned int*)(0x42A7A8D4UL)))
#define bM4_PORT_PFSRH1_BFE                       (*((volatile unsigned int*)(0x42A7A8E0UL)))
#define bM4_PORT_PCRH2_POUT                       (*((volatile unsigned int*)(0x42A7A900UL)))
#define bM4_PORT_PCRH2_POUTE                      (*((volatile unsigned int*)(0x42A7A904UL)))
#define bM4_PORT_PCRH2_NOD                        (*((volatile unsigned int*)(0x42A7A908UL)))
#define bM4_PORT_PCRH2_DRV0                       (*((volatile unsigned int*)(0x42A7A910UL)))
#define bM4_PORT_PCRH2_DRV1                       (*((volatile unsigned int*)(0x42A7A914UL)))
#define bM4_PORT_PCRH2_PUU                        (*((volatile unsigned int*)(0x42A7A918UL)))
#define bM4_PORT_PCRH2_PIN                        (*((volatile unsigned int*)(0x42A7A920UL)))
#define bM4_PORT_PCRH2_INVE                       (*((volatile unsigned int*)(0x42A7A924UL)))
#define bM4_PORT_PCRH2_INTE                       (*((volatile unsigned int*)(0x42A7A930UL)))
#define bM4_PORT_PCRH2_LTE                        (*((volatile unsigned int*)(0x42A7A938UL)))
#define bM4_PORT_PCRH2_DDIS                       (*((volatile unsigned int*)(0x42A7A93CUL)))
#define bM4_PORT_PFSRH2_FSEL0                     (*((volatile unsigned int*)(0x42A7A940UL)))
#define bM4_PORT_PFSRH2_FSEL1                     (*((volatile unsigned int*)(0x42A7A944UL)))
#define bM4_PORT_PFSRH2_FSEL2                     (*((volatile unsigned int*)(0x42A7A948UL)))
#define bM4_PORT_PFSRH2_FSEL3                     (*((volatile unsigned int*)(0x42A7A94CUL)))
#define bM4_PORT_PFSRH2_FSEL4                     (*((volatile unsigned int*)(0x42A7A950UL)))
#define bM4_PORT_PFSRH2_FSEL5                     (*((volatile unsigned int*)(0x42A7A954UL)))
#define bM4_PORT_PFSRH2_BFE                       (*((volatile unsigned int*)(0x42A7A960UL)))
#define bM4_RTC_CR0_RESET                         (*((volatile unsigned int*)(0x42980000UL)))
#define bM4_RTC_CR1_PRDS0                         (*((volatile unsigned int*)(0x42980080UL)))
#define bM4_RTC_CR1_PRDS1                         (*((volatile unsigned int*)(0x42980084UL)))
#define bM4_RTC_CR1_PRDS2                         (*((volatile unsigned int*)(0x42980088UL)))
#define bM4_RTC_CR1_AMPM                          (*((volatile unsigned int*)(0x4298008CUL)))
#define bM4_RTC_CR1_ALMFCLR                       (*((volatile unsigned int*)(0x42980090UL)))
#define bM4_RTC_CR1_ONEHZOE                       (*((volatile unsigned int*)(0x42980094UL)))
#define bM4_RTC_CR1_ONEHZSEL                      (*((volatile unsigned int*)(0x42980098UL)))
#define bM4_RTC_CR1_START                         (*((volatile unsigned int*)(0x4298009CUL)))
#define bM4_RTC_CR2_RWREQ                         (*((volatile unsigned int*)(0x42980100UL)))
#define bM4_RTC_CR2_RWEN                          (*((volatile unsigned int*)(0x42980104UL)))
#define bM4_RTC_CR2_ALMF                          (*((volatile unsigned int*)(0x4298010CUL)))
#define bM4_RTC_CR2_PRDIE                         (*((volatile unsigned int*)(0x42980114UL)))
#define bM4_RTC_CR2_ALMIE                         (*((volatile unsigned int*)(0x42980118UL)))
#define bM4_RTC_CR2_ALME                          (*((volatile unsigned int*)(0x4298011CUL)))
#define bM4_RTC_CR3_LRCEN                         (*((volatile unsigned int*)(0x42980190UL)))
#define bM4_RTC_CR3_RCKSEL                        (*((volatile unsigned int*)(0x4298019CUL)))
#define bM4_RTC_SEC_SECU0                         (*((volatile unsigned int*)(0x42980200UL)))
#define bM4_RTC_SEC_SECU1                         (*((volatile unsigned int*)(0x42980204UL)))
#define bM4_RTC_SEC_SECU2                         (*((volatile unsigned int*)(0x42980208UL)))
#define bM4_RTC_SEC_SECU3                         (*((volatile unsigned int*)(0x4298020CUL)))
#define bM4_RTC_SEC_SECD0                         (*((volatile unsigned int*)(0x42980210UL)))
#define bM4_RTC_SEC_SECD1                         (*((volatile unsigned int*)(0x42980214UL)))
#define bM4_RTC_SEC_SECD2                         (*((volatile unsigned int*)(0x42980218UL)))
#define bM4_RTC_MIN_MINU0                         (*((volatile unsigned int*)(0x42980280UL)))
#define bM4_RTC_MIN_MINU1                         (*((volatile unsigned int*)(0x42980284UL)))
#define bM4_RTC_MIN_MINU2                         (*((volatile unsigned int*)(0x42980288UL)))
#define bM4_RTC_MIN_MINU3                         (*((volatile unsigned int*)(0x4298028CUL)))
#define bM4_RTC_MIN_MIND0                         (*((volatile unsigned int*)(0x42980290UL)))
#define bM4_RTC_MIN_MIND1                         (*((volatile unsigned int*)(0x42980294UL)))
#define bM4_RTC_MIN_MIND2                         (*((volatile unsigned int*)(0x42980298UL)))
#define bM4_RTC_HOUR_HOURU0                       (*((volatile unsigned int*)(0x42980300UL)))
#define bM4_RTC_HOUR_HOURU1                       (*((volatile unsigned int*)(0x42980304UL)))
#define bM4_RTC_HOUR_HOURU2                       (*((volatile unsigned int*)(0x42980308UL)))
#define bM4_RTC_HOUR_HOURU3                       (*((volatile unsigned int*)(0x4298030CUL)))
#define bM4_RTC_HOUR_HOURD0                       (*((volatile unsigned int*)(0x42980310UL)))
#define bM4_RTC_HOUR_HOURD1                       (*((volatile unsigned int*)(0x42980314UL)))
#define bM4_RTC_WEEK_WEEK0                        (*((volatile unsigned int*)(0x42980380UL)))
#define bM4_RTC_WEEK_WEEK1                        (*((volatile unsigned int*)(0x42980384UL)))
#define bM4_RTC_WEEK_WEEK2                        (*((volatile unsigned int*)(0x42980388UL)))
#define bM4_RTC_DAY_DAYU0                         (*((volatile unsigned int*)(0x42980400UL)))
#define bM4_RTC_DAY_DAYU1                         (*((volatile unsigned int*)(0x42980404UL)))
#define bM4_RTC_DAY_DAYU2                         (*((volatile unsigned int*)(0x42980408UL)))
#define bM4_RTC_DAY_DAYU3                         (*((volatile unsigned int*)(0x4298040CUL)))
#define bM4_RTC_DAY_DAYD0                         (*((volatile unsigned int*)(0x42980410UL)))
#define bM4_RTC_DAY_DAYD1                         (*((volatile unsigned int*)(0x42980414UL)))
#define bM4_RTC_MON_MON0                          (*((volatile unsigned int*)(0x42980480UL)))
#define bM4_RTC_MON_MON1                          (*((volatile unsigned int*)(0x42980484UL)))
#define bM4_RTC_MON_MON2                          (*((volatile unsigned int*)(0x42980488UL)))
#define bM4_RTC_MON_MON3                          (*((volatile unsigned int*)(0x4298048CUL)))
#define bM4_RTC_MON_MON4                          (*((volatile unsigned int*)(0x42980490UL)))
#define bM4_RTC_YEAR_YEARU0                       (*((volatile unsigned int*)(0x42980500UL)))
#define bM4_RTC_YEAR_YEARU1                       (*((volatile unsigned int*)(0x42980504UL)))
#define bM4_RTC_YEAR_YEARU2                       (*((volatile unsigned int*)(0x42980508UL)))
#define bM4_RTC_YEAR_YEARU3                       (*((volatile unsigned int*)(0x4298050CUL)))
#define bM4_RTC_YEAR_YEARD0                       (*((volatile unsigned int*)(0x42980510UL)))
#define bM4_RTC_YEAR_YEARD1                       (*((volatile unsigned int*)(0x42980514UL)))
#define bM4_RTC_YEAR_YEARD2                       (*((volatile unsigned int*)(0x42980518UL)))
#define bM4_RTC_YEAR_YEARD3                       (*((volatile unsigned int*)(0x4298051CUL)))
#define bM4_RTC_ALMMIN_ALMMINU0                   (*((volatile unsigned int*)(0x42980580UL)))
#define bM4_RTC_ALMMIN_ALMMINU1                   (*((volatile unsigned int*)(0x42980584UL)))
#define bM4_RTC_ALMMIN_ALMMINU2                   (*((volatile unsigned int*)(0x42980588UL)))
#define bM4_RTC_ALMMIN_ALMMINU3                   (*((volatile unsigned int*)(0x4298058CUL)))
#define bM4_RTC_ALMMIN_ALMMIND0                   (*((volatile unsigned int*)(0x42980590UL)))
#define bM4_RTC_ALMMIN_ALMMIND1                   (*((volatile unsigned int*)(0x42980594UL)))
#define bM4_RTC_ALMMIN_ALMMIND2                   (*((volatile unsigned int*)(0x42980598UL)))
#define bM4_RTC_ALMHOUR_ALMHOURU0                 (*((volatile unsigned int*)(0x42980600UL)))
#define bM4_RTC_ALMHOUR_ALMHOURU1                 (*((volatile unsigned int*)(0x42980604UL)))
#define bM4_RTC_ALMHOUR_ALMHOURU2                 (*((volatile unsigned int*)(0x42980608UL)))
#define bM4_RTC_ALMHOUR_ALMHOURU3                 (*((volatile unsigned int*)(0x4298060CUL)))
#define bM4_RTC_ALMHOUR_ALMHOURD0                 (*((volatile unsigned int*)(0x42980610UL)))
#define bM4_RTC_ALMHOUR_ALMHOURD1                 (*((volatile unsigned int*)(0x42980614UL)))
#define bM4_RTC_ALMWEEK_ALMWEEK0                  (*((volatile unsigned int*)(0x42980680UL)))
#define bM4_RTC_ALMWEEK_ALMWEEK1                  (*((volatile unsigned int*)(0x42980684UL)))
#define bM4_RTC_ALMWEEK_ALMWEEK2                  (*((volatile unsigned int*)(0x42980688UL)))
#define bM4_RTC_ALMWEEK_ALMWEEK3                  (*((volatile unsigned int*)(0x4298068CUL)))
#define bM4_RTC_ALMWEEK_ALMWEEK4                  (*((volatile unsigned int*)(0x42980690UL)))
#define bM4_RTC_ALMWEEK_ALMWEEK5                  (*((volatile unsigned int*)(0x42980694UL)))
#define bM4_RTC_ALMWEEK_ALMWEEK6                  (*((volatile unsigned int*)(0x42980698UL)))
#define bM4_RTC_ERRCRH_COMP8                      (*((volatile unsigned int*)(0x42980700UL)))
#define bM4_RTC_ERRCRH_COMPEN                     (*((volatile unsigned int*)(0x4298071CUL)))
#define bM4_RTC_ERRCRL_COMP0                      (*((volatile unsigned int*)(0x42980780UL)))
#define bM4_RTC_ERRCRL_COMP1                      (*((volatile unsigned int*)(0x42980784UL)))
#define bM4_RTC_ERRCRL_COMP2                      (*((volatile unsigned int*)(0x42980788UL)))
#define bM4_RTC_ERRCRL_COMP3                      (*((volatile unsigned int*)(0x4298078CUL)))
#define bM4_RTC_ERRCRL_COMP4                      (*((volatile unsigned int*)(0x42980790UL)))
#define bM4_RTC_ERRCRL_COMP5                      (*((volatile unsigned int*)(0x42980794UL)))
#define bM4_RTC_ERRCRL_COMP6                      (*((volatile unsigned int*)(0x42980798UL)))
#define bM4_RTC_ERRCRL_COMP7                      (*((volatile unsigned int*)(0x4298079CUL)))
#define bM4_SDIOC1_BLKSIZE_TBS0                   (*((volatile unsigned int*)(0x42DF8080UL)))
#define bM4_SDIOC1_BLKSIZE_TBS1                   (*((volatile unsigned int*)(0x42DF8084UL)))
#define bM4_SDIOC1_BLKSIZE_TBS2                   (*((volatile unsigned int*)(0x42DF8088UL)))
#define bM4_SDIOC1_BLKSIZE_TBS3                   (*((volatile unsigned int*)(0x42DF808CUL)))
#define bM4_SDIOC1_BLKSIZE_TBS4                   (*((volatile unsigned int*)(0x42DF8090UL)))
#define bM4_SDIOC1_BLKSIZE_TBS5                   (*((volatile unsigned int*)(0x42DF8094UL)))
#define bM4_SDIOC1_BLKSIZE_TBS6                   (*((volatile unsigned int*)(0x42DF8098UL)))
#define bM4_SDIOC1_BLKSIZE_TBS7                   (*((volatile unsigned int*)(0x42DF809CUL)))
#define bM4_SDIOC1_BLKSIZE_TBS8                   (*((volatile unsigned int*)(0x42DF80A0UL)))
