SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460jeta_template/common/hc32f460jeta.h
#define bM4_SDIOC1_BLKSIZE_TBS9                   (*((volatile unsigned int*)(0x42DF80A4UL)))
#define bM4_SDIOC1_BLKSIZE_TBS10                  (*((volatile unsigned int*)(0x42DF80A8UL)))
#define bM4_SDIOC1_BLKSIZE_TBS11                  (*((volatile unsigned int*)(0x42DF80ACUL)))
#define bM4_SDIOC1_TRANSMODE_BCE                  (*((volatile unsigned int*)(0x42DF8184UL)))
#define bM4_SDIOC1_TRANSMODE_ATCEN0               (*((volatile unsigned int*)(0x42DF8188UL)))
#define bM4_SDIOC1_TRANSMODE_ATCEN1               (*((volatile unsigned int*)(0x42DF818CUL)))
#define bM4_SDIOC1_TRANSMODE_DDIR                 (*((volatile unsigned int*)(0x42DF8190UL)))
#define bM4_SDIOC1_TRANSMODE_MULB                 (*((volatile unsigned int*)(0x42DF8194UL)))
#define bM4_SDIOC1_CMD_RESTYP0                    (*((volatile unsigned int*)(0x42DF81C0UL)))
#define bM4_SDIOC1_CMD_RESTYP1                    (*((volatile unsigned int*)(0x42DF81C4UL)))
#define bM4_SDIOC1_CMD_CCE                        (*((volatile unsigned int*)(0x42DF81CCUL)))
#define bM4_SDIOC1_CMD_ICE                        (*((volatile unsigned int*)(0x42DF81D0UL)))
#define bM4_SDIOC1_CMD_DAT                        (*((volatile unsigned int*)(0x42DF81D4UL)))
#define bM4_SDIOC1_CMD_TYP0                       (*((volatile unsigned int*)(0x42DF81D8UL)))
#define bM4_SDIOC1_CMD_TYP1                       (*((volatile unsigned int*)(0x42DF81DCUL)))
#define bM4_SDIOC1_CMD_IDX0                       (*((volatile unsigned int*)(0x42DF81E0UL)))
#define bM4_SDIOC1_CMD_IDX1                       (*((volatile unsigned int*)(0x42DF81E4UL)))
#define bM4_SDIOC1_CMD_IDX2                       (*((volatile unsigned int*)(0x42DF81E8UL)))
#define bM4_SDIOC1_CMD_IDX3                       (*((volatile unsigned int*)(0x42DF81ECUL)))
#define bM4_SDIOC1_CMD_IDX4                       (*((volatile unsigned int*)(0x42DF81F0UL)))
#define bM4_SDIOC1_CMD_IDX5                       (*((volatile unsigned int*)(0x42DF81F4UL)))
#define bM4_SDIOC1_PSTAT_CIC                      (*((volatile unsigned int*)(0x42DF8480UL)))
#define bM4_SDIOC1_PSTAT_CID                      (*((volatile unsigned int*)(0x42DF8484UL)))
#define bM4_SDIOC1_PSTAT_DA                       (*((volatile unsigned int*)(0x42DF8488UL)))
#define bM4_SDIOC1_PSTAT_WTA                      (*((volatile unsigned int*)(0x42DF84A0UL)))
#define bM4_SDIOC1_PSTAT_RTA                      (*((volatile unsigned int*)(0x42DF84A4UL)))
#define bM4_SDIOC1_PSTAT_BWE                      (*((volatile unsigned int*)(0x42DF84A8UL)))
#define bM4_SDIOC1_PSTAT_BRE                      (*((volatile unsigned int*)(0x42DF84ACUL)))
#define bM4_SDIOC1_PSTAT_CIN                      (*((volatile unsigned int*)(0x42DF84C0UL)))
#define bM4_SDIOC1_PSTAT_CSS                      (*((volatile unsigned int*)(0x42DF84C4UL)))
#define bM4_SDIOC1_PSTAT_CDL                      (*((volatile unsigned int*)(0x42DF84C8UL)))
#define bM4_SDIOC1_PSTAT_WPL                      (*((volatile unsigned int*)(0x42DF84CCUL)))
#define bM4_SDIOC1_PSTAT_DATL0                    (*((volatile unsigned int*)(0x42DF84D0UL)))
#define bM4_SDIOC1_PSTAT_DATL1                    (*((volatile unsigned int*)(0x42DF84D4UL)))
#define bM4_SDIOC1_PSTAT_DATL2                    (*((volatile unsigned int*)(0x42DF84D8UL)))
#define bM4_SDIOC1_PSTAT_DATL3                    (*((volatile unsigned int*)(0x42DF84DCUL)))
#define bM4_SDIOC1_PSTAT_CMDL                     (*((volatile unsigned int*)(0x42DF84E0UL)))
#define bM4_SDIOC1_HOSTCON_DW                     (*((volatile unsigned int*)(0x42DF8504UL)))
#define bM4_SDIOC1_HOSTCON_HSEN                   (*((volatile unsigned int*)(0x42DF8508UL)))
#define bM4_SDIOC1_HOSTCON_EXDW                   (*((volatile unsigned int*)(0x42DF8514UL)))
#define bM4_SDIOC1_HOSTCON_CDTL                   (*((volatile unsigned int*)(0x42DF8518UL)))
#define bM4_SDIOC1_HOSTCON_CDSS                   (*((volatile unsigned int*)(0x42DF851CUL)))
#define bM4_SDIOC1_PWRCON_PWON                    (*((volatile unsigned int*)(0x42DF8520UL)))
#define bM4_SDIOC1_BLKGPCON_SABGR                 (*((volatile unsigned int*)(0x42DF8540UL)))
#define bM4_SDIOC1_BLKGPCON_CR                    (*((volatile unsigned int*)(0x42DF8544UL)))
#define bM4_SDIOC1_BLKGPCON_RWC                   (*((volatile unsigned int*)(0x42DF8548UL)))
#define bM4_SDIOC1_BLKGPCON_IABG                  (*((volatile unsigned int*)(0x42DF854CUL)))
#define bM4_SDIOC1_CLKCON_ICE                     (*((volatile unsigned int*)(0x42DF8580UL)))
#define bM4_SDIOC1_CLKCON_CE                      (*((volatile unsigned int*)(0x42DF8588UL)))
#define bM4_SDIOC1_CLKCON_FS0                     (*((volatile unsigned int*)(0x42DF85A0UL)))
#define bM4_SDIOC1_CLKCON_FS1                     (*((volatile unsigned int*)(0x42DF85A4UL)))
#define bM4_SDIOC1_CLKCON_FS2                     (*((volatile unsigned int*)(0x42DF85A8UL)))
#define bM4_SDIOC1_CLKCON_FS3                     (*((volatile unsigned int*)(0x42DF85ACUL)))
#define bM4_SDIOC1_CLKCON_FS4                     (*((volatile unsigned int*)(0x42DF85B0UL)))
#define bM4_SDIOC1_CLKCON_FS5                     (*((volatile unsigned int*)(0x42DF85B4UL)))
#define bM4_SDIOC1_CLKCON_FS6                     (*((volatile unsigned int*)(0x42DF85B8UL)))
#define bM4_SDIOC1_CLKCON_FS7                     (*((volatile unsigned int*)(0x42DF85BCUL)))
#define bM4_SDIOC1_TOUTCON_DTO0                   (*((volatile unsigned int*)(0x42DF85C0UL)))
#define bM4_SDIOC1_TOUTCON_DTO1                   (*((volatile unsigned int*)(0x42DF85C4UL)))
#define bM4_SDIOC1_TOUTCON_DTO2                   (*((volatile unsigned int*)(0x42DF85C8UL)))
#define bM4_SDIOC1_TOUTCON_DTO3                   (*((volatile unsigned int*)(0x42DF85CCUL)))
#define bM4_SDIOC1_SFTRST_RSTA                    (*((volatile unsigned int*)(0x42DF85E0UL)))
#define bM4_SDIOC1_SFTRST_RSTC                    (*((volatile unsigned int*)(0x42DF85E4UL)))
#define bM4_SDIOC1_SFTRST_RSTD                    (*((volatile unsigned int*)(0x42DF85E8UL)))
#define bM4_SDIOC1_NORINTST_CC                    (*((volatile unsigned int*)(0x42DF8600UL)))
#define bM4_SDIOC1_NORINTST_TC                    (*((volatile unsigned int*)(0x42DF8604UL)))
#define bM4_SDIOC1_NORINTST_BGE                   (*((volatile unsigned int*)(0x42DF8608UL)))
#define bM4_SDIOC1_NORINTST_BWR                   (*((volatile unsigned int*)(0x42DF8610UL)))
#define bM4_SDIOC1_NORINTST_BRR                   (*((volatile unsigned int*)(0x42DF8614UL)))
#define bM4_SDIOC1_NORINTST_CIST                  (*((volatile unsigned int*)(0x42DF8618UL)))
#define bM4_SDIOC1_NORINTST_CRM                   (*((volatile unsigned int*)(0x42DF861CUL)))
#define bM4_SDIOC1_NORINTST_CINT                  (*((volatile unsigned int*)(0x42DF8620UL)))
#define bM4_SDIOC1_NORINTST_EI                    (*((volatile unsigned int*)(0x42DF863CUL)))
#define bM4_SDIOC1_ERRINTST_CTOE                  (*((volatile unsigned int*)(0x42DF8640UL)))
#define bM4_SDIOC1_ERRINTST_CCE                   (*((volatile unsigned int*)(0x42DF8644UL)))
#define bM4_SDIOC1_ERRINTST_CEBE                  (*((volatile unsigned int*)(0x42DF8648UL)))
#define bM4_SDIOC1_ERRINTST_CIE                   (*((volatile unsigned int*)(0x42DF864CUL)))
#define bM4_SDIOC1_ERRINTST_DTOE                  (*((volatile unsigned int*)(0x42DF8650UL)))
#define bM4_SDIOC1_ERRINTST_DCE                   (*((volatile unsigned int*)(0x42DF8654UL)))
#define bM4_SDIOC1_ERRINTST_DEBE                  (*((volatile unsigned int*)(0x42DF8658UL)))
#define bM4_SDIOC1_ERRINTST_ACE                   (*((volatile unsigned int*)(0x42DF8660UL)))
#define bM4_SDIOC1_NORINTSTEN_CCEN                (*((volatile unsigned int*)(0x42DF8680UL)))
#define bM4_SDIOC1_NORINTSTEN_TCEN                (*((volatile unsigned int*)(0x42DF8684UL)))
#define bM4_SDIOC1_NORINTSTEN_BGEEN               (*((volatile unsigned int*)(0x42DF8688UL)))
#define bM4_SDIOC1_NORINTSTEN_BWREN               (*((volatile unsigned int*)(0x42DF8690UL)))
#define bM4_SDIOC1_NORINTSTEN_BRREN               (*((volatile unsigned int*)(0x42DF8694UL)))
#define bM4_SDIOC1_NORINTSTEN_CISTEN              (*((volatile unsigned int*)(0x42DF8698UL)))
#define bM4_SDIOC1_NORINTSTEN_CRMEN               (*((volatile unsigned int*)(0x42DF869CUL)))
#define bM4_SDIOC1_NORINTSTEN_CINTEN              (*((volatile unsigned int*)(0x42DF86A0UL)))
#define bM4_SDIOC1_ERRINTSTEN_CTOEEN              (*((volatile unsigned int*)(0x42DF86C0UL)))
#define bM4_SDIOC1_ERRINTSTEN_CCEEN               (*((volatile unsigned int*)(0x42DF86C4UL)))
#define bM4_SDIOC1_ERRINTSTEN_CEBEEN              (*((volatile unsigned int*)(0x42DF86C8UL)))
#define bM4_SDIOC1_ERRINTSTEN_CIEEN               (*((volatile unsigned int*)(0x42DF86CCUL)))
#define bM4_SDIOC1_ERRINTSTEN_DTOEEN              (*((volatile unsigned int*)(0x42DF86D0UL)))
#define bM4_SDIOC1_ERRINTSTEN_DCEEN               (*((volatile unsigned int*)(0x42DF86D4UL)))
#define bM4_SDIOC1_ERRINTSTEN_DEBEEN              (*((volatile unsigned int*)(0x42DF86D8UL)))
#define bM4_SDIOC1_ERRINTSTEN_ACEEN               (*((volatile unsigned int*)(0x42DF86E0UL)))
#define bM4_SDIOC1_NORINTSGEN_CCSEN               (*((volatile unsigned int*)(0x42DF8700UL)))
#define bM4_SDIOC1_NORINTSGEN_TCSEN               (*((volatile unsigned int*)(0x42DF8704UL)))
#define bM4_SDIOC1_NORINTSGEN_BGESEN              (*((volatile unsigned int*)(0x42DF8708UL)))
#define bM4_SDIOC1_NORINTSGEN_BWRSEN              (*((volatile unsigned int*)(0x42DF8710UL)))
#define bM4_SDIOC1_NORINTSGEN_BRRSEN              (*((volatile unsigned int*)(0x42DF8714UL)))
#define bM4_SDIOC1_NORINTSGEN_CISTSEN             (*((volatile unsigned int*)(0x42DF8718UL)))
#define bM4_SDIOC1_NORINTSGEN_CRMSEN              (*((volatile unsigned int*)(0x42DF871CUL)))
#define bM4_SDIOC1_NORINTSGEN_CINTSEN             (*((volatile unsigned int*)(0x42DF8720UL)))
#define bM4_SDIOC1_ERRINTSGEN_CTOESEN             (*((volatile unsigned int*)(0x42DF8740UL)))
#define bM4_SDIOC1_ERRINTSGEN_CCESEN              (*((volatile unsigned int*)(0x42DF8744UL)))
#define bM4_SDIOC1_ERRINTSGEN_CEBESEN             (*((volatile unsigned int*)(0x42DF8748UL)))
#define bM4_SDIOC1_ERRINTSGEN_CIESEN              (*((volatile unsigned int*)(0x42DF874CUL)))
#define bM4_SDIOC1_ERRINTSGEN_DTOESEN             (*((volatile unsigned int*)(0x42DF8750UL)))
#define bM4_SDIOC1_ERRINTSGEN_DCESEN              (*((volatile unsigned int*)(0x42DF8754UL)))
#define bM4_SDIOC1_ERRINTSGEN_DEBESEN             (*((volatile unsigned int*)(0x42DF8758UL)))
#define bM4_SDIOC1_ERRINTSGEN_ACESEN              (*((volatile unsigned int*)(0x42DF8760UL)))
#define bM4_SDIOC1_ATCERRST_NE                    (*((volatile unsigned int*)(0x42DF8780UL)))
#define bM4_SDIOC1_ATCERRST_TOE                   (*((volatile unsigned int*)(0x42DF8784UL)))
#define bM4_SDIOC1_ATCERRST_CE                    (*((volatile unsigned int*)(0x42DF8788UL)))
#define bM4_SDIOC1_ATCERRST_EBE                   (*((volatile unsigned int*)(0x42DF878CUL)))
#define bM4_SDIOC1_ATCERRST_IE                    (*((volatile unsigned int*)(0x42DF8790UL)))
#define bM4_SDIOC1_ATCERRST_CMDE                  (*((volatile unsigned int*)(0x42DF879CUL)))
#define bM4_SDIOC1_FEA_FNE                        (*((volatile unsigned int*)(0x42DF8A00UL)))
#define bM4_SDIOC1_FEA_FTOE                       (*((volatile unsigned int*)(0x42DF8A04UL)))
#define bM4_SDIOC1_FEA_FCE                        (*((volatile unsigned int*)(0x42DF8A08UL)))
#define bM4_SDIOC1_FEA_FEBE                       (*((volatile unsigned int*)(0x42DF8A0CUL)))
#define bM4_SDIOC1_FEA_FIE                        (*((volatile unsigned int*)(0x42DF8A10UL)))
#define bM4_SDIOC1_FEA_FCMDE                      (*((volatile unsigned int*)(0x42DF8A1CUL)))
#define bM4_SDIOC1_FEE_FCTOE                      (*((volatile unsigned int*)(0x42DF8A40UL)))
#define bM4_SDIOC1_FEE_FCCE                       (*((volatile unsigned int*)(0x42DF8A44UL)))
#define bM4_SDIOC1_FEE_FCEBE                      (*((volatile unsigned int*)(0x42DF8A48UL)))
#define bM4_SDIOC1_FEE_FCIE                       (*((volatile unsigned int*)(0x42DF8A4CUL)))
#define bM4_SDIOC1_FEE_FDTOE                      (*((volatile unsigned int*)(0x42DF8A50UL)))
#define bM4_SDIOC1_FEE_FDCE                       (*((volatile unsigned int*)(0x42DF8A54UL)))
#define bM4_SDIOC1_FEE_FDEBE                      (*((volatile unsigned int*)(0x42DF8A58UL)))
#define bM4_SDIOC1_FEE_FACE                       (*((volatile unsigned int*)(0x42DF8A60UL)))
#define bM4_SDIOC2_BLKSIZE_TBS0                   (*((volatile unsigned int*)(0x42E00080UL)))
#define bM4_SDIOC2_BLKSIZE_TBS1                   (*((volatile unsigned int*)(0x42E00084UL)))
#define bM4_SDIOC2_BLKSIZE_TBS2                   (*((volatile unsigned int*)(0x42E00088UL)))
#define bM4_SDIOC2_BLKSIZE_TBS3                   (*((volatile unsigned int*)(0x42E0008CUL)))
#define bM4_SDIOC2_BLKSIZE_TBS4                   (*((volatile unsigned int*)(0x42E00090UL)))
#define bM4_SDIOC2_BLKSIZE_TBS5                   (*((volatile unsigned int*)(0x42E00094UL)))
#define bM4_SDIOC2_BLKSIZE_TBS6                   (*((volatile unsigned int*)(0x42E00098UL)))
#define bM4_SDIOC2_BLKSIZE_TBS7                   (*((volatile unsigned int*)(0x42E0009CUL)))
#define bM4_SDIOC2_BLKSIZE_TBS8                   (*((volatile unsigned int*)(0x42E000A0UL)))
#define bM4_SDIOC2_BLKSIZE_TBS9                   (*((volatile unsigned int*)(0x42E000A4UL)))
#define bM4_SDIOC2_BLKSIZE_TBS10                  (*((volatile unsigned int*)(0x42E000A8UL)))
#define bM4_SDIOC2_BLKSIZE_TBS11                  (*((volatile unsigned int*)(0x42E000ACUL)))
#define bM4_SDIOC2_TRANSMODE_BCE                  (*((volatile unsigned int*)(0x42E00184UL)))
#define bM4_SDIOC2_TRANSMODE_ATCEN0               (*((volatile unsigned int*)(0x42E00188UL)))
#define bM4_SDIOC2_TRANSMODE_ATCEN1               (*((volatile unsigned int*)(0x42E0018CUL)))
#define bM4_SDIOC2_TRANSMODE_DDIR                 (*((volatile unsigned int*)(0x42E00190UL)))
#define bM4_SDIOC2_TRANSMODE_MULB                 (*((volatile unsigned int*)(0x42E00194UL)))
#define bM4_SDIOC2_CMD_RESTYP0                    (*((volatile unsigned int*)(0x42E001C0UL)))
#define bM4_SDIOC2_CMD_RESTYP1                    (*((volatile unsigned int*)(0x42E001C4UL)))
#define bM4_SDIOC2_CMD_CCE                        (*((volatile unsigned int*)(0x42E001CCUL)))
#define bM4_SDIOC2_CMD_ICE                        (*((volatile unsigned int*)(0x42E001D0UL)))
#define bM4_SDIOC2_CMD_DAT                        (*((volatile unsigned int*)(0x42E001D4UL)))
#define bM4_SDIOC2_CMD_TYP0                       (*((volatile unsigned int*)(0x42E001D8UL)))
#define bM4_SDIOC2_CMD_TYP1                       (*((volatile unsigned int*)(0x42E001DCUL)))
#define bM4_SDIOC2_CMD_IDX0                       (*((volatile unsigned int*)(0x42E001E0UL)))
#define bM4_SDIOC2_CMD_IDX1                       (*((volatile unsigned int*)(0x42E001E4UL)))
#define bM4_SDIOC2_CMD_IDX2                       (*((volatile unsigned int*)(0x42E001E8UL)))
#define bM4_SDIOC2_CMD_IDX3                       (*((volatile unsigned int*)(0x42E001ECUL)))
#define bM4_SDIOC2_CMD_IDX4                       (*((volatile unsigned int*)(0x42E001F0UL)))
#define bM4_SDIOC2_CMD_IDX5                       (*((volatile unsigned int*)(0x42E001F4UL)))
#define bM4_SDIOC2_PSTAT_CIC                      (*((volatile unsigned int*)(0x42E00480UL)))
#define bM4_SDIOC2_PSTAT_CID                      (*((volatile unsigned int*)(0x42E00484UL)))
#define bM4_SDIOC2_PSTAT_DA                       (*((volatile unsigned int*)(0x42E00488UL)))
#define bM4_SDIOC2_PSTAT_WTA                      (*((volatile unsigned int*)(0x42E004A0UL)))
#define bM4_SDIOC2_PSTAT_RTA                      (*((volatile unsigned int*)(0x42E004A4UL)))
#define bM4_SDIOC2_PSTAT_BWE                      (*((volatile unsigned int*)(0x42E004A8UL)))
#define bM4_SDIOC2_PSTAT_BRE                      (*((volatile unsigned int*)(0x42E004ACUL)))
#define bM4_SDIOC2_PSTAT_CIN                      (*((volatile unsigned int*)(0x42E004C0UL)))
#define bM4_SDIOC2_PSTAT_CSS                      (*((volatile unsigned int*)(0x42E004C4UL)))
#define bM4_SDIOC2_PSTAT_CDL                      (*((volatile unsigned int*)(0x42E004C8UL)))
#define bM4_SDIOC2_PSTAT_WPL                      (*((volatile unsigned int*)(0x42E004CCUL)))
#define bM4_SDIOC2_PSTAT_DATL0                    (*((volatile unsigned int*)(0x42E004D0UL)))
#define bM4_SDIOC2_PSTAT_DATL1                    (*((volatile unsigned int*)(0x42E004D4UL)))
#define bM4_SDIOC2_PSTAT_DATL2                    (*((volatile unsigned int*)(0x42E004D8UL)))
#define bM4_SDIOC2_PSTAT_DATL3                    (*((volatile unsigned int*)(0x42E004DCUL)))
#define bM4_SDIOC2_PSTAT_CMDL                     (*((volatile unsigned int*)(0x42E004E0UL)))
#define bM4_SDIOC2_HOSTCON_DW                     (*((volatile unsigned int*)(0x42E00504UL)))
#define bM4_SDIOC2_HOSTCON_HSEN                   (*((volatile unsigned int*)(0x42E00508UL)))
#define bM4_SDIOC2_HOSTCON_EXDW                   (*((volatile unsigned int*)(0x42E00514UL)))
#define bM4_SDIOC2_HOSTCON_CDTL                   (*((volatile unsigned int*)(0x42E00518UL)))
#define bM4_SDIOC2_HOSTCON_CDSS                   (*((volatile unsigned int*)(0x42E0051CUL)))
#define bM4_SDIOC2_PWRCON_PWON                    (*((volatile unsigned int*)(0x42E00520UL)))
#define bM4_SDIOC2_BLKGPCON_SABGR                 (*((volatile unsigned int*)(0x42E00540UL)))
#define bM4_SDIOC2_BLKGPCON_CR                    (*((volatile unsigned int*)(0x42E00544UL)))
#define bM4_SDIOC2_BLKGPCON_RWC                   (*((volatile unsigned int*)(0x42E00548UL)))
#define bM4_SDIOC2_BLKGPCON_IABG                  (*((volatile unsigned int*)(0x42E0054CUL)))
#define bM4_SDIOC2_CLKCON_ICE                     (*((volatile unsigned int*)(0x42E00580UL)))
#define bM4_SDIOC2_CLKCON_CE                      (*((volatile unsigned int*)(0x42E00588UL)))
#define bM4_SDIOC2_CLKCON_FS0                     (*((volatile unsigned int*)(0x42E005A0UL)))
#define bM4_SDIOC2_CLKCON_FS1                     (*((volatile unsigned int*)(0x42E005A4UL)))
#define bM4_SDIOC2_CLKCON_FS2                     (*((volatile unsigned int*)(0x42E005A8UL)))
#define bM4_SDIOC2_CLKCON_FS3                     (*((volatile unsigned int*)(0x42E005ACUL)))
#define bM4_SDIOC2_CLKCON_FS4                     (*((volatile unsigned int*)(0x42E005B0UL)))
#define bM4_SDIOC2_CLKCON_FS5                     (*((volatile unsigned int*)(0x42E005B4UL)))
#define bM4_SDIOC2_CLKCON_FS6                     (*((volatile unsigned int*)(0x42E005B8UL)))
#define bM4_SDIOC2_CLKCON_FS7                     (*((volatile unsigned int*)(0x42E005BCUL)))
#define bM4_SDIOC2_TOUTCON_DTO0                   (*((volatile unsigned int*)(0x42E005C0UL)))
#define bM4_SDIOC2_TOUTCON_DTO1                   (*((volatile unsigned int*)(0x42E005C4UL)))
#define bM4_SDIOC2_TOUTCON_DTO2                   (*((volatile unsigned int*)(0x42E005C8UL)))
#define bM4_SDIOC2_TOUTCON_DTO3                   (*((volatile unsigned int*)(0x42E005CCUL)))
#define bM4_SDIOC2_SFTRST_RSTA                    (*((volatile unsigned int*)(0x42E005E0UL)))
#define bM4_SDIOC2_SFTRST_RSTC                    (*((volatile unsigned int*)(0x42E005E4UL)))
#define bM4_SDIOC2_SFTRST_RSTD                    (*((volatile unsigned int*)(0x42E005E8UL)))
#define bM4_SDIOC2_NORINTST_CC                    (*((volatile unsigned int*)(0x42E00600UL)))
#define bM4_SDIOC2_NORINTST_TC                    (*((volatile unsigned int*)(0x42E00604UL)))
#define bM4_SDIOC2_NORINTST_BGE                   (*((volatile unsigned int*)(0x42E00608UL)))
#define bM4_SDIOC2_NORINTST_BWR                   (*((volatile unsigned int*)(0x42E00610UL)))
#define bM4_SDIOC2_NORINTST_BRR                   (*((volatile unsigned int*)(0x42E00614UL)))
#define bM4_SDIOC2_NORINTST_CIST                  (*((volatile unsigned int*)(0x42E00618UL)))
#define bM4_SDIOC2_NORINTST_CRM                   (*((volatile unsigned int*)(0x42E0061CUL)))
#define bM4_SDIOC2_NORINTST_CINT                  (*((volatile unsigned int*)(0x42E00620UL)))
#define bM4_SDIOC2_NORINTST_EI                    (*((volatile unsigned int*)(0x42E0063CUL)))
#define bM4_SDIOC2_ERRINTST_CTOE                  (*((volatile unsigned int*)(0x42E00640UL)))
#define bM4_SDIOC2_ERRINTST_CCE                   (*((volatile unsigned int*)(0x42E00644UL)))
#define bM4_SDIOC2_ERRINTST_CEBE                  (*((volatile unsigned int*)(0x42E00648UL)))
#define bM4_SDIOC2_ERRINTST_CIE                   (*((volatile unsigned int*)(0x42E0064CUL)))
#define bM4_SDIOC2_ERRINTST_DTOE                  (*((volatile unsigned int*)(0x42E00650UL)))
#define bM4_SDIOC2_ERRINTST_DCE                   (*((volatile unsigned int*)(0x42E00654UL)))
#define bM4_SDIOC2_ERRINTST_DEBE                  (*((volatile unsigned int*)(0x42E00658UL)))
#define bM4_SDIOC2_ERRINTST_ACE                   (*((volatile unsigned int*)(0x42E00660UL)))
#define bM4_SDIOC2_NORINTSTEN_CCEN                (*((volatile unsigned int*)(0x42E00680UL)))
#define bM4_SDIOC2_NORINTSTEN_TCEN                (*((volatile unsigned int*)(0x42E00684UL)))
#define bM4_SDIOC2_NORINTSTEN_BGEEN               (*((volatile unsigned int*)(0x42E00688UL)))
#define bM4_SDIOC2_NORINTSTEN_BWREN               (*((volatile unsigned int*)(0x42E00690UL)))
#define bM4_SDIOC2_NORINTSTEN_BRREN               (*((volatile unsigned int*)(0x42E00694UL)))
#define bM4_SDIOC2_NORINTSTEN_CISTEN              (*((volatile unsigned int*)(0x42E00698UL)))
#define bM4_SDIOC2_NORINTSTEN_CRMEN               (*((volatile unsigned int*)(0x42E0069CUL)))
#define bM4_SDIOC2_NORINTSTEN_CINTEN              (*((volatile unsigned int*)(0x42E006A0UL)))
#define bM4_SDIOC2_ERRINTSTEN_CTOEEN              (*((volatile unsigned int*)(0x42E006C0UL)))
#define bM4_SDIOC2_ERRINTSTEN_CCEEN               (*((volatile unsigned int*)(0x42E006C4UL)))
#define bM4_SDIOC2_ERRINTSTEN_CEBEEN              (*((volatile unsigned int*)(0x42E006C8UL)))
#define bM4_SDIOC2_ERRINTSTEN_CIEEN               (*((volatile unsigned int*)(0x42E006CCUL)))
#define bM4_SDIOC2_ERRINTSTEN_DTOEEN              (*((volatile unsigned int*)(0x42E006D0UL)))
#define bM4_SDIOC2_ERRINTSTEN_DCEEN               (*((volatile unsigned int*)(0x42E006D4UL)))
#define bM4_SDIOC2_ERRINTSTEN_DEBEEN              (*((volatile unsigned int*)(0x42E006D8UL)))
#define bM4_SDIOC2_ERRINTSTEN_ACEEN               (*((volatile unsigned int*)(0x42E006E0UL)))
#define bM4_SDIOC2_NORINTSGEN_CCSEN               (*((volatile unsigned int*)(0x42E00700UL)))
#define bM4_SDIOC2_NORINTSGEN_TCSEN               (*((volatile unsigned int*)(0x42E00704UL)))
#define bM4_SDIOC2_NORINTSGEN_BGESEN              (*((volatile unsigned int*)(0x42E00708UL)))
#define bM4_SDIOC2_NORINTSGEN_BWRSEN              (*((volatile unsigned int*)(0x42E00710UL)))
#define bM4_SDIOC2_NORINTSGEN_BRRSEN              (*((volatile unsigned int*)(0x42E00714UL)))
#define bM4_SDIOC2_NORINTSGEN_CISTSEN             (*((volatile unsigned int*)(0x42E00718UL)))
#define bM4_SDIOC2_NORINTSGEN_CRMSEN              (*((volatile unsigned int*)(0x42E0071CUL)))
#define bM4_SDIOC2_NORINTSGEN_CINTSEN             (*((volatile unsigned int*)(0x42E00720UL)))
#define bM4_SDIOC2_ERRINTSGEN_CTOESEN             (*((volatile unsigned int*)(0x42E00740UL)))
#define bM4_SDIOC2_ERRINTSGEN_CCESEN              (*((volatile unsigned int*)(0x42E00744UL)))
#define bM4_SDIOC2_ERRINTSGEN_CEBESEN             (*((volatile unsigned int*)(0x42E00748UL)))
#define bM4_SDIOC2_ERRINTSGEN_CIESEN              (*((volatile unsigned int*)(0x42E0074CUL)))
#define bM4_SDIOC2_ERRINTSGEN_DTOESEN             (*((volatile unsigned int*)(0x42E00750UL)))
#define bM4_SDIOC2_ERRINTSGEN_DCESEN              (*((volatile unsigned int*)(0x42E00754UL)))
#define bM4_SDIOC2_ERRINTSGEN_DEBESEN             (*((volatile unsigned int*)(0x42E00758UL)))
#define bM4_SDIOC2_ERRINTSGEN_ACESEN              (*((volatile unsigned int*)(0x42E00760UL)))
