SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460jeta_template/common/hc32f460jeta.h
#define bM4_SDIOC2_ATCERRST_NE                    (*((volatile unsigned int*)(0x42E00780UL)))
#define bM4_SDIOC2_ATCERRST_TOE                   (*((volatile unsigned int*)(0x42E00784UL)))
#define bM4_SDIOC2_ATCERRST_CE                    (*((volatile unsigned int*)(0x42E00788UL)))
#define bM4_SDIOC2_ATCERRST_EBE                   (*((volatile unsigned int*)(0x42E0078CUL)))
#define bM4_SDIOC2_ATCERRST_IE                    (*((volatile unsigned int*)(0x42E00790UL)))
#define bM4_SDIOC2_ATCERRST_CMDE                  (*((volatile unsigned int*)(0x42E0079CUL)))
#define bM4_SDIOC2_FEA_FNE                        (*((volatile unsigned int*)(0x42E00A00UL)))
#define bM4_SDIOC2_FEA_FTOE                       (*((volatile unsigned int*)(0x42E00A04UL)))
#define bM4_SDIOC2_FEA_FCE                        (*((volatile unsigned int*)(0x42E00A08UL)))
#define bM4_SDIOC2_FEA_FEBE                       (*((volatile unsigned int*)(0x42E00A0CUL)))
#define bM4_SDIOC2_FEA_FIE                        (*((volatile unsigned int*)(0x42E00A10UL)))
#define bM4_SDIOC2_FEA_FCMDE                      (*((volatile unsigned int*)(0x42E00A1CUL)))
#define bM4_SDIOC2_FEE_FCTOE                      (*((volatile unsigned int*)(0x42E00A40UL)))
#define bM4_SDIOC2_FEE_FCCE                       (*((volatile unsigned int*)(0x42E00A44UL)))
#define bM4_SDIOC2_FEE_FCEBE                      (*((volatile unsigned int*)(0x42E00A48UL)))
#define bM4_SDIOC2_FEE_FCIE                       (*((volatile unsigned int*)(0x42E00A4CUL)))
#define bM4_SDIOC2_FEE_FDTOE                      (*((volatile unsigned int*)(0x42E00A50UL)))
#define bM4_SDIOC2_FEE_FDCE                       (*((volatile unsigned int*)(0x42E00A54UL)))
#define bM4_SDIOC2_FEE_FDEBE                      (*((volatile unsigned int*)(0x42E00A58UL)))
#define bM4_SDIOC2_FEE_FACE                       (*((volatile unsigned int*)(0x42E00A60UL)))
#define bM4_SPI1_CR1_SPIMDS                       (*((volatile unsigned int*)(0x42380080UL)))
#define bM4_SPI1_CR1_TXMDS                        (*((volatile unsigned int*)(0x42380084UL)))
#define bM4_SPI1_CR1_MSTR                         (*((volatile unsigned int*)(0x4238008CUL)))
#define bM4_SPI1_CR1_SPLPBK                       (*((volatile unsigned int*)(0x42380090UL)))
#define bM4_SPI1_CR1_SPLPBK2                      (*((volatile unsigned int*)(0x42380094UL)))
#define bM4_SPI1_CR1_SPE                          (*((volatile unsigned int*)(0x42380098UL)))
#define bM4_SPI1_CR1_CSUSPE                       (*((volatile unsigned int*)(0x4238009CUL)))
#define bM4_SPI1_CR1_EIE                          (*((volatile unsigned int*)(0x423800A0UL)))
#define bM4_SPI1_CR1_TXIE                         (*((volatile unsigned int*)(0x423800A4UL)))
#define bM4_SPI1_CR1_RXIE                         (*((volatile unsigned int*)(0x423800A8UL)))
#define bM4_SPI1_CR1_IDIE                         (*((volatile unsigned int*)(0x423800ACUL)))
#define bM4_SPI1_CR1_MODFE                        (*((volatile unsigned int*)(0x423800B0UL)))
#define bM4_SPI1_CR1_PATE                         (*((volatile unsigned int*)(0x423800B4UL)))
#define bM4_SPI1_CR1_PAOE                         (*((volatile unsigned int*)(0x423800B8UL)))
#define bM4_SPI1_CR1_PAE                          (*((volatile unsigned int*)(0x423800BCUL)))
#define bM4_SPI1_CFG1_FTHLV0                      (*((volatile unsigned int*)(0x42380180UL)))
#define bM4_SPI1_CFG1_FTHLV1                      (*((volatile unsigned int*)(0x42380184UL)))
#define bM4_SPI1_CFG1_SPRDTD                      (*((volatile unsigned int*)(0x42380198UL)))
#define bM4_SPI1_CFG1_SS0PV                       (*((volatile unsigned int*)(0x423801A0UL)))
#define bM4_SPI1_CFG1_SS1PV                       (*((volatile unsigned int*)(0x423801A4UL)))
#define bM4_SPI1_CFG1_SS2PV                       (*((volatile unsigned int*)(0x423801A8UL)))
#define bM4_SPI1_CFG1_SS3PV                       (*((volatile unsigned int*)(0x423801ACUL)))
#define bM4_SPI1_CFG1_MSSI0                       (*((volatile unsigned int*)(0x423801D0UL)))
#define bM4_SPI1_CFG1_MSSI1                       (*((volatile unsigned int*)(0x423801D4UL)))
#define bM4_SPI1_CFG1_MSSI2                       (*((volatile unsigned int*)(0x423801D8UL)))
#define bM4_SPI1_CFG1_MSSDL0                      (*((volatile unsigned int*)(0x423801E0UL)))
#define bM4_SPI1_CFG1_MSSDL1                      (*((volatile unsigned int*)(0x423801E4UL)))
#define bM4_SPI1_CFG1_MSSDL2                      (*((volatile unsigned int*)(0x423801E8UL)))
#define bM4_SPI1_CFG1_MIDI0                       (*((volatile unsigned int*)(0x423801F0UL)))
#define bM4_SPI1_CFG1_MIDI1                       (*((volatile unsigned int*)(0x423801F4UL)))
#define bM4_SPI1_CFG1_MIDI2                       (*((volatile unsigned int*)(0x423801F8UL)))
#define bM4_SPI1_SR_OVRERF                        (*((volatile unsigned int*)(0x42380280UL)))
#define bM4_SPI1_SR_IDLNF                         (*((volatile unsigned int*)(0x42380284UL)))
#define bM4_SPI1_SR_MODFERF                       (*((volatile unsigned int*)(0x42380288UL)))
#define bM4_SPI1_SR_PERF                          (*((volatile unsigned int*)(0x4238028CUL)))
#define bM4_SPI1_SR_UDRERF                        (*((volatile unsigned int*)(0x42380290UL)))
#define bM4_SPI1_SR_TDEF                          (*((volatile unsigned int*)(0x42380294UL)))
#define bM4_SPI1_SR_RDFF                          (*((volatile unsigned int*)(0x4238029CUL)))
#define bM4_SPI1_CFG2_CPHA                        (*((volatile unsigned int*)(0x42380300UL)))
#define bM4_SPI1_CFG2_CPOL                        (*((volatile unsigned int*)(0x42380304UL)))
#define bM4_SPI1_CFG2_MBR0                        (*((volatile unsigned int*)(0x42380308UL)))
#define bM4_SPI1_CFG2_MBR1                        (*((volatile unsigned int*)(0x4238030CUL)))
#define bM4_SPI1_CFG2_MBR2                        (*((volatile unsigned int*)(0x42380310UL)))
#define bM4_SPI1_CFG2_SSA0                        (*((volatile unsigned int*)(0x42380314UL)))
#define bM4_SPI1_CFG2_SSA1                        (*((volatile unsigned int*)(0x42380318UL)))
#define bM4_SPI1_CFG2_SSA2                        (*((volatile unsigned int*)(0x4238031CUL)))
#define bM4_SPI1_CFG2_DSIZE0                      (*((volatile unsigned int*)(0x42380320UL)))
#define bM4_SPI1_CFG2_DSIZE1                      (*((volatile unsigned int*)(0x42380324UL)))
#define bM4_SPI1_CFG2_DSIZE2                      (*((volatile unsigned int*)(0x42380328UL)))
#define bM4_SPI1_CFG2_DSIZE3                      (*((volatile unsigned int*)(0x4238032CUL)))
#define bM4_SPI1_CFG2_LSBF                        (*((volatile unsigned int*)(0x42380330UL)))
#define bM4_SPI1_CFG2_MIDIE                       (*((volatile unsigned int*)(0x42380334UL)))
#define bM4_SPI1_CFG2_MSSDLE                      (*((volatile unsigned int*)(0x42380338UL)))
#define bM4_SPI1_CFG2_MSSIE                       (*((volatile unsigned int*)(0x4238033CUL)))
#define bM4_SPI2_CR1_SPIMDS                       (*((volatile unsigned int*)(0x42388080UL)))
#define bM4_SPI2_CR1_TXMDS                        (*((volatile unsigned int*)(0x42388084UL)))
#define bM4_SPI2_CR1_MSTR                         (*((volatile unsigned int*)(0x4238808CUL)))
#define bM4_SPI2_CR1_SPLPBK                       (*((volatile unsigned int*)(0x42388090UL)))
#define bM4_SPI2_CR1_SPLPBK2                      (*((volatile unsigned int*)(0x42388094UL)))
#define bM4_SPI2_CR1_SPE                          (*((volatile unsigned int*)(0x42388098UL)))
#define bM4_SPI2_CR1_CSUSPE                       (*((volatile unsigned int*)(0x4238809CUL)))
#define bM4_SPI2_CR1_EIE                          (*((volatile unsigned int*)(0x423880A0UL)))
#define bM4_SPI2_CR1_TXIE                         (*((volatile unsigned int*)(0x423880A4UL)))
#define bM4_SPI2_CR1_RXIE                         (*((volatile unsigned int*)(0x423880A8UL)))
#define bM4_SPI2_CR1_IDIE                         (*((volatile unsigned int*)(0x423880ACUL)))
#define bM4_SPI2_CR1_MODFE                        (*((volatile unsigned int*)(0x423880B0UL)))
#define bM4_SPI2_CR1_PATE                         (*((volatile unsigned int*)(0x423880B4UL)))
#define bM4_SPI2_CR1_PAOE                         (*((volatile unsigned int*)(0x423880B8UL)))
#define bM4_SPI2_CR1_PAE                          (*((volatile unsigned int*)(0x423880BCUL)))
#define bM4_SPI2_CFG1_FTHLV0                      (*((volatile unsigned int*)(0x42388180UL)))
#define bM4_SPI2_CFG1_FTHLV1                      (*((volatile unsigned int*)(0x42388184UL)))
#define bM4_SPI2_CFG1_SPRDTD                      (*((volatile unsigned int*)(0x42388198UL)))
#define bM4_SPI2_CFG1_SS0PV                       (*((volatile unsigned int*)(0x423881A0UL)))
#define bM4_SPI2_CFG1_SS1PV                       (*((volatile unsigned int*)(0x423881A4UL)))
#define bM4_SPI2_CFG1_SS2PV                       (*((volatile unsigned int*)(0x423881A8UL)))
#define bM4_SPI2_CFG1_SS3PV                       (*((volatile unsigned int*)(0x423881ACUL)))
#define bM4_SPI2_CFG1_MSSI0                       (*((volatile unsigned int*)(0x423881D0UL)))
#define bM4_SPI2_CFG1_MSSI1                       (*((volatile unsigned int*)(0x423881D4UL)))
#define bM4_SPI2_CFG1_MSSI2                       (*((volatile unsigned int*)(0x423881D8UL)))
#define bM4_SPI2_CFG1_MSSDL0                      (*((volatile unsigned int*)(0x423881E0UL)))
#define bM4_SPI2_CFG1_MSSDL1                      (*((volatile unsigned int*)(0x423881E4UL)))
#define bM4_SPI2_CFG1_MSSDL2                      (*((volatile unsigned int*)(0x423881E8UL)))
#define bM4_SPI2_CFG1_MIDI0                       (*((volatile unsigned int*)(0x423881F0UL)))
#define bM4_SPI2_CFG1_MIDI1                       (*((volatile unsigned int*)(0x423881F4UL)))
#define bM4_SPI2_CFG1_MIDI2                       (*((volatile unsigned int*)(0x423881F8UL)))
#define bM4_SPI2_SR_OVRERF                        (*((volatile unsigned int*)(0x42388280UL)))
#define bM4_SPI2_SR_IDLNF                         (*((volatile unsigned int*)(0x42388284UL)))
#define bM4_SPI2_SR_MODFERF                       (*((volatile unsigned int*)(0x42388288UL)))
#define bM4_SPI2_SR_PERF                          (*((volatile unsigned int*)(0x4238828CUL)))
#define bM4_SPI2_SR_UDRERF                        (*((volatile unsigned int*)(0x42388290UL)))
#define bM4_SPI2_SR_TDEF                          (*((volatile unsigned int*)(0x42388294UL)))
#define bM4_SPI2_SR_RDFF                          (*((volatile unsigned int*)(0x4238829CUL)))
#define bM4_SPI2_CFG2_CPHA                        (*((volatile unsigned int*)(0x42388300UL)))
#define bM4_SPI2_CFG2_CPOL                        (*((volatile unsigned int*)(0x42388304UL)))
#define bM4_SPI2_CFG2_MBR0                        (*((volatile unsigned int*)(0x42388308UL)))
#define bM4_SPI2_CFG2_MBR1                        (*((volatile unsigned int*)(0x4238830CUL)))
#define bM4_SPI2_CFG2_MBR2                        (*((volatile unsigned int*)(0x42388310UL)))
#define bM4_SPI2_CFG2_SSA0                        (*((volatile unsigned int*)(0x42388314UL)))
#define bM4_SPI2_CFG2_SSA1                        (*((volatile unsigned int*)(0x42388318UL)))
#define bM4_SPI2_CFG2_SSA2                        (*((volatile unsigned int*)(0x4238831CUL)))
#define bM4_SPI2_CFG2_DSIZE0                      (*((volatile unsigned int*)(0x42388320UL)))
#define bM4_SPI2_CFG2_DSIZE1                      (*((volatile unsigned int*)(0x42388324UL)))
#define bM4_SPI2_CFG2_DSIZE2                      (*((volatile unsigned int*)(0x42388328UL)))
#define bM4_SPI2_CFG2_DSIZE3                      (*((volatile unsigned int*)(0x4238832CUL)))
#define bM4_SPI2_CFG2_LSBF                        (*((volatile unsigned int*)(0x42388330UL)))
#define bM4_SPI2_CFG2_MIDIE                       (*((volatile unsigned int*)(0x42388334UL)))
#define bM4_SPI2_CFG2_MSSDLE                      (*((volatile unsigned int*)(0x42388338UL)))
#define bM4_SPI2_CFG2_MSSIE                       (*((volatile unsigned int*)(0x4238833CUL)))
#define bM4_SPI3_CR1_SPIMDS                       (*((volatile unsigned int*)(0x42400080UL)))
#define bM4_SPI3_CR1_TXMDS                        (*((volatile unsigned int*)(0x42400084UL)))
#define bM4_SPI3_CR1_MSTR                         (*((volatile unsigned int*)(0x4240008CUL)))
#define bM4_SPI3_CR1_SPLPBK                       (*((volatile unsigned int*)(0x42400090UL)))
#define bM4_SPI3_CR1_SPLPBK2                      (*((volatile unsigned int*)(0x42400094UL)))
#define bM4_SPI3_CR1_SPE                          (*((volatile unsigned int*)(0x42400098UL)))
#define bM4_SPI3_CR1_CSUSPE                       (*((volatile unsigned int*)(0x4240009CUL)))
#define bM4_SPI3_CR1_EIE                          (*((volatile unsigned int*)(0x424000A0UL)))
#define bM4_SPI3_CR1_TXIE                         (*((volatile unsigned int*)(0x424000A4UL)))
#define bM4_SPI3_CR1_RXIE                         (*((volatile unsigned int*)(0x424000A8UL)))
#define bM4_SPI3_CR1_IDIE                         (*((volatile unsigned int*)(0x424000ACUL)))
#define bM4_SPI3_CR1_MODFE                        (*((volatile unsigned int*)(0x424000B0UL)))
#define bM4_SPI3_CR1_PATE                         (*((volatile unsigned int*)(0x424000B4UL)))
#define bM4_SPI3_CR1_PAOE                         (*((volatile unsigned int*)(0x424000B8UL)))
#define bM4_SPI3_CR1_PAE                          (*((volatile unsigned int*)(0x424000BCUL)))
#define bM4_SPI3_CFG1_FTHLV0                      (*((volatile unsigned int*)(0x42400180UL)))
#define bM4_SPI3_CFG1_FTHLV1                      (*((volatile unsigned int*)(0x42400184UL)))
#define bM4_SPI3_CFG1_SPRDTD                      (*((volatile unsigned int*)(0x42400198UL)))
#define bM4_SPI3_CFG1_SS0PV                       (*((volatile unsigned int*)(0x424001A0UL)))
#define bM4_SPI3_CFG1_SS1PV                       (*((volatile unsigned int*)(0x424001A4UL)))
#define bM4_SPI3_CFG1_SS2PV                       (*((volatile unsigned int*)(0x424001A8UL)))
#define bM4_SPI3_CFG1_SS3PV                       (*((volatile unsigned int*)(0x424001ACUL)))
#define bM4_SPI3_CFG1_MSSI0                       (*((volatile unsigned int*)(0x424001D0UL)))
#define bM4_SPI3_CFG1_MSSI1                       (*((volatile unsigned int*)(0x424001D4UL)))
#define bM4_SPI3_CFG1_MSSI2                       (*((volatile unsigned int*)(0x424001D8UL)))
#define bM4_SPI3_CFG1_MSSDL0                      (*((volatile unsigned int*)(0x424001E0UL)))
#define bM4_SPI3_CFG1_MSSDL1                      (*((volatile unsigned int*)(0x424001E4UL)))
#define bM4_SPI3_CFG1_MSSDL2                      (*((volatile unsigned int*)(0x424001E8UL)))
#define bM4_SPI3_CFG1_MIDI0                       (*((volatile unsigned int*)(0x424001F0UL)))
#define bM4_SPI3_CFG1_MIDI1                       (*((volatile unsigned int*)(0x424001F4UL)))
#define bM4_SPI3_CFG1_MIDI2                       (*((volatile unsigned int*)(0x424001F8UL)))
#define bM4_SPI3_SR_OVRERF                        (*((volatile unsigned int*)(0x42400280UL)))
#define bM4_SPI3_SR_IDLNF                         (*((volatile unsigned int*)(0x42400284UL)))
#define bM4_SPI3_SR_MODFERF                       (*((volatile unsigned int*)(0x42400288UL)))
#define bM4_SPI3_SR_PERF                          (*((volatile unsigned int*)(0x4240028CUL)))
#define bM4_SPI3_SR_UDRERF                        (*((volatile unsigned int*)(0x42400290UL)))
#define bM4_SPI3_SR_TDEF                          (*((volatile unsigned int*)(0x42400294UL)))
#define bM4_SPI3_SR_RDFF                          (*((volatile unsigned int*)(0x4240029CUL)))
#define bM4_SPI3_CFG2_CPHA                        (*((volatile unsigned int*)(0x42400300UL)))
#define bM4_SPI3_CFG2_CPOL                        (*((volatile unsigned int*)(0x42400304UL)))
#define bM4_SPI3_CFG2_MBR0                        (*((volatile unsigned int*)(0x42400308UL)))
#define bM4_SPI3_CFG2_MBR1                        (*((volatile unsigned int*)(0x4240030CUL)))
#define bM4_SPI3_CFG2_MBR2                        (*((volatile unsigned int*)(0x42400310UL)))
#define bM4_SPI3_CFG2_SSA0                        (*((volatile unsigned int*)(0x42400314UL)))
#define bM4_SPI3_CFG2_SSA1                        (*((volatile unsigned int*)(0x42400318UL)))
#define bM4_SPI3_CFG2_SSA2                        (*((volatile unsigned int*)(0x4240031CUL)))
#define bM4_SPI3_CFG2_DSIZE0                      (*((volatile unsigned int*)(0x42400320UL)))
#define bM4_SPI3_CFG2_DSIZE1                      (*((volatile unsigned int*)(0x42400324UL)))
#define bM4_SPI3_CFG2_DSIZE2                      (*((volatile unsigned int*)(0x42400328UL)))
#define bM4_SPI3_CFG2_DSIZE3                      (*((volatile unsigned int*)(0x4240032CUL)))
#define bM4_SPI3_CFG2_LSBF                        (*((volatile unsigned int*)(0x42400330UL)))
#define bM4_SPI3_CFG2_MIDIE                       (*((volatile unsigned int*)(0x42400334UL)))
#define bM4_SPI3_CFG2_MSSDLE                      (*((volatile unsigned int*)(0x42400338UL)))
#define bM4_SPI3_CFG2_MSSIE                       (*((volatile unsigned int*)(0x4240033CUL)))
#define bM4_SPI4_CR1_SPIMDS                       (*((volatile unsigned int*)(0x42408080UL)))
#define bM4_SPI4_CR1_TXMDS                        (*((volatile unsigned int*)(0x42408084UL)))
#define bM4_SPI4_CR1_MSTR                         (*((volatile unsigned int*)(0x4240808CUL)))
#define bM4_SPI4_CR1_SPLPBK                       (*((volatile unsigned int*)(0x42408090UL)))
#define bM4_SPI4_CR1_SPLPBK2                      (*((volatile unsigned int*)(0x42408094UL)))
#define bM4_SPI4_CR1_SPE                          (*((volatile unsigned int*)(0x42408098UL)))
#define bM4_SPI4_CR1_CSUSPE                       (*((volatile unsigned int*)(0x4240809CUL)))
#define bM4_SPI4_CR1_EIE                          (*((volatile unsigned int*)(0x424080A0UL)))
#define bM4_SPI4_CR1_TXIE                         (*((volatile unsigned int*)(0x424080A4UL)))
#define bM4_SPI4_CR1_RXIE                         (*((volatile unsigned int*)(0x424080A8UL)))
#define bM4_SPI4_CR1_IDIE                         (*((volatile unsigned int*)(0x424080ACUL)))
#define bM4_SPI4_CR1_MODFE                        (*((volatile unsigned int*)(0x424080B0UL)))
#define bM4_SPI4_CR1_PATE                         (*((volatile unsigned int*)(0x424080B4UL)))
#define bM4_SPI4_CR1_PAOE                         (*((volatile unsigned int*)(0x424080B8UL)))
#define bM4_SPI4_CR1_PAE                          (*((volatile unsigned int*)(0x424080BCUL)))
#define bM4_SPI4_CFG1_FTHLV0                      (*((volatile unsigned int*)(0x42408180UL)))
#define bM4_SPI4_CFG1_FTHLV1                      (*((volatile unsigned int*)(0x42408184UL)))
#define bM4_SPI4_CFG1_SPRDTD                      (*((volatile unsigned int*)(0x42408198UL)))
#define bM4_SPI4_CFG1_SS0PV                       (*((volatile unsigned int*)(0x424081A0UL)))
#define bM4_SPI4_CFG1_SS1PV                       (*((volatile unsigned int*)(0x424081A4UL)))
#define bM4_SPI4_CFG1_SS2PV                       (*((volatile unsigned int*)(0x424081A8UL)))
#define bM4_SPI4_CFG1_SS3PV                       (*((volatile unsigned int*)(0x424081ACUL)))
#define bM4_SPI4_CFG1_MSSI0                       (*((volatile unsigned int*)(0x424081D0UL)))
#define bM4_SPI4_CFG1_MSSI1                       (*((volatile unsigned int*)(0x424081D4UL)))
#define bM4_SPI4_CFG1_MSSI2                       (*((volatile unsigned int*)(0x424081D8UL)))
#define bM4_SPI4_CFG1_MSSDL0                      (*((volatile unsigned int*)(0x424081E0UL)))
#define bM4_SPI4_CFG1_MSSDL1                      (*((volatile unsigned int*)(0x424081E4UL)))
#define bM4_SPI4_CFG1_MSSDL2                      (*((volatile unsigned int*)(0x424081E8UL)))
#define bM4_SPI4_CFG1_MIDI0                       (*((volatile unsigned int*)(0x424081F0UL)))
#define bM4_SPI4_CFG1_MIDI1                       (*((volatile unsigned int*)(0x424081F4UL)))
#define bM4_SPI4_CFG1_MIDI2                       (*((volatile unsigned int*)(0x424081F8UL)))
#define bM4_SPI4_SR_OVRERF                        (*((volatile unsigned int*)(0x42408280UL)))
#define bM4_SPI4_SR_IDLNF                         (*((volatile unsigned int*)(0x42408284UL)))
#define bM4_SPI4_SR_MODFERF                       (*((volatile unsigned int*)(0x42408288UL)))
#define bM4_SPI4_SR_PERF                          (*((volatile unsigned int*)(0x4240828CUL)))
#define bM4_SPI4_SR_UDRERF                        (*((volatile unsigned int*)(0x42408290UL)))
#define bM4_SPI4_SR_TDEF                          (*((volatile unsigned int*)(0x42408294UL)))
#define bM4_SPI4_SR_RDFF                          (*((volatile unsigned int*)(0x4240829CUL)))
#define bM4_SPI4_CFG2_CPHA                        (*((volatile unsigned int*)(0x42408300UL)))
#define bM4_SPI4_CFG2_CPOL                        (*((volatile unsigned int*)(0x42408304UL)))
#define bM4_SPI4_CFG2_MBR0                        (*((volatile unsigned int*)(0x42408308UL)))
#define bM4_SPI4_CFG2_MBR1                        (*((volatile unsigned int*)(0x4240830CUL)))
#define bM4_SPI4_CFG2_MBR2                        (*((volatile unsigned int*)(0x42408310UL)))
#define bM4_SPI4_CFG2_SSA0                        (*((volatile unsigned int*)(0x42408314UL)))
#define bM4_SPI4_CFG2_SSA1                        (*((volatile unsigned int*)(0x42408318UL)))
#define bM4_SPI4_CFG2_SSA2                        (*((volatile unsigned int*)(0x4240831CUL)))
#define bM4_SPI4_CFG2_DSIZE0                      (*((volatile unsigned int*)(0x42408320UL)))
#define bM4_SPI4_CFG2_DSIZE1                      (*((volatile unsigned int*)(0x42408324UL)))
#define bM4_SPI4_CFG2_DSIZE2                      (*((volatile unsigned int*)(0x42408328UL)))
#define bM4_SPI4_CFG2_DSIZE3                      (*((volatile unsigned int*)(0x4240832CUL)))
#define bM4_SPI4_CFG2_LSBF                        (*((volatile unsigned int*)(0x42408330UL)))
#define bM4_SPI4_CFG2_MIDIE                       (*((volatile unsigned int*)(0x42408334UL)))
#define bM4_SPI4_CFG2_MSSDLE                      (*((volatile unsigned int*)(0x42408338UL)))
#define bM4_SPI4_CFG2_MSSIE                       (*((volatile unsigned int*)(0x4240833CUL)))
#define bM4_SRAMC_WTCR_SRAM12_RWT0                (*((volatile unsigned int*)(0x42A10000UL)))
#define bM4_SRAMC_WTCR_SRAM12_RWT1                (*((volatile unsigned int*)(0x42A10004UL)))
#define bM4_SRAMC_WTCR_SRAM12_RWT2                (*((volatile unsigned int*)(0x42A10008UL)))
#define bM4_SRAMC_WTCR_SRAM12_WWT0                (*((volatile unsigned int*)(0x42A10010UL)))
#define bM4_SRAMC_WTCR_SRAM12_WWT1                (*((volatile unsigned int*)(0x42A10014UL)))
#define bM4_SRAMC_WTCR_SRAM12_WWT2                (*((volatile unsigned int*)(0x42A10018UL)))
#define bM4_SRAMC_WTCR_SRAM3_RWT0                 (*((volatile unsigned int*)(0x42A10020UL)))
#define bM4_SRAMC_WTCR_SRAM3_RWT1                 (*((volatile unsigned int*)(0x42A10024UL)))
#define bM4_SRAMC_WTCR_SRAM3_RWT2                 (*((volatile unsigned int*)(0x42A10028UL)))
#define bM4_SRAMC_WTCR_SRAM3_WWT0                 (*((volatile unsigned int*)(0x42A10030UL)))
#define bM4_SRAMC_WTCR_SRAM3_WWT1                 (*((volatile unsigned int*)(0x42A10034UL)))
#define bM4_SRAMC_WTCR_SRAM3_WWT2                 (*((volatile unsigned int*)(0x42A10038UL)))
#define bM4_SRAMC_WTCR_SRAMH_RWT0                 (*((volatile unsigned int*)(0x42A10040UL)))
#define bM4_SRAMC_WTCR_SRAMH_RWT1                 (*((volatile unsigned int*)(0x42A10044UL)))
#define bM4_SRAMC_WTCR_SRAMH_RWT2                 (*((volatile unsigned int*)(0x42A10048UL)))
#define bM4_SRAMC_WTCR_SRAMH_WWT0                 (*((volatile unsigned int*)(0x42A10050UL)))
#define bM4_SRAMC_WTCR_SRAMH_WWT1                 (*((volatile unsigned int*)(0x42A10054UL)))
#define bM4_SRAMC_WTCR_SRAMH_WWT2                 (*((volatile unsigned int*)(0x42A10058UL)))
#define bM4_SRAMC_WTCR_SRAMR_RWT0                 (*((volatile unsigned int*)(0x42A10060UL)))
