SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460jeta_template/common/hc32f460jeta.h
#define bM4_TMR62_GCMAR_GCMA6                     (*((volatile unsigned int*)(0x42308218UL)))
#define bM4_TMR62_GCMAR_GCMA7                     (*((volatile unsigned int*)(0x4230821CUL)))
#define bM4_TMR62_GCMAR_GCMA8                     (*((volatile unsigned int*)(0x42308220UL)))
#define bM4_TMR62_GCMAR_GCMA9                     (*((volatile unsigned int*)(0x42308224UL)))
#define bM4_TMR62_GCMAR_GCMA10                    (*((volatile unsigned int*)(0x42308228UL)))
#define bM4_TMR62_GCMAR_GCMA11                    (*((volatile unsigned int*)(0x4230822CUL)))
#define bM4_TMR62_GCMAR_GCMA12                    (*((volatile unsigned int*)(0x42308230UL)))
#define bM4_TMR62_GCMAR_GCMA13                    (*((volatile unsigned int*)(0x42308234UL)))
#define bM4_TMR62_GCMAR_GCMA14                    (*((volatile unsigned int*)(0x42308238UL)))
#define bM4_TMR62_GCMAR_GCMA15                    (*((volatile unsigned int*)(0x4230823CUL)))
#define bM4_TMR62_GCMBR_GCMB0                     (*((volatile unsigned int*)(0x42308280UL)))
#define bM4_TMR62_GCMBR_GCMB1                     (*((volatile unsigned int*)(0x42308284UL)))
#define bM4_TMR62_GCMBR_GCMB2                     (*((volatile unsigned int*)(0x42308288UL)))
#define bM4_TMR62_GCMBR_GCMB3                     (*((volatile unsigned int*)(0x4230828CUL)))
#define bM4_TMR62_GCMBR_GCMB4                     (*((volatile unsigned int*)(0x42308290UL)))
#define bM4_TMR62_GCMBR_GCMB5                     (*((volatile unsigned int*)(0x42308294UL)))
#define bM4_TMR62_GCMBR_GCMB6                     (*((volatile unsigned int*)(0x42308298UL)))
#define bM4_TMR62_GCMBR_GCMB7                     (*((volatile unsigned int*)(0x4230829CUL)))
#define bM4_TMR62_GCMBR_GCMB8                     (*((volatile unsigned int*)(0x423082A0UL)))
#define bM4_TMR62_GCMBR_GCMB9                     (*((volatile unsigned int*)(0x423082A4UL)))
#define bM4_TMR62_GCMBR_GCMB10                    (*((volatile unsigned int*)(0x423082A8UL)))
#define bM4_TMR62_GCMBR_GCMB11                    (*((volatile unsigned int*)(0x423082ACUL)))
#define bM4_TMR62_GCMBR_GCMB12                    (*((volatile unsigned int*)(0x423082B0UL)))
#define bM4_TMR62_GCMBR_GCMB13                    (*((volatile unsigned int*)(0x423082B4UL)))
#define bM4_TMR62_GCMBR_GCMB14                    (*((volatile unsigned int*)(0x423082B8UL)))
#define bM4_TMR62_GCMBR_GCMB15                    (*((volatile unsigned int*)(0x423082BCUL)))
#define bM4_TMR62_GCMCR_GCMC0                     (*((volatile unsigned int*)(0x42308300UL)))
#define bM4_TMR62_GCMCR_GCMC1                     (*((volatile unsigned int*)(0x42308304UL)))
#define bM4_TMR62_GCMCR_GCMC2                     (*((volatile unsigned int*)(0x42308308UL)))
#define bM4_TMR62_GCMCR_GCMC3                     (*((volatile unsigned int*)(0x4230830CUL)))
#define bM4_TMR62_GCMCR_GCMC4                     (*((volatile unsigned int*)(0x42308310UL)))
#define bM4_TMR62_GCMCR_GCMC5                     (*((volatile unsigned int*)(0x42308314UL)))
#define bM4_TMR62_GCMCR_GCMC6                     (*((volatile unsigned int*)(0x42308318UL)))
#define bM4_TMR62_GCMCR_GCMC7                     (*((volatile unsigned int*)(0x4230831CUL)))
#define bM4_TMR62_GCMCR_GCMC8                     (*((volatile unsigned int*)(0x42308320UL)))
#define bM4_TMR62_GCMCR_GCMC9                     (*((volatile unsigned int*)(0x42308324UL)))
#define bM4_TMR62_GCMCR_GCMC10                    (*((volatile unsigned int*)(0x42308328UL)))
#define bM4_TMR62_GCMCR_GCMC11                    (*((volatile unsigned int*)(0x4230832CUL)))
#define bM4_TMR62_GCMCR_GCMC12                    (*((volatile unsigned int*)(0x42308330UL)))
#define bM4_TMR62_GCMCR_GCMC13                    (*((volatile unsigned int*)(0x42308334UL)))
#define bM4_TMR62_GCMCR_GCMC14                    (*((volatile unsigned int*)(0x42308338UL)))
#define bM4_TMR62_GCMCR_GCMC15                    (*((volatile unsigned int*)(0x4230833CUL)))
#define bM4_TMR62_GCMDR_GCMD0                     (*((volatile unsigned int*)(0x42308380UL)))
#define bM4_TMR62_GCMDR_GCMD1                     (*((volatile unsigned int*)(0x42308384UL)))
#define bM4_TMR62_GCMDR_GCMD2                     (*((volatile unsigned int*)(0x42308388UL)))
#define bM4_TMR62_GCMDR_GCMD3                     (*((volatile unsigned int*)(0x4230838CUL)))
#define bM4_TMR62_GCMDR_GCMD4                     (*((volatile unsigned int*)(0x42308390UL)))
#define bM4_TMR62_GCMDR_GCMD5                     (*((volatile unsigned int*)(0x42308394UL)))
#define bM4_TMR62_GCMDR_GCMD6                     (*((volatile unsigned int*)(0x42308398UL)))
#define bM4_TMR62_GCMDR_GCMD7                     (*((volatile unsigned int*)(0x4230839CUL)))
#define bM4_TMR62_GCMDR_GCMD8                     (*((volatile unsigned int*)(0x423083A0UL)))
#define bM4_TMR62_GCMDR_GCMD9                     (*((volatile unsigned int*)(0x423083A4UL)))
#define bM4_TMR62_GCMDR_GCMD10                    (*((volatile unsigned int*)(0x423083A8UL)))
#define bM4_TMR62_GCMDR_GCMD11                    (*((volatile unsigned int*)(0x423083ACUL)))
#define bM4_TMR62_GCMDR_GCMD12                    (*((volatile unsigned int*)(0x423083B0UL)))
#define bM4_TMR62_GCMDR_GCMD13                    (*((volatile unsigned int*)(0x423083B4UL)))
#define bM4_TMR62_GCMDR_GCMD14                    (*((volatile unsigned int*)(0x423083B8UL)))
#define bM4_TMR62_GCMDR_GCMD15                    (*((volatile unsigned int*)(0x423083BCUL)))
#define bM4_TMR62_GCMER_GCME0                     (*((volatile unsigned int*)(0x42308400UL)))
#define bM4_TMR62_GCMER_GCME1                     (*((volatile unsigned int*)(0x42308404UL)))
#define bM4_TMR62_GCMER_GCME2                     (*((volatile unsigned int*)(0x42308408UL)))
#define bM4_TMR62_GCMER_GCME3                     (*((volatile unsigned int*)(0x4230840CUL)))
#define bM4_TMR62_GCMER_GCME4                     (*((volatile unsigned int*)(0x42308410UL)))
#define bM4_TMR62_GCMER_GCME5                     (*((volatile unsigned int*)(0x42308414UL)))
#define bM4_TMR62_GCMER_GCME6                     (*((volatile unsigned int*)(0x42308418UL)))
#define bM4_TMR62_GCMER_GCME7                     (*((volatile unsigned int*)(0x4230841CUL)))
#define bM4_TMR62_GCMER_GCME8                     (*((volatile unsigned int*)(0x42308420UL)))
#define bM4_TMR62_GCMER_GCME9                     (*((volatile unsigned int*)(0x42308424UL)))
#define bM4_TMR62_GCMER_GCME10                    (*((volatile unsigned int*)(0x42308428UL)))
#define bM4_TMR62_GCMER_GCME11                    (*((volatile unsigned int*)(0x4230842CUL)))
#define bM4_TMR62_GCMER_GCME12                    (*((volatile unsigned int*)(0x42308430UL)))
#define bM4_TMR62_GCMER_GCME13                    (*((volatile unsigned int*)(0x42308434UL)))
#define bM4_TMR62_GCMER_GCME14                    (*((volatile unsigned int*)(0x42308438UL)))
#define bM4_TMR62_GCMER_GCME15                    (*((volatile unsigned int*)(0x4230843CUL)))
#define bM4_TMR62_GCMFR_GCMF0                     (*((volatile unsigned int*)(0x42308480UL)))
#define bM4_TMR62_GCMFR_GCMF1                     (*((volatile unsigned int*)(0x42308484UL)))
#define bM4_TMR62_GCMFR_GCMF2                     (*((volatile unsigned int*)(0x42308488UL)))
#define bM4_TMR62_GCMFR_GCMF3                     (*((volatile unsigned int*)(0x4230848CUL)))
#define bM4_TMR62_GCMFR_GCMF4                     (*((volatile unsigned int*)(0x42308490UL)))
#define bM4_TMR62_GCMFR_GCMF5                     (*((volatile unsigned int*)(0x42308494UL)))
#define bM4_TMR62_GCMFR_GCMF6                     (*((volatile unsigned int*)(0x42308498UL)))
#define bM4_TMR62_GCMFR_GCMF7                     (*((volatile unsigned int*)(0x4230849CUL)))
#define bM4_TMR62_GCMFR_GCMF8                     (*((volatile unsigned int*)(0x423084A0UL)))
#define bM4_TMR62_GCMFR_GCMF9                     (*((volatile unsigned int*)(0x423084A4UL)))
#define bM4_TMR62_GCMFR_GCMF10                    (*((volatile unsigned int*)(0x423084A8UL)))
#define bM4_TMR62_GCMFR_GCMF11                    (*((volatile unsigned int*)(0x423084ACUL)))
#define bM4_TMR62_GCMFR_GCMF12                    (*((volatile unsigned int*)(0x423084B0UL)))
#define bM4_TMR62_GCMFR_GCMF13                    (*((volatile unsigned int*)(0x423084B4UL)))
#define bM4_TMR62_GCMFR_GCMF14                    (*((volatile unsigned int*)(0x423084B8UL)))
#define bM4_TMR62_GCMFR_GCMF15                    (*((volatile unsigned int*)(0x423084BCUL)))
#define bM4_TMR62_SCMAR_SCMA0                     (*((volatile unsigned int*)(0x42308500UL)))
#define bM4_TMR62_SCMAR_SCMA1                     (*((volatile unsigned int*)(0x42308504UL)))
#define bM4_TMR62_SCMAR_SCMA2                     (*((volatile unsigned int*)(0x42308508UL)))
#define bM4_TMR62_SCMAR_SCMA3                     (*((volatile unsigned int*)(0x4230850CUL)))
#define bM4_TMR62_SCMAR_SCMA4                     (*((volatile unsigned int*)(0x42308510UL)))
#define bM4_TMR62_SCMAR_SCMA5                     (*((volatile unsigned int*)(0x42308514UL)))
#define bM4_TMR62_SCMAR_SCMA6                     (*((volatile unsigned int*)(0x42308518UL)))
#define bM4_TMR62_SCMAR_SCMA7                     (*((volatile unsigned int*)(0x4230851CUL)))
#define bM4_TMR62_SCMAR_SCMA8                     (*((volatile unsigned int*)(0x42308520UL)))
#define bM4_TMR62_SCMAR_SCMA9                     (*((volatile unsigned int*)(0x42308524UL)))
#define bM4_TMR62_SCMAR_SCMA10                    (*((volatile unsigned int*)(0x42308528UL)))
#define bM4_TMR62_SCMAR_SCMA11                    (*((volatile unsigned int*)(0x4230852CUL)))
#define bM4_TMR62_SCMAR_SCMA12                    (*((volatile unsigned int*)(0x42308530UL)))
#define bM4_TMR62_SCMAR_SCMA13                    (*((volatile unsigned int*)(0x42308534UL)))
#define bM4_TMR62_SCMAR_SCMA14                    (*((volatile unsigned int*)(0x42308538UL)))
#define bM4_TMR62_SCMAR_SCMA15                    (*((volatile unsigned int*)(0x4230853CUL)))
#define bM4_TMR62_SCMBR_SCMB0                     (*((volatile unsigned int*)(0x42308580UL)))
#define bM4_TMR62_SCMBR_SCMB1                     (*((volatile unsigned int*)(0x42308584UL)))
#define bM4_TMR62_SCMBR_SCMB2                     (*((volatile unsigned int*)(0x42308588UL)))
#define bM4_TMR62_SCMBR_SCMB3                     (*((volatile unsigned int*)(0x4230858CUL)))
#define bM4_TMR62_SCMBR_SCMB4                     (*((volatile unsigned int*)(0x42308590UL)))
#define bM4_TMR62_SCMBR_SCMB5                     (*((volatile unsigned int*)(0x42308594UL)))
#define bM4_TMR62_SCMBR_SCMB6                     (*((volatile unsigned int*)(0x42308598UL)))
#define bM4_TMR62_SCMBR_SCMB7                     (*((volatile unsigned int*)(0x4230859CUL)))
#define bM4_TMR62_SCMBR_SCMB8                     (*((volatile unsigned int*)(0x423085A0UL)))
#define bM4_TMR62_SCMBR_SCMB9                     (*((volatile unsigned int*)(0x423085A4UL)))
#define bM4_TMR62_SCMBR_SCMB10                    (*((volatile unsigned int*)(0x423085A8UL)))
#define bM4_TMR62_SCMBR_SCMB11                    (*((volatile unsigned int*)(0x423085ACUL)))
#define bM4_TMR62_SCMBR_SCMB12                    (*((volatile unsigned int*)(0x423085B0UL)))
#define bM4_TMR62_SCMBR_SCMB13                    (*((volatile unsigned int*)(0x423085B4UL)))
#define bM4_TMR62_SCMBR_SCMB14                    (*((volatile unsigned int*)(0x423085B8UL)))
#define bM4_TMR62_SCMBR_SCMB15                    (*((volatile unsigned int*)(0x423085BCUL)))
#define bM4_TMR62_SCMCR_SCMC0                     (*((volatile unsigned int*)(0x42308600UL)))
#define bM4_TMR62_SCMCR_SCMC1                     (*((volatile unsigned int*)(0x42308604UL)))
#define bM4_TMR62_SCMCR_SCMC2                     (*((volatile unsigned int*)(0x42308608UL)))
#define bM4_TMR62_SCMCR_SCMC3                     (*((volatile unsigned int*)(0x4230860CUL)))
#define bM4_TMR62_SCMCR_SCMC4                     (*((volatile unsigned int*)(0x42308610UL)))
#define bM4_TMR62_SCMCR_SCMC5                     (*((volatile unsigned int*)(0x42308614UL)))
#define bM4_TMR62_SCMCR_SCMC6                     (*((volatile unsigned int*)(0x42308618UL)))
#define bM4_TMR62_SCMCR_SCMC7                     (*((volatile unsigned int*)(0x4230861CUL)))
#define bM4_TMR62_SCMCR_SCMC8                     (*((volatile unsigned int*)(0x42308620UL)))
#define bM4_TMR62_SCMCR_SCMC9                     (*((volatile unsigned int*)(0x42308624UL)))
#define bM4_TMR62_SCMCR_SCMC10                    (*((volatile unsigned int*)(0x42308628UL)))
#define bM4_TMR62_SCMCR_SCMC11                    (*((volatile unsigned int*)(0x4230862CUL)))
#define bM4_TMR62_SCMCR_SCMC12                    (*((volatile unsigned int*)(0x42308630UL)))
#define bM4_TMR62_SCMCR_SCMC13                    (*((volatile unsigned int*)(0x42308634UL)))
#define bM4_TMR62_SCMCR_SCMC14                    (*((volatile unsigned int*)(0x42308638UL)))
#define bM4_TMR62_SCMCR_SCMC15                    (*((volatile unsigned int*)(0x4230863CUL)))
#define bM4_TMR62_SCMDR_SCMD0                     (*((volatile unsigned int*)(0x42308680UL)))
#define bM4_TMR62_SCMDR_SCMD1                     (*((volatile unsigned int*)(0x42308684UL)))
#define bM4_TMR62_SCMDR_SCMD2                     (*((volatile unsigned int*)(0x42308688UL)))
#define bM4_TMR62_SCMDR_SCMD3                     (*((volatile unsigned int*)(0x4230868CUL)))
#define bM4_TMR62_SCMDR_SCMD4                     (*((volatile unsigned int*)(0x42308690UL)))
#define bM4_TMR62_SCMDR_SCMD5                     (*((volatile unsigned int*)(0x42308694UL)))
#define bM4_TMR62_SCMDR_SCMD6                     (*((volatile unsigned int*)(0x42308698UL)))
#define bM4_TMR62_SCMDR_SCMD7                     (*((volatile unsigned int*)(0x4230869CUL)))
#define bM4_TMR62_SCMDR_SCMD8                     (*((volatile unsigned int*)(0x423086A0UL)))
#define bM4_TMR62_SCMDR_SCMD9                     (*((volatile unsigned int*)(0x423086A4UL)))
#define bM4_TMR62_SCMDR_SCMD10                    (*((volatile unsigned int*)(0x423086A8UL)))
#define bM4_TMR62_SCMDR_SCMD11                    (*((volatile unsigned int*)(0x423086ACUL)))
#define bM4_TMR62_SCMDR_SCMD12                    (*((volatile unsigned int*)(0x423086B0UL)))
#define bM4_TMR62_SCMDR_SCMD13                    (*((volatile unsigned int*)(0x423086B4UL)))
#define bM4_TMR62_SCMDR_SCMD14                    (*((volatile unsigned int*)(0x423086B8UL)))
#define bM4_TMR62_SCMDR_SCMD15                    (*((volatile unsigned int*)(0x423086BCUL)))
#define bM4_TMR62_SCMER_SCME0                     (*((volatile unsigned int*)(0x42308700UL)))
#define bM4_TMR62_SCMER_SCME1                     (*((volatile unsigned int*)(0x42308704UL)))
#define bM4_TMR62_SCMER_SCME2                     (*((volatile unsigned int*)(0x42308708UL)))
#define bM4_TMR62_SCMER_SCME3                     (*((volatile unsigned int*)(0x4230870CUL)))
#define bM4_TMR62_SCMER_SCME4                     (*((volatile unsigned int*)(0x42308710UL)))
#define bM4_TMR62_SCMER_SCME5                     (*((volatile unsigned int*)(0x42308714UL)))
#define bM4_TMR62_SCMER_SCME6                     (*((volatile unsigned int*)(0x42308718UL)))
#define bM4_TMR62_SCMER_SCME7                     (*((volatile unsigned int*)(0x4230871CUL)))
#define bM4_TMR62_SCMER_SCME8                     (*((volatile unsigned int*)(0x42308720UL)))
#define bM4_TMR62_SCMER_SCME9                     (*((volatile unsigned int*)(0x42308724UL)))
#define bM4_TMR62_SCMER_SCME10                    (*((volatile unsigned int*)(0x42308728UL)))
#define bM4_TMR62_SCMER_SCME11                    (*((volatile unsigned int*)(0x4230872CUL)))
#define bM4_TMR62_SCMER_SCME12                    (*((volatile unsigned int*)(0x42308730UL)))
#define bM4_TMR62_SCMER_SCME13                    (*((volatile unsigned int*)(0x42308734UL)))
#define bM4_TMR62_SCMER_SCME14                    (*((volatile unsigned int*)(0x42308738UL)))
#define bM4_TMR62_SCMER_SCME15                    (*((volatile unsigned int*)(0x4230873CUL)))
#define bM4_TMR62_SCMFR_SCMF0                     (*((volatile unsigned int*)(0x42308780UL)))
#define bM4_TMR62_SCMFR_SCMF1                     (*((volatile unsigned int*)(0x42308784UL)))
#define bM4_TMR62_SCMFR_SCMF2                     (*((volatile unsigned int*)(0x42308788UL)))
#define bM4_TMR62_SCMFR_SCMF3                     (*((volatile unsigned int*)(0x4230878CUL)))
#define bM4_TMR62_SCMFR_SCMF4                     (*((volatile unsigned int*)(0x42308790UL)))
#define bM4_TMR62_SCMFR_SCMF5                     (*((volatile unsigned int*)(0x42308794UL)))
#define bM4_TMR62_SCMFR_SCMF6                     (*((volatile unsigned int*)(0x42308798UL)))
#define bM4_TMR62_SCMFR_SCMF7                     (*((volatile unsigned int*)(0x4230879CUL)))
#define bM4_TMR62_SCMFR_SCMF8                     (*((volatile unsigned int*)(0x423087A0UL)))
#define bM4_TMR62_SCMFR_SCMF9                     (*((volatile unsigned int*)(0x423087A4UL)))
#define bM4_TMR62_SCMFR_SCMF10                    (*((volatile unsigned int*)(0x423087A8UL)))
#define bM4_TMR62_SCMFR_SCMF11                    (*((volatile unsigned int*)(0x423087ACUL)))
#define bM4_TMR62_SCMFR_SCMF12                    (*((volatile unsigned int*)(0x423087B0UL)))
#define bM4_TMR62_SCMFR_SCMF13                    (*((volatile unsigned int*)(0x423087B4UL)))
#define bM4_TMR62_SCMFR_SCMF14                    (*((volatile unsigned int*)(0x423087B8UL)))
#define bM4_TMR62_SCMFR_SCMF15                    (*((volatile unsigned int*)(0x423087BCUL)))
#define bM4_TMR62_DTUAR_DTUA0                     (*((volatile unsigned int*)(0x42308800UL)))
#define bM4_TMR62_DTUAR_DTUA1                     (*((volatile unsigned int*)(0x42308804UL)))
#define bM4_TMR62_DTUAR_DTUA2                     (*((volatile unsigned int*)(0x42308808UL)))
#define bM4_TMR62_DTUAR_DTUA3                     (*((volatile unsigned int*)(0x4230880CUL)))
#define bM4_TMR62_DTUAR_DTUA4                     (*((volatile unsigned int*)(0x42308810UL)))
#define bM4_TMR62_DTUAR_DTUA5                     (*((volatile unsigned int*)(0x42308814UL)))
#define bM4_TMR62_DTUAR_DTUA6                     (*((volatile unsigned int*)(0x42308818UL)))
#define bM4_TMR62_DTUAR_DTUA7                     (*((volatile unsigned int*)(0x4230881CUL)))
#define bM4_TMR62_DTUAR_DTUA8                     (*((volatile unsigned int*)(0x42308820UL)))
#define bM4_TMR62_DTUAR_DTUA9                     (*((volatile unsigned int*)(0x42308824UL)))
#define bM4_TMR62_DTUAR_DTUA10                    (*((volatile unsigned int*)(0x42308828UL)))
#define bM4_TMR62_DTUAR_DTUA11                    (*((volatile unsigned int*)(0x4230882CUL)))
#define bM4_TMR62_DTUAR_DTUA12                    (*((volatile unsigned int*)(0x42308830UL)))
#define bM4_TMR62_DTUAR_DTUA13                    (*((volatile unsigned int*)(0x42308834UL)))
#define bM4_TMR62_DTUAR_DTUA14                    (*((volatile unsigned int*)(0x42308838UL)))
#define bM4_TMR62_DTUAR_DTUA15                    (*((volatile unsigned int*)(0x4230883CUL)))
#define bM4_TMR62_DTDAR_DTDA0                     (*((volatile unsigned int*)(0x42308880UL)))
#define bM4_TMR62_DTDAR_DTDA1                     (*((volatile unsigned int*)(0x42308884UL)))
#define bM4_TMR62_DTDAR_DTDA2                     (*((volatile unsigned int*)(0x42308888UL)))
#define bM4_TMR62_DTDAR_DTDA3                     (*((volatile unsigned int*)(0x4230888CUL)))
#define bM4_TMR62_DTDAR_DTDA4                     (*((volatile unsigned int*)(0x42308890UL)))
#define bM4_TMR62_DTDAR_DTDA5                     (*((volatile unsigned int*)(0x42308894UL)))
#define bM4_TMR62_DTDAR_DTDA6                     (*((volatile unsigned int*)(0x42308898UL)))
#define bM4_TMR62_DTDAR_DTDA7                     (*((volatile unsigned int*)(0x4230889CUL)))
#define bM4_TMR62_DTDAR_DTDA8                     (*((volatile unsigned int*)(0x423088A0UL)))
#define bM4_TMR62_DTDAR_DTDA9                     (*((volatile unsigned int*)(0x423088A4UL)))
#define bM4_TMR62_DTDAR_DTDA10                    (*((volatile unsigned int*)(0x423088A8UL)))
#define bM4_TMR62_DTDAR_DTDA11                    (*((volatile unsigned int*)(0x423088ACUL)))
#define bM4_TMR62_DTDAR_DTDA12                    (*((volatile unsigned int*)(0x423088B0UL)))
#define bM4_TMR62_DTDAR_DTDA13                    (*((volatile unsigned int*)(0x423088B4UL)))
#define bM4_TMR62_DTDAR_DTDA14                    (*((volatile unsigned int*)(0x423088B8UL)))
#define bM4_TMR62_DTDAR_DTDA15                    (*((volatile unsigned int*)(0x423088BCUL)))
#define bM4_TMR62_DTUBR_DTUB0                     (*((volatile unsigned int*)(0x42308900UL)))
#define bM4_TMR62_DTUBR_DTUB1                     (*((volatile unsigned int*)(0x42308904UL)))
#define bM4_TMR62_DTUBR_DTUB2                     (*((volatile unsigned int*)(0x42308908UL)))
#define bM4_TMR62_DTUBR_DTUB3                     (*((volatile unsigned int*)(0x4230890CUL)))
#define bM4_TMR62_DTUBR_DTUB4                     (*((volatile unsigned int*)(0x42308910UL)))
#define bM4_TMR62_DTUBR_DTUB5                     (*((volatile unsigned int*)(0x42308914UL)))
#define bM4_TMR62_DTUBR_DTUB6                     (*((volatile unsigned int*)(0x42308918UL)))
#define bM4_TMR62_DTUBR_DTUB7                     (*((volatile unsigned int*)(0x4230891CUL)))
#define bM4_TMR62_DTUBR_DTUB8                     (*((volatile unsigned int*)(0x42308920UL)))
#define bM4_TMR62_DTUBR_DTUB9                     (*((volatile unsigned int*)(0x42308924UL)))
#define bM4_TMR62_DTUBR_DTUB10                    (*((volatile unsigned int*)(0x42308928UL)))
#define bM4_TMR62_DTUBR_DTUB11                    (*((volatile unsigned int*)(0x4230892CUL)))
#define bM4_TMR62_DTUBR_DTUB12                    (*((volatile unsigned int*)(0x42308930UL)))
#define bM4_TMR62_DTUBR_DTUB13                    (*((volatile unsigned int*)(0x42308934UL)))
#define bM4_TMR62_DTUBR_DTUB14                    (*((volatile unsigned int*)(0x42308938UL)))
#define bM4_TMR62_DTUBR_DTUB15                    (*((volatile unsigned int*)(0x4230893CUL)))
#define bM4_TMR62_DTDBR_DTDB0                     (*((volatile unsigned int*)(0x42308980UL)))
#define bM4_TMR62_DTDBR_DTDB1                     (*((volatile unsigned int*)(0x42308984UL)))
#define bM4_TMR62_DTDBR_DTDB2                     (*((volatile unsigned int*)(0x42308988UL)))
#define bM4_TMR62_DTDBR_DTDB3                     (*((volatile unsigned int*)(0x4230898CUL)))
#define bM4_TMR62_DTDBR_DTDB4                     (*((volatile unsigned int*)(0x42308990UL)))
#define bM4_TMR62_DTDBR_DTDB5                     (*((volatile unsigned int*)(0x42308994UL)))
#define bM4_TMR62_DTDBR_DTDB6                     (*((volatile unsigned int*)(0x42308998UL)))
#define bM4_TMR62_DTDBR_DTDB7                     (*((volatile unsigned int*)(0x4230899CUL)))
#define bM4_TMR62_DTDBR_DTDB8                     (*((volatile unsigned int*)(0x423089A0UL)))
#define bM4_TMR62_DTDBR_DTDB9                     (*((volatile unsigned int*)(0x423089A4UL)))
#define bM4_TMR62_DTDBR_DTDB10                    (*((volatile unsigned int*)(0x423089A8UL)))
#define bM4_TMR62_DTDBR_DTDB11                    (*((volatile unsigned int*)(0x423089ACUL)))
#define bM4_TMR62_DTDBR_DTDB12                    (*((volatile unsigned int*)(0x423089B0UL)))
#define bM4_TMR62_DTDBR_DTDB13                    (*((volatile unsigned int*)(0x423089B4UL)))
#define bM4_TMR62_DTDBR_DTDB14                    (*((volatile unsigned int*)(0x423089B8UL)))
#define bM4_TMR62_DTDBR_DTDB15                    (*((volatile unsigned int*)(0x423089BCUL)))
#define bM4_TMR62_GCONR_START                     (*((volatile unsigned int*)(0x42308A00UL)))
#define bM4_TMR62_GCONR_MODE0                     (*((volatile unsigned int*)(0x42308A04UL)))
#define bM4_TMR62_GCONR_MODE1                     (*((volatile unsigned int*)(0x42308A08UL)))
#define bM4_TMR62_GCONR_MODE2                     (*((volatile unsigned int*)(0x42308A0CUL)))
#define bM4_TMR62_GCONR_CKDIV0                    (*((volatile unsigned int*)(0x42308A10UL)))
