SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460jeta_template/common/hc32f460jeta.h
#define bM4_TMRA3_CNTER_CNT8                      (*((volatile unsigned int*)(0x422B0020UL)))
#define bM4_TMRA3_CNTER_CNT9                      (*((volatile unsigned int*)(0x422B0024UL)))
#define bM4_TMRA3_CNTER_CNT10                     (*((volatile unsigned int*)(0x422B0028UL)))
#define bM4_TMRA3_CNTER_CNT11                     (*((volatile unsigned int*)(0x422B002CUL)))
#define bM4_TMRA3_CNTER_CNT12                     (*((volatile unsigned int*)(0x422B0030UL)))
#define bM4_TMRA3_CNTER_CNT13                     (*((volatile unsigned int*)(0x422B0034UL)))
#define bM4_TMRA3_CNTER_CNT14                     (*((volatile unsigned int*)(0x422B0038UL)))
#define bM4_TMRA3_CNTER_CNT15                     (*((volatile unsigned int*)(0x422B003CUL)))
#define bM4_TMRA3_PERAR_PER0                      (*((volatile unsigned int*)(0x422B0080UL)))
#define bM4_TMRA3_PERAR_PER1                      (*((volatile unsigned int*)(0x422B0084UL)))
#define bM4_TMRA3_PERAR_PER2                      (*((volatile unsigned int*)(0x422B0088UL)))
#define bM4_TMRA3_PERAR_PER3                      (*((volatile unsigned int*)(0x422B008CUL)))
#define bM4_TMRA3_PERAR_PER4                      (*((volatile unsigned int*)(0x422B0090UL)))
#define bM4_TMRA3_PERAR_PER5                      (*((volatile unsigned int*)(0x422B0094UL)))
#define bM4_TMRA3_PERAR_PER6                      (*((volatile unsigned int*)(0x422B0098UL)))
#define bM4_TMRA3_PERAR_PER7                      (*((volatile unsigned int*)(0x422B009CUL)))
#define bM4_TMRA3_PERAR_PER8                      (*((volatile unsigned int*)(0x422B00A0UL)))
#define bM4_TMRA3_PERAR_PER9                      (*((volatile unsigned int*)(0x422B00A4UL)))
#define bM4_TMRA3_PERAR_PER10                     (*((volatile unsigned int*)(0x422B00A8UL)))
#define bM4_TMRA3_PERAR_PER11                     (*((volatile unsigned int*)(0x422B00ACUL)))
#define bM4_TMRA3_PERAR_PER12                     (*((volatile unsigned int*)(0x422B00B0UL)))
#define bM4_TMRA3_PERAR_PER13                     (*((volatile unsigned int*)(0x422B00B4UL)))
#define bM4_TMRA3_PERAR_PER14                     (*((volatile unsigned int*)(0x422B00B8UL)))
#define bM4_TMRA3_PERAR_PER15                     (*((volatile unsigned int*)(0x422B00BCUL)))
#define bM4_TMRA3_CMPAR1_CMP0                     (*((volatile unsigned int*)(0x422B0800UL)))
#define bM4_TMRA3_CMPAR1_CMP1                     (*((volatile unsigned int*)(0x422B0804UL)))
#define bM4_TMRA3_CMPAR1_CMP2                     (*((volatile unsigned int*)(0x422B0808UL)))
#define bM4_TMRA3_CMPAR1_CMP3                     (*((volatile unsigned int*)(0x422B080CUL)))
#define bM4_TMRA3_CMPAR1_CMP4                     (*((volatile unsigned int*)(0x422B0810UL)))
#define bM4_TMRA3_CMPAR1_CMP5                     (*((volatile unsigned int*)(0x422B0814UL)))
#define bM4_TMRA3_CMPAR1_CMP6                     (*((volatile unsigned int*)(0x422B0818UL)))
#define bM4_TMRA3_CMPAR1_CMP7                     (*((volatile unsigned int*)(0x422B081CUL)))
#define bM4_TMRA3_CMPAR1_CMP8                     (*((volatile unsigned int*)(0x422B0820UL)))
#define bM4_TMRA3_CMPAR1_CMP9                     (*((volatile unsigned int*)(0x422B0824UL)))
#define bM4_TMRA3_CMPAR1_CMP10                    (*((volatile unsigned int*)(0x422B0828UL)))
#define bM4_TMRA3_CMPAR1_CMP11                    (*((volatile unsigned int*)(0x422B082CUL)))
#define bM4_TMRA3_CMPAR1_CMP12                    (*((volatile unsigned int*)(0x422B0830UL)))
#define bM4_TMRA3_CMPAR1_CMP13                    (*((volatile unsigned int*)(0x422B0834UL)))
#define bM4_TMRA3_CMPAR1_CMP14                    (*((volatile unsigned int*)(0x422B0838UL)))
#define bM4_TMRA3_CMPAR1_CMP15                    (*((volatile unsigned int*)(0x422B083CUL)))
#define bM4_TMRA3_CMPAR2_CMP0                     (*((volatile unsigned int*)(0x422B0880UL)))
#define bM4_TMRA3_CMPAR2_CMP1                     (*((volatile unsigned int*)(0x422B0884UL)))
#define bM4_TMRA3_CMPAR2_CMP2                     (*((volatile unsigned int*)(0x422B0888UL)))
#define bM4_TMRA3_CMPAR2_CMP3                     (*((volatile unsigned int*)(0x422B088CUL)))
#define bM4_TMRA3_CMPAR2_CMP4                     (*((volatile unsigned int*)(0x422B0890UL)))
#define bM4_TMRA3_CMPAR2_CMP5                     (*((volatile unsigned int*)(0x422B0894UL)))
#define bM4_TMRA3_CMPAR2_CMP6                     (*((volatile unsigned int*)(0x422B0898UL)))
#define bM4_TMRA3_CMPAR2_CMP7                     (*((volatile unsigned int*)(0x422B089CUL)))
#define bM4_TMRA3_CMPAR2_CMP8                     (*((volatile unsigned int*)(0x422B08A0UL)))
#define bM4_TMRA3_CMPAR2_CMP9                     (*((volatile unsigned int*)(0x422B08A4UL)))
#define bM4_TMRA3_CMPAR2_CMP10                    (*((volatile unsigned int*)(0x422B08A8UL)))
#define bM4_TMRA3_CMPAR2_CMP11                    (*((volatile unsigned int*)(0x422B08ACUL)))
#define bM4_TMRA3_CMPAR2_CMP12                    (*((volatile unsigned int*)(0x422B08B0UL)))
#define bM4_TMRA3_CMPAR2_CMP13                    (*((volatile unsigned int*)(0x422B08B4UL)))
#define bM4_TMRA3_CMPAR2_CMP14                    (*((volatile unsigned int*)(0x422B08B8UL)))
#define bM4_TMRA3_CMPAR2_CMP15                    (*((volatile unsigned int*)(0x422B08BCUL)))
#define bM4_TMRA3_CMPAR3_CMP0                     (*((volatile unsigned int*)(0x422B0900UL)))
#define bM4_TMRA3_CMPAR3_CMP1                     (*((volatile unsigned int*)(0x422B0904UL)))
#define bM4_TMRA3_CMPAR3_CMP2                     (*((volatile unsigned int*)(0x422B0908UL)))
#define bM4_TMRA3_CMPAR3_CMP3                     (*((volatile unsigned int*)(0x422B090CUL)))
#define bM4_TMRA3_CMPAR3_CMP4                     (*((volatile unsigned int*)(0x422B0910UL)))
#define bM4_TMRA3_CMPAR3_CMP5                     (*((volatile unsigned int*)(0x422B0914UL)))
#define bM4_TMRA3_CMPAR3_CMP6                     (*((volatile unsigned int*)(0x422B0918UL)))
#define bM4_TMRA3_CMPAR3_CMP7                     (*((volatile unsigned int*)(0x422B091CUL)))
#define bM4_TMRA3_CMPAR3_CMP8                     (*((volatile unsigned int*)(0x422B0920UL)))
#define bM4_TMRA3_CMPAR3_CMP9                     (*((volatile unsigned int*)(0x422B0924UL)))
#define bM4_TMRA3_CMPAR3_CMP10                    (*((volatile unsigned int*)(0x422B0928UL)))
#define bM4_TMRA3_CMPAR3_CMP11                    (*((volatile unsigned int*)(0x422B092CUL)))
#define bM4_TMRA3_CMPAR3_CMP12                    (*((volatile unsigned int*)(0x422B0930UL)))
#define bM4_TMRA3_CMPAR3_CMP13                    (*((volatile unsigned int*)(0x422B0934UL)))
#define bM4_TMRA3_CMPAR3_CMP14                    (*((volatile unsigned int*)(0x422B0938UL)))
#define bM4_TMRA3_CMPAR3_CMP15                    (*((volatile unsigned int*)(0x422B093CUL)))
#define bM4_TMRA3_CMPAR4_CMP0                     (*((volatile unsigned int*)(0x422B0980UL)))
#define bM4_TMRA3_CMPAR4_CMP1                     (*((volatile unsigned int*)(0x422B0984UL)))
#define bM4_TMRA3_CMPAR4_CMP2                     (*((volatile unsigned int*)(0x422B0988UL)))
#define bM4_TMRA3_CMPAR4_CMP3                     (*((volatile unsigned int*)(0x422B098CUL)))
#define bM4_TMRA3_CMPAR4_CMP4                     (*((volatile unsigned int*)(0x422B0990UL)))
#define bM4_TMRA3_CMPAR4_CMP5                     (*((volatile unsigned int*)(0x422B0994UL)))
#define bM4_TMRA3_CMPAR4_CMP6                     (*((volatile unsigned int*)(0x422B0998UL)))
#define bM4_TMRA3_CMPAR4_CMP7                     (*((volatile unsigned int*)(0x422B099CUL)))
#define bM4_TMRA3_CMPAR4_CMP8                     (*((volatile unsigned int*)(0x422B09A0UL)))
#define bM4_TMRA3_CMPAR4_CMP9                     (*((volatile unsigned int*)(0x422B09A4UL)))
#define bM4_TMRA3_CMPAR4_CMP10                    (*((volatile unsigned int*)(0x422B09A8UL)))
#define bM4_TMRA3_CMPAR4_CMP11                    (*((volatile unsigned int*)(0x422B09ACUL)))
#define bM4_TMRA3_CMPAR4_CMP12                    (*((volatile unsigned int*)(0x422B09B0UL)))
#define bM4_TMRA3_CMPAR4_CMP13                    (*((volatile unsigned int*)(0x422B09B4UL)))
#define bM4_TMRA3_CMPAR4_CMP14                    (*((volatile unsigned int*)(0x422B09B8UL)))
#define bM4_TMRA3_CMPAR4_CMP15                    (*((volatile unsigned int*)(0x422B09BCUL)))
#define bM4_TMRA3_CMPAR5_CMP0                     (*((volatile unsigned int*)(0x422B0A00UL)))
#define bM4_TMRA3_CMPAR5_CMP1                     (*((volatile unsigned int*)(0x422B0A04UL)))
#define bM4_TMRA3_CMPAR5_CMP2                     (*((volatile unsigned int*)(0x422B0A08UL)))
#define bM4_TMRA3_CMPAR5_CMP3                     (*((volatile unsigned int*)(0x422B0A0CUL)))
#define bM4_TMRA3_CMPAR5_CMP4                     (*((volatile unsigned int*)(0x422B0A10UL)))
#define bM4_TMRA3_CMPAR5_CMP5                     (*((volatile unsigned int*)(0x422B0A14UL)))
#define bM4_TMRA3_CMPAR5_CMP6                     (*((volatile unsigned int*)(0x422B0A18UL)))
#define bM4_TMRA3_CMPAR5_CMP7                     (*((volatile unsigned int*)(0x422B0A1CUL)))
#define bM4_TMRA3_CMPAR5_CMP8                     (*((volatile unsigned int*)(0x422B0A20UL)))
#define bM4_TMRA3_CMPAR5_CMP9                     (*((volatile unsigned int*)(0x422B0A24UL)))
#define bM4_TMRA3_CMPAR5_CMP10                    (*((volatile unsigned int*)(0x422B0A28UL)))
#define bM4_TMRA3_CMPAR5_CMP11                    (*((volatile unsigned int*)(0x422B0A2CUL)))
#define bM4_TMRA3_CMPAR5_CMP12                    (*((volatile unsigned int*)(0x422B0A30UL)))
#define bM4_TMRA3_CMPAR5_CMP13                    (*((volatile unsigned int*)(0x422B0A34UL)))
#define bM4_TMRA3_CMPAR5_CMP14                    (*((volatile unsigned int*)(0x422B0A38UL)))
#define bM4_TMRA3_CMPAR5_CMP15                    (*((volatile unsigned int*)(0x422B0A3CUL)))
#define bM4_TMRA3_CMPAR6_CMP0                     (*((volatile unsigned int*)(0x422B0A80UL)))
#define bM4_TMRA3_CMPAR6_CMP1                     (*((volatile unsigned int*)(0x422B0A84UL)))
#define bM4_TMRA3_CMPAR6_CMP2                     (*((volatile unsigned int*)(0x422B0A88UL)))
#define bM4_TMRA3_CMPAR6_CMP3                     (*((volatile unsigned int*)(0x422B0A8CUL)))
#define bM4_TMRA3_CMPAR6_CMP4                     (*((volatile unsigned int*)(0x422B0A90UL)))
#define bM4_TMRA3_CMPAR6_CMP5                     (*((volatile unsigned int*)(0x422B0A94UL)))
#define bM4_TMRA3_CMPAR6_CMP6                     (*((volatile unsigned int*)(0x422B0A98UL)))
#define bM4_TMRA3_CMPAR6_CMP7                     (*((volatile unsigned int*)(0x422B0A9CUL)))
#define bM4_TMRA3_CMPAR6_CMP8                     (*((volatile unsigned int*)(0x422B0AA0UL)))
#define bM4_TMRA3_CMPAR6_CMP9                     (*((volatile unsigned int*)(0x422B0AA4UL)))
#define bM4_TMRA3_CMPAR6_CMP10                    (*((volatile unsigned int*)(0x422B0AA8UL)))
#define bM4_TMRA3_CMPAR6_CMP11                    (*((volatile unsigned int*)(0x422B0AACUL)))
#define bM4_TMRA3_CMPAR6_CMP12                    (*((volatile unsigned int*)(0x422B0AB0UL)))
#define bM4_TMRA3_CMPAR6_CMP13                    (*((volatile unsigned int*)(0x422B0AB4UL)))
#define bM4_TMRA3_CMPAR6_CMP14                    (*((volatile unsigned int*)(0x422B0AB8UL)))
#define bM4_TMRA3_CMPAR6_CMP15                    (*((volatile unsigned int*)(0x422B0ABCUL)))
#define bM4_TMRA3_CMPAR7_CMP0                     (*((volatile unsigned int*)(0x422B0B00UL)))
#define bM4_TMRA3_CMPAR7_CMP1                     (*((volatile unsigned int*)(0x422B0B04UL)))
#define bM4_TMRA3_CMPAR7_CMP2                     (*((volatile unsigned int*)(0x422B0B08UL)))
#define bM4_TMRA3_CMPAR7_CMP3                     (*((volatile unsigned int*)(0x422B0B0CUL)))
#define bM4_TMRA3_CMPAR7_CMP4                     (*((volatile unsigned int*)(0x422B0B10UL)))
#define bM4_TMRA3_CMPAR7_CMP5                     (*((volatile unsigned int*)(0x422B0B14UL)))
#define bM4_TMRA3_CMPAR7_CMP6                     (*((volatile unsigned int*)(0x422B0B18UL)))
#define bM4_TMRA3_CMPAR7_CMP7                     (*((volatile unsigned int*)(0x422B0B1CUL)))
#define bM4_TMRA3_CMPAR7_CMP8                     (*((volatile unsigned int*)(0x422B0B20UL)))
#define bM4_TMRA3_CMPAR7_CMP9                     (*((volatile unsigned int*)(0x422B0B24UL)))
#define bM4_TMRA3_CMPAR7_CMP10                    (*((volatile unsigned int*)(0x422B0B28UL)))
#define bM4_TMRA3_CMPAR7_CMP11                    (*((volatile unsigned int*)(0x422B0B2CUL)))
#define bM4_TMRA3_CMPAR7_CMP12                    (*((volatile unsigned int*)(0x422B0B30UL)))
#define bM4_TMRA3_CMPAR7_CMP13                    (*((volatile unsigned int*)(0x422B0B34UL)))
#define bM4_TMRA3_CMPAR7_CMP14                    (*((volatile unsigned int*)(0x422B0B38UL)))
#define bM4_TMRA3_CMPAR7_CMP15                    (*((volatile unsigned int*)(0x422B0B3CUL)))
#define bM4_TMRA3_CMPAR8_CMP0                     (*((volatile unsigned int*)(0x422B0B80UL)))
#define bM4_TMRA3_CMPAR8_CMP1                     (*((volatile unsigned int*)(0x422B0B84UL)))
#define bM4_TMRA3_CMPAR8_CMP2                     (*((volatile unsigned int*)(0x422B0B88UL)))
#define bM4_TMRA3_CMPAR8_CMP3                     (*((volatile unsigned int*)(0x422B0B8CUL)))
#define bM4_TMRA3_CMPAR8_CMP4                     (*((volatile unsigned int*)(0x422B0B90UL)))
#define bM4_TMRA3_CMPAR8_CMP5                     (*((volatile unsigned int*)(0x422B0B94UL)))
#define bM4_TMRA3_CMPAR8_CMP6                     (*((volatile unsigned int*)(0x422B0B98UL)))
#define bM4_TMRA3_CMPAR8_CMP7                     (*((volatile unsigned int*)(0x422B0B9CUL)))
#define bM4_TMRA3_CMPAR8_CMP8                     (*((volatile unsigned int*)(0x422B0BA0UL)))
#define bM4_TMRA3_CMPAR8_CMP9                     (*((volatile unsigned int*)(0x422B0BA4UL)))
#define bM4_TMRA3_CMPAR8_CMP10                    (*((volatile unsigned int*)(0x422B0BA8UL)))
#define bM4_TMRA3_CMPAR8_CMP11                    (*((volatile unsigned int*)(0x422B0BACUL)))
#define bM4_TMRA3_CMPAR8_CMP12                    (*((volatile unsigned int*)(0x422B0BB0UL)))
#define bM4_TMRA3_CMPAR8_CMP13                    (*((volatile unsigned int*)(0x422B0BB4UL)))
#define bM4_TMRA3_CMPAR8_CMP14                    (*((volatile unsigned int*)(0x422B0BB8UL)))
#define bM4_TMRA3_CMPAR8_CMP15                    (*((volatile unsigned int*)(0x422B0BBCUL)))
#define bM4_TMRA3_BCSTR_START                     (*((volatile unsigned int*)(0x422B1000UL)))
#define bM4_TMRA3_BCSTR_DIR                       (*((volatile unsigned int*)(0x422B1004UL)))
#define bM4_TMRA3_BCSTR_MODE                      (*((volatile unsigned int*)(0x422B1008UL)))
#define bM4_TMRA3_BCSTR_SYNST                     (*((volatile unsigned int*)(0x422B100CUL)))
#define bM4_TMRA3_BCSTR_CKDIV0                    (*((volatile unsigned int*)(0x422B1010UL)))
#define bM4_TMRA3_BCSTR_CKDIV1                    (*((volatile unsigned int*)(0x422B1014UL)))
#define bM4_TMRA3_BCSTR_CKDIV2                    (*((volatile unsigned int*)(0x422B1018UL)))
#define bM4_TMRA3_BCSTR_CKDIV3                    (*((volatile unsigned int*)(0x422B101CUL)))
#define bM4_TMRA3_BCSTR_ITENOVF                   (*((volatile unsigned int*)(0x422B1030UL)))
#define bM4_TMRA3_BCSTR_ITENUDF                   (*((volatile unsigned int*)(0x422B1034UL)))
#define bM4_TMRA3_BCSTR_OVFF                      (*((volatile unsigned int*)(0x422B1038UL)))
#define bM4_TMRA3_BCSTR_UDFF                      (*((volatile unsigned int*)(0x422B103CUL)))
#define bM4_TMRA3_HCONR_HSTA0                     (*((volatile unsigned int*)(0x422B1080UL)))
#define bM4_TMRA3_HCONR_HSTA1                     (*((volatile unsigned int*)(0x422B1084UL)))
#define bM4_TMRA3_HCONR_HSTA2                     (*((volatile unsigned int*)(0x422B1088UL)))
#define bM4_TMRA3_HCONR_HSTP0                     (*((volatile unsigned int*)(0x422B1090UL)))
#define bM4_TMRA3_HCONR_HSTP1                     (*((volatile unsigned int*)(0x422B1094UL)))
#define bM4_TMRA3_HCONR_HSTP2                     (*((volatile unsigned int*)(0x422B1098UL)))
#define bM4_TMRA3_HCONR_HCLE0                     (*((volatile unsigned int*)(0x422B10A0UL)))
#define bM4_TMRA3_HCONR_HCLE1                     (*((volatile unsigned int*)(0x422B10A4UL)))
#define bM4_TMRA3_HCONR_HCLE2                     (*((volatile unsigned int*)(0x422B10A8UL)))
#define bM4_TMRA3_HCONR_HCLE3                     (*((volatile unsigned int*)(0x422B10B0UL)))
#define bM4_TMRA3_HCONR_HCLE4                     (*((volatile unsigned int*)(0x422B10B4UL)))
#define bM4_TMRA3_HCONR_HCLE5                     (*((volatile unsigned int*)(0x422B10B8UL)))
#define bM4_TMRA3_HCONR_HCLE6                     (*((volatile unsigned int*)(0x422B10BCUL)))
#define bM4_TMRA3_HCUPR_HCUP0                     (*((volatile unsigned int*)(0x422B1100UL)))
#define bM4_TMRA3_HCUPR_HCUP1                     (*((volatile unsigned int*)(0x422B1104UL)))
#define bM4_TMRA3_HCUPR_HCUP2                     (*((volatile unsigned int*)(0x422B1108UL)))
#define bM4_TMRA3_HCUPR_HCUP3                     (*((volatile unsigned int*)(0x422B110CUL)))
#define bM4_TMRA3_HCUPR_HCUP4                     (*((volatile unsigned int*)(0x422B1110UL)))
#define bM4_TMRA3_HCUPR_HCUP5                     (*((volatile unsigned int*)(0x422B1114UL)))
#define bM4_TMRA3_HCUPR_HCUP6                     (*((volatile unsigned int*)(0x422B1118UL)))
#define bM4_TMRA3_HCUPR_HCUP7                     (*((volatile unsigned int*)(0x422B111CUL)))
#define bM4_TMRA3_HCUPR_HCUP8                     (*((volatile unsigned int*)(0x422B1120UL)))
#define bM4_TMRA3_HCUPR_HCUP9                     (*((volatile unsigned int*)(0x422B1124UL)))
#define bM4_TMRA3_HCUPR_HCUP10                    (*((volatile unsigned int*)(0x422B1128UL)))
#define bM4_TMRA3_HCUPR_HCUP11                    (*((volatile unsigned int*)(0x422B112CUL)))
#define bM4_TMRA3_HCUPR_HCUP12                    (*((volatile unsigned int*)(0x422B1130UL)))
#define bM4_TMRA3_HCDOR_HCDO0                     (*((volatile unsigned int*)(0x422B1180UL)))
#define bM4_TMRA3_HCDOR_HCDO1                     (*((volatile unsigned int*)(0x422B1184UL)))
#define bM4_TMRA3_HCDOR_HCDO2                     (*((volatile unsigned int*)(0x422B1188UL)))
#define bM4_TMRA3_HCDOR_HCDO3                     (*((volatile unsigned int*)(0x422B118CUL)))
#define bM4_TMRA3_HCDOR_HCDO4                     (*((volatile unsigned int*)(0x422B1190UL)))
#define bM4_TMRA3_HCDOR_HCDO5                     (*((volatile unsigned int*)(0x422B1194UL)))
#define bM4_TMRA3_HCDOR_HCDO6                     (*((volatile unsigned int*)(0x422B1198UL)))
#define bM4_TMRA3_HCDOR_HCDO7                     (*((volatile unsigned int*)(0x422B119CUL)))
#define bM4_TMRA3_HCDOR_HCDO8                     (*((volatile unsigned int*)(0x422B11A0UL)))
#define bM4_TMRA3_HCDOR_HCDO9                     (*((volatile unsigned int*)(0x422B11A4UL)))
#define bM4_TMRA3_HCDOR_HCDO10                    (*((volatile unsigned int*)(0x422B11A8UL)))
#define bM4_TMRA3_HCDOR_HCDO11                    (*((volatile unsigned int*)(0x422B11ACUL)))
#define bM4_TMRA3_HCDOR_HCDO12                    (*((volatile unsigned int*)(0x422B11B0UL)))
#define bM4_TMRA3_ICONR_ITEN1                     (*((volatile unsigned int*)(0x422B1200UL)))
#define bM4_TMRA3_ICONR_ITEN2                     (*((volatile unsigned int*)(0x422B1204UL)))
#define bM4_TMRA3_ICONR_ITEN3                     (*((volatile unsigned int*)(0x422B1208UL)))
#define bM4_TMRA3_ICONR_ITEN4                     (*((volatile unsigned int*)(0x422B120CUL)))
#define bM4_TMRA3_ICONR_ITEN5                     (*((volatile unsigned int*)(0x422B1210UL)))
#define bM4_TMRA3_ICONR_ITEN6                     (*((volatile unsigned int*)(0x422B1214UL)))
#define bM4_TMRA3_ICONR_ITEN7                     (*((volatile unsigned int*)(0x422B1218UL)))
#define bM4_TMRA3_ICONR_ITEN8                     (*((volatile unsigned int*)(0x422B121CUL)))
#define bM4_TMRA3_ECONR_ETEN1                     (*((volatile unsigned int*)(0x422B1280UL)))
#define bM4_TMRA3_ECONR_ETEN2                     (*((volatile unsigned int*)(0x422B1284UL)))
#define bM4_TMRA3_ECONR_ETEN3                     (*((volatile unsigned int*)(0x422B1288UL)))
#define bM4_TMRA3_ECONR_ETEN4                     (*((volatile unsigned int*)(0x422B128CUL)))
#define bM4_TMRA3_ECONR_ETEN5                     (*((volatile unsigned int*)(0x422B1290UL)))
#define bM4_TMRA3_ECONR_ETEN6                     (*((volatile unsigned int*)(0x422B1294UL)))
#define bM4_TMRA3_ECONR_ETEN7                     (*((volatile unsigned int*)(0x422B1298UL)))
#define bM4_TMRA3_ECONR_ETEN8                     (*((volatile unsigned int*)(0x422B129CUL)))
#define bM4_TMRA3_FCONR_NOFIENTG                  (*((volatile unsigned int*)(0x422B1300UL)))
#define bM4_TMRA3_FCONR_NOFICKTG0                 (*((volatile unsigned int*)(0x422B1304UL)))
#define bM4_TMRA3_FCONR_NOFICKTG1                 (*((volatile unsigned int*)(0x422B1308UL)))
#define bM4_TMRA3_FCONR_NOFIENCA                  (*((volatile unsigned int*)(0x422B1320UL)))
#define bM4_TMRA3_FCONR_NOFICKCA0                 (*((volatile unsigned int*)(0x422B1324UL)))
#define bM4_TMRA3_FCONR_NOFICKCA1                 (*((volatile unsigned int*)(0x422B1328UL)))
#define bM4_TMRA3_FCONR_NOFIENCB                  (*((volatile unsigned int*)(0x422B1330UL)))
#define bM4_TMRA3_FCONR_NOFICKCB0                 (*((volatile unsigned int*)(0x422B1334UL)))
#define bM4_TMRA3_FCONR_NOFICKCB1                 (*((volatile unsigned int*)(0x422B1338UL)))
#define bM4_TMRA3_STFLR_CMPF1                     (*((volatile unsigned int*)(0x422B1380UL)))
#define bM4_TMRA3_STFLR_CMPF2                     (*((volatile unsigned int*)(0x422B1384UL)))
#define bM4_TMRA3_STFLR_CMPF3                     (*((volatile unsigned int*)(0x422B1388UL)))
#define bM4_TMRA3_STFLR_CMPF4                     (*((volatile unsigned int*)(0x422B138CUL)))
#define bM4_TMRA3_STFLR_CMPF5                     (*((volatile unsigned int*)(0x422B1390UL)))
#define bM4_TMRA3_STFLR_CMPF6                     (*((volatile unsigned int*)(0x422B1394UL)))
#define bM4_TMRA3_STFLR_CMPF7                     (*((volatile unsigned int*)(0x422B1398UL)))
#define bM4_TMRA3_STFLR_CMPF8                     (*((volatile unsigned int*)(0x422B139CUL)))
#define bM4_TMRA3_BCONR1_BEN                      (*((volatile unsigned int*)(0x422B1800UL)))
#define bM4_TMRA3_BCONR1_BSE0                     (*((volatile unsigned int*)(0x422B1804UL)))
#define bM4_TMRA3_BCONR1_BSE1                     (*((volatile unsigned int*)(0x422B1808UL)))
#define bM4_TMRA3_BCONR2_BEN                      (*((volatile unsigned int*)(0x422B1900UL)))
#define bM4_TMRA3_BCONR2_BSE0                     (*((volatile unsigned int*)(0x422B1904UL)))
#define bM4_TMRA3_BCONR2_BSE1                     (*((volatile unsigned int*)(0x422B1908UL)))
#define bM4_TMRA3_BCONR3_BEN                      (*((volatile unsigned int*)(0x422B1A00UL)))
#define bM4_TMRA3_BCONR3_BSE0                     (*((volatile unsigned int*)(0x422B1A04UL)))
#define bM4_TMRA3_BCONR3_BSE1                     (*((volatile unsigned int*)(0x422B1A08UL)))
#define bM4_TMRA3_BCONR4_BEN                      (*((volatile unsigned int*)(0x422B1B00UL)))
#define bM4_TMRA3_BCONR4_BSE0                     (*((volatile unsigned int*)(0x422B1B04UL)))
#define bM4_TMRA3_BCONR4_BSE1                     (*((volatile unsigned int*)(0x422B1B08UL)))
#define bM4_TMRA3_CCONR1_CAPMD                    (*((volatile unsigned int*)(0x422B2000UL)))
#define bM4_TMRA3_CCONR1_HICP0                    (*((volatile unsigned int*)(0x422B2010UL)))
#define bM4_TMRA3_CCONR1_HICP1                    (*((volatile unsigned int*)(0x422B2014UL)))
#define bM4_TMRA3_CCONR1_HICP2                    (*((volatile unsigned int*)(0x422B2018UL)))
#define bM4_TMRA3_CCONR1_HICP3                    (*((volatile unsigned int*)(0x422B2020UL)))
#define bM4_TMRA3_CCONR1_HICP4                    (*((volatile unsigned int*)(0x422B2024UL)))
#define bM4_TMRA3_CCONR1_NOFIENCP                 (*((volatile unsigned int*)(0x422B2030UL)))
