SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460jeta_template/common/hc32f460jeta.h
#define bM4_USBFS_HCTSIZ1_XFRSIZ18                (*((volatile unsigned int*)(0x4380A648UL)))
#define bM4_USBFS_HCTSIZ1_PKTCNT0                 (*((volatile unsigned int*)(0x4380A64CUL)))
#define bM4_USBFS_HCTSIZ1_PKTCNT1                 (*((volatile unsigned int*)(0x4380A650UL)))
#define bM4_USBFS_HCTSIZ1_PKTCNT2                 (*((volatile unsigned int*)(0x4380A654UL)))
#define bM4_USBFS_HCTSIZ1_PKTCNT3                 (*((volatile unsigned int*)(0x4380A658UL)))
#define bM4_USBFS_HCTSIZ1_PKTCNT4                 (*((volatile unsigned int*)(0x4380A65CUL)))
#define bM4_USBFS_HCTSIZ1_PKTCNT5                 (*((volatile unsigned int*)(0x4380A660UL)))
#define bM4_USBFS_HCTSIZ1_PKTCNT6                 (*((volatile unsigned int*)(0x4380A664UL)))
#define bM4_USBFS_HCTSIZ1_PKTCNT7                 (*((volatile unsigned int*)(0x4380A668UL)))
#define bM4_USBFS_HCTSIZ1_PKTCNT8                 (*((volatile unsigned int*)(0x4380A66CUL)))
#define bM4_USBFS_HCTSIZ1_PKTCNT9                 (*((volatile unsigned int*)(0x4380A670UL)))
#define bM4_USBFS_HCTSIZ1_DPID0                   (*((volatile unsigned int*)(0x4380A674UL)))
#define bM4_USBFS_HCTSIZ1_DPID1                   (*((volatile unsigned int*)(0x4380A678UL)))
#define bM4_USBFS_HCCHAR2_MPSIZ0                  (*((volatile unsigned int*)(0x4380A800UL)))
#define bM4_USBFS_HCCHAR2_MPSIZ1                  (*((volatile unsigned int*)(0x4380A804UL)))
#define bM4_USBFS_HCCHAR2_MPSIZ2                  (*((volatile unsigned int*)(0x4380A808UL)))
#define bM4_USBFS_HCCHAR2_MPSIZ3                  (*((volatile unsigned int*)(0x4380A80CUL)))
#define bM4_USBFS_HCCHAR2_MPSIZ4                  (*((volatile unsigned int*)(0x4380A810UL)))
#define bM4_USBFS_HCCHAR2_MPSIZ5                  (*((volatile unsigned int*)(0x4380A814UL)))
#define bM4_USBFS_HCCHAR2_MPSIZ6                  (*((volatile unsigned int*)(0x4380A818UL)))
#define bM4_USBFS_HCCHAR2_MPSIZ7                  (*((volatile unsigned int*)(0x4380A81CUL)))
#define bM4_USBFS_HCCHAR2_MPSIZ8                  (*((volatile unsigned int*)(0x4380A820UL)))
#define bM4_USBFS_HCCHAR2_MPSIZ9                  (*((volatile unsigned int*)(0x4380A824UL)))
#define bM4_USBFS_HCCHAR2_MPSIZ10                 (*((volatile unsigned int*)(0x4380A828UL)))
#define bM4_USBFS_HCCHAR2_EPNUM0                  (*((volatile unsigned int*)(0x4380A82CUL)))
#define bM4_USBFS_HCCHAR2_EPNUM1                  (*((volatile unsigned int*)(0x4380A830UL)))
#define bM4_USBFS_HCCHAR2_EPNUM2                  (*((volatile unsigned int*)(0x4380A834UL)))
#define bM4_USBFS_HCCHAR2_EPNUM3                  (*((volatile unsigned int*)(0x4380A838UL)))
#define bM4_USBFS_HCCHAR2_EPDIR                   (*((volatile unsigned int*)(0x4380A83CUL)))
#define bM4_USBFS_HCCHAR2_LSDEV                   (*((volatile unsigned int*)(0x4380A844UL)))
#define bM4_USBFS_HCCHAR2_EPTYP0                  (*((volatile unsigned int*)(0x4380A848UL)))
#define bM4_USBFS_HCCHAR2_EPTYP1                  (*((volatile unsigned int*)(0x4380A84CUL)))
#define bM4_USBFS_HCCHAR2_DAD0                    (*((volatile unsigned int*)(0x4380A858UL)))
#define bM4_USBFS_HCCHAR2_DAD1                    (*((volatile unsigned int*)(0x4380A85CUL)))
#define bM4_USBFS_HCCHAR2_DAD2                    (*((volatile unsigned int*)(0x4380A860UL)))
#define bM4_USBFS_HCCHAR2_DAD3                    (*((volatile unsigned int*)(0x4380A864UL)))
#define bM4_USBFS_HCCHAR2_DAD4                    (*((volatile unsigned int*)(0x4380A868UL)))
#define bM4_USBFS_HCCHAR2_DAD5                    (*((volatile unsigned int*)(0x4380A86CUL)))
#define bM4_USBFS_HCCHAR2_DAD6                    (*((volatile unsigned int*)(0x4380A870UL)))
#define bM4_USBFS_HCCHAR2_ODDFRM                  (*((volatile unsigned int*)(0x4380A874UL)))
#define bM4_USBFS_HCCHAR2_CHDIS                   (*((volatile unsigned int*)(0x4380A878UL)))
#define bM4_USBFS_HCCHAR2_CHENA                   (*((volatile unsigned int*)(0x4380A87CUL)))
#define bM4_USBFS_HCINT2_XFRC                     (*((volatile unsigned int*)(0x4380A900UL)))
#define bM4_USBFS_HCINT2_CHH                      (*((volatile unsigned int*)(0x4380A904UL)))
#define bM4_USBFS_HCINT2_STALL                    (*((volatile unsigned int*)(0x4380A90CUL)))
#define bM4_USBFS_HCINT2_NAK                      (*((volatile unsigned int*)(0x4380A910UL)))
#define bM4_USBFS_HCINT2_ACK                      (*((volatile unsigned int*)(0x4380A914UL)))
#define bM4_USBFS_HCINT2_TXERR                    (*((volatile unsigned int*)(0x4380A91CUL)))
#define bM4_USBFS_HCINT2_BBERR                    (*((volatile unsigned int*)(0x4380A920UL)))
#define bM4_USBFS_HCINT2_FRMOR                    (*((volatile unsigned int*)(0x4380A924UL)))
#define bM4_USBFS_HCINT2_DTERR                    (*((volatile unsigned int*)(0x4380A928UL)))
#define bM4_USBFS_HCINTMSK2_XFRCM                 (*((volatile unsigned int*)(0x4380A980UL)))
#define bM4_USBFS_HCINTMSK2_CHHM                  (*((volatile unsigned int*)(0x4380A984UL)))
#define bM4_USBFS_HCINTMSK2_STALLM                (*((volatile unsigned int*)(0x4380A98CUL)))
#define bM4_USBFS_HCINTMSK2_NAKM                  (*((volatile unsigned int*)(0x4380A990UL)))
#define bM4_USBFS_HCINTMSK2_ACKM                  (*((volatile unsigned int*)(0x4380A994UL)))
#define bM4_USBFS_HCINTMSK2_TXERRM                (*((volatile unsigned int*)(0x4380A99CUL)))
#define bM4_USBFS_HCINTMSK2_BBERRM                (*((volatile unsigned int*)(0x4380A9A0UL)))
#define bM4_USBFS_HCINTMSK2_FRMORM                (*((volatile unsigned int*)(0x4380A9A4UL)))
#define bM4_USBFS_HCINTMSK2_DTERRM                (*((volatile unsigned int*)(0x4380A9A8UL)))
#define bM4_USBFS_HCTSIZ2_XFRSIZ0                 (*((volatile unsigned int*)(0x4380AA00UL)))
#define bM4_USBFS_HCTSIZ2_XFRSIZ1                 (*((volatile unsigned int*)(0x4380AA04UL)))
#define bM4_USBFS_HCTSIZ2_XFRSIZ2                 (*((volatile unsigned int*)(0x4380AA08UL)))
#define bM4_USBFS_HCTSIZ2_XFRSIZ3                 (*((volatile unsigned int*)(0x4380AA0CUL)))
#define bM4_USBFS_HCTSIZ2_XFRSIZ4                 (*((volatile unsigned int*)(0x4380AA10UL)))
#define bM4_USBFS_HCTSIZ2_XFRSIZ5                 (*((volatile unsigned int*)(0x4380AA14UL)))
#define bM4_USBFS_HCTSIZ2_XFRSIZ6                 (*((volatile unsigned int*)(0x4380AA18UL)))
#define bM4_USBFS_HCTSIZ2_XFRSIZ7                 (*((volatile unsigned int*)(0x4380AA1CUL)))
#define bM4_USBFS_HCTSIZ2_XFRSIZ8                 (*((volatile unsigned int*)(0x4380AA20UL)))
#define bM4_USBFS_HCTSIZ2_XFRSIZ9                 (*((volatile unsigned int*)(0x4380AA24UL)))
#define bM4_USBFS_HCTSIZ2_XFRSIZ10                (*((volatile unsigned int*)(0x4380AA28UL)))
#define bM4_USBFS_HCTSIZ2_XFRSIZ11                (*((volatile unsigned int*)(0x4380AA2CUL)))
#define bM4_USBFS_HCTSIZ2_XFRSIZ12                (*((volatile unsigned int*)(0x4380AA30UL)))
#define bM4_USBFS_HCTSIZ2_XFRSIZ13                (*((volatile unsigned int*)(0x4380AA34UL)))
#define bM4_USBFS_HCTSIZ2_XFRSIZ14                (*((volatile unsigned int*)(0x4380AA38UL)))
#define bM4_USBFS_HCTSIZ2_XFRSIZ15                (*((volatile unsigned int*)(0x4380AA3CUL)))
#define bM4_USBFS_HCTSIZ2_XFRSIZ16                (*((volatile unsigned int*)(0x4380AA40UL)))
#define bM4_USBFS_HCTSIZ2_XFRSIZ17                (*((volatile unsigned int*)(0x4380AA44UL)))
#define bM4_USBFS_HCTSIZ2_XFRSIZ18                (*((volatile unsigned int*)(0x4380AA48UL)))
#define bM4_USBFS_HCTSIZ2_PKTCNT0                 (*((volatile unsigned int*)(0x4380AA4CUL)))
#define bM4_USBFS_HCTSIZ2_PKTCNT1                 (*((volatile unsigned int*)(0x4380AA50UL)))
#define bM4_USBFS_HCTSIZ2_PKTCNT2                 (*((volatile unsigned int*)(0x4380AA54UL)))
#define bM4_USBFS_HCTSIZ2_PKTCNT3                 (*((volatile unsigned int*)(0x4380AA58UL)))
#define bM4_USBFS_HCTSIZ2_PKTCNT4                 (*((volatile unsigned int*)(0x4380AA5CUL)))
#define bM4_USBFS_HCTSIZ2_PKTCNT5                 (*((volatile unsigned int*)(0x4380AA60UL)))
#define bM4_USBFS_HCTSIZ2_PKTCNT6                 (*((volatile unsigned int*)(0x4380AA64UL)))
#define bM4_USBFS_HCTSIZ2_PKTCNT7                 (*((volatile unsigned int*)(0x4380AA68UL)))
#define bM4_USBFS_HCTSIZ2_PKTCNT8                 (*((volatile unsigned int*)(0x4380AA6CUL)))
#define bM4_USBFS_HCTSIZ2_PKTCNT9                 (*((volatile unsigned int*)(0x4380AA70UL)))
#define bM4_USBFS_HCTSIZ2_DPID0                   (*((volatile unsigned int*)(0x4380AA74UL)))
#define bM4_USBFS_HCTSIZ2_DPID1                   (*((volatile unsigned int*)(0x4380AA78UL)))
#define bM4_USBFS_HCCHAR3_MPSIZ0                  (*((volatile unsigned int*)(0x4380AC00UL)))
#define bM4_USBFS_HCCHAR3_MPSIZ1                  (*((volatile unsigned int*)(0x4380AC04UL)))
#define bM4_USBFS_HCCHAR3_MPSIZ2                  (*((volatile unsigned int*)(0x4380AC08UL)))
#define bM4_USBFS_HCCHAR3_MPSIZ3                  (*((volatile unsigned int*)(0x4380AC0CUL)))
#define bM4_USBFS_HCCHAR3_MPSIZ4                  (*((volatile unsigned int*)(0x4380AC10UL)))
#define bM4_USBFS_HCCHAR3_MPSIZ5                  (*((volatile unsigned int*)(0x4380AC14UL)))
#define bM4_USBFS_HCCHAR3_MPSIZ6                  (*((volatile unsigned int*)(0x4380AC18UL)))
#define bM4_USBFS_HCCHAR3_MPSIZ7                  (*((volatile unsigned int*)(0x4380AC1CUL)))
#define bM4_USBFS_HCCHAR3_MPSIZ8                  (*((volatile unsigned int*)(0x4380AC20UL)))
#define bM4_USBFS_HCCHAR3_MPSIZ9                  (*((volatile unsigned int*)(0x4380AC24UL)))
#define bM4_USBFS_HCCHAR3_MPSIZ10                 (*((volatile unsigned int*)(0x4380AC28UL)))
#define bM4_USBFS_HCCHAR3_EPNUM0                  (*((volatile unsigned int*)(0x4380AC2CUL)))
#define bM4_USBFS_HCCHAR3_EPNUM1                  (*((volatile unsigned int*)(0x4380AC30UL)))
#define bM4_USBFS_HCCHAR3_EPNUM2                  (*((volatile unsigned int*)(0x4380AC34UL)))
#define bM4_USBFS_HCCHAR3_EPNUM3                  (*((volatile unsigned int*)(0x4380AC38UL)))
#define bM4_USBFS_HCCHAR3_EPDIR                   (*((volatile unsigned int*)(0x4380AC3CUL)))
#define bM4_USBFS_HCCHAR3_LSDEV                   (*((volatile unsigned int*)(0x4380AC44UL)))
#define bM4_USBFS_HCCHAR3_EPTYP0                  (*((volatile unsigned int*)(0x4380AC48UL)))
#define bM4_USBFS_HCCHAR3_EPTYP1                  (*((volatile unsigned int*)(0x4380AC4CUL)))
#define bM4_USBFS_HCCHAR3_DAD0                    (*((volatile unsigned int*)(0x4380AC58UL)))
#define bM4_USBFS_HCCHAR3_DAD1                    (*((volatile unsigned int*)(0x4380AC5CUL)))
#define bM4_USBFS_HCCHAR3_DAD2                    (*((volatile unsigned int*)(0x4380AC60UL)))
#define bM4_USBFS_HCCHAR3_DAD3                    (*((volatile unsigned int*)(0x4380AC64UL)))
#define bM4_USBFS_HCCHAR3_DAD4                    (*((volatile unsigned int*)(0x4380AC68UL)))
#define bM4_USBFS_HCCHAR3_DAD5                    (*((volatile unsigned int*)(0x4380AC6CUL)))
#define bM4_USBFS_HCCHAR3_DAD6                    (*((volatile unsigned int*)(0x4380AC70UL)))
#define bM4_USBFS_HCCHAR3_ODDFRM                  (*((volatile unsigned int*)(0x4380AC74UL)))
#define bM4_USBFS_HCCHAR3_CHDIS                   (*((volatile unsigned int*)(0x4380AC78UL)))
#define bM4_USBFS_HCCHAR3_CHENA                   (*((volatile unsigned int*)(0x4380AC7CUL)))
#define bM4_USBFS_HCINT3_XFRC                     (*((volatile unsigned int*)(0x4380AD00UL)))
#define bM4_USBFS_HCINT3_CHH                      (*((volatile unsigned int*)(0x4380AD04UL)))
#define bM4_USBFS_HCINT3_STALL                    (*((volatile unsigned int*)(0x4380AD0CUL)))
#define bM4_USBFS_HCINT3_NAK                      (*((volatile unsigned int*)(0x4380AD10UL)))
#define bM4_USBFS_HCINT3_ACK                      (*((volatile unsigned int*)(0x4380AD14UL)))
#define bM4_USBFS_HCINT3_TXERR                    (*((volatile unsigned int*)(0x4380AD1CUL)))
#define bM4_USBFS_HCINT3_BBERR                    (*((volatile unsigned int*)(0x4380AD20UL)))
#define bM4_USBFS_HCINT3_FRMOR                    (*((volatile unsigned int*)(0x4380AD24UL)))
#define bM4_USBFS_HCINT3_DTERR                    (*((volatile unsigned int*)(0x4380AD28UL)))
#define bM4_USBFS_HCINTMSK3_XFRCM                 (*((volatile unsigned int*)(0x4380AD80UL)))
#define bM4_USBFS_HCINTMSK3_CHHM                  (*((volatile unsigned int*)(0x4380AD84UL)))
#define bM4_USBFS_HCINTMSK3_STALLM                (*((volatile unsigned int*)(0x4380AD8CUL)))
#define bM4_USBFS_HCINTMSK3_NAKM                  (*((volatile unsigned int*)(0x4380AD90UL)))
#define bM4_USBFS_HCINTMSK3_ACKM                  (*((volatile unsigned int*)(0x4380AD94UL)))
#define bM4_USBFS_HCINTMSK3_TXERRM                (*((volatile unsigned int*)(0x4380AD9CUL)))
#define bM4_USBFS_HCINTMSK3_BBERRM                (*((volatile unsigned int*)(0x4380ADA0UL)))
#define bM4_USBFS_HCINTMSK3_FRMORM                (*((volatile unsigned int*)(0x4380ADA4UL)))
#define bM4_USBFS_HCINTMSK3_DTERRM                (*((volatile unsigned int*)(0x4380ADA8UL)))
#define bM4_USBFS_HCTSIZ3_XFRSIZ0                 (*((volatile unsigned int*)(0x4380AE00UL)))
#define bM4_USBFS_HCTSIZ3_XFRSIZ1                 (*((volatile unsigned int*)(0x4380AE04UL)))
#define bM4_USBFS_HCTSIZ3_XFRSIZ2                 (*((volatile unsigned int*)(0x4380AE08UL)))
#define bM4_USBFS_HCTSIZ3_XFRSIZ3                 (*((volatile unsigned int*)(0x4380AE0CUL)))
#define bM4_USBFS_HCTSIZ3_XFRSIZ4                 (*((volatile unsigned int*)(0x4380AE10UL)))
#define bM4_USBFS_HCTSIZ3_XFRSIZ5                 (*((volatile unsigned int*)(0x4380AE14UL)))
#define bM4_USBFS_HCTSIZ3_XFRSIZ6                 (*((volatile unsigned int*)(0x4380AE18UL)))
#define bM4_USBFS_HCTSIZ3_XFRSIZ7                 (*((volatile unsigned int*)(0x4380AE1CUL)))
#define bM4_USBFS_HCTSIZ3_XFRSIZ8                 (*((volatile unsigned int*)(0x4380AE20UL)))
#define bM4_USBFS_HCTSIZ3_XFRSIZ9                 (*((volatile unsigned int*)(0x4380AE24UL)))
#define bM4_USBFS_HCTSIZ3_XFRSIZ10                (*((volatile unsigned int*)(0x4380AE28UL)))
#define bM4_USBFS_HCTSIZ3_XFRSIZ11                (*((volatile unsigned int*)(0x4380AE2CUL)))
#define bM4_USBFS_HCTSIZ3_XFRSIZ12                (*((volatile unsigned int*)(0x4380AE30UL)))
#define bM4_USBFS_HCTSIZ3_XFRSIZ13                (*((volatile unsigned int*)(0x4380AE34UL)))
#define bM4_USBFS_HCTSIZ3_XFRSIZ14                (*((volatile unsigned int*)(0x4380AE38UL)))
#define bM4_USBFS_HCTSIZ3_XFRSIZ15                (*((volatile unsigned int*)(0x4380AE3CUL)))
#define bM4_USBFS_HCTSIZ3_XFRSIZ16                (*((volatile unsigned int*)(0x4380AE40UL)))
#define bM4_USBFS_HCTSIZ3_XFRSIZ17                (*((volatile unsigned int*)(0x4380AE44UL)))
#define bM4_USBFS_HCTSIZ3_XFRSIZ18                (*((volatile unsigned int*)(0x4380AE48UL)))
#define bM4_USBFS_HCTSIZ3_PKTCNT0                 (*((volatile unsigned int*)(0x4380AE4CUL)))
#define bM4_USBFS_HCTSIZ3_PKTCNT1                 (*((volatile unsigned int*)(0x4380AE50UL)))
#define bM4_USBFS_HCTSIZ3_PKTCNT2                 (*((volatile unsigned int*)(0x4380AE54UL)))
#define bM4_USBFS_HCTSIZ3_PKTCNT3                 (*((volatile unsigned int*)(0x4380AE58UL)))
#define bM4_USBFS_HCTSIZ3_PKTCNT4                 (*((volatile unsigned int*)(0x4380AE5CUL)))
#define bM4_USBFS_HCTSIZ3_PKTCNT5                 (*((volatile unsigned int*)(0x4380AE60UL)))
#define bM4_USBFS_HCTSIZ3_PKTCNT6                 (*((volatile unsigned int*)(0x4380AE64UL)))
#define bM4_USBFS_HCTSIZ3_PKTCNT7                 (*((volatile unsigned int*)(0x4380AE68UL)))
#define bM4_USBFS_HCTSIZ3_PKTCNT8                 (*((volatile unsigned int*)(0x4380AE6CUL)))
#define bM4_USBFS_HCTSIZ3_PKTCNT9                 (*((volatile unsigned int*)(0x4380AE70UL)))
#define bM4_USBFS_HCTSIZ3_DPID0                   (*((volatile unsigned int*)(0x4380AE74UL)))
#define bM4_USBFS_HCTSIZ3_DPID1                   (*((volatile unsigned int*)(0x4380AE78UL)))
#define bM4_USBFS_HCCHAR4_MPSIZ0                  (*((volatile unsigned int*)(0x4380B000UL)))
#define bM4_USBFS_HCCHAR4_MPSIZ1                  (*((volatile unsigned int*)(0x4380B004UL)))
#define bM4_USBFS_HCCHAR4_MPSIZ2                  (*((volatile unsigned int*)(0x4380B008UL)))
#define bM4_USBFS_HCCHAR4_MPSIZ3                  (*((volatile unsigned int*)(0x4380B00CUL)))
#define bM4_USBFS_HCCHAR4_MPSIZ4                  (*((volatile unsigned int*)(0x4380B010UL)))
#define bM4_USBFS_HCCHAR4_MPSIZ5                  (*((volatile unsigned int*)(0x4380B014UL)))
#define bM4_USBFS_HCCHAR4_MPSIZ6                  (*((volatile unsigned int*)(0x4380B018UL)))
#define bM4_USBFS_HCCHAR4_MPSIZ7                  (*((volatile unsigned int*)(0x4380B01CUL)))
#define bM4_USBFS_HCCHAR4_MPSIZ8                  (*((volatile unsigned int*)(0x4380B020UL)))
#define bM4_USBFS_HCCHAR4_MPSIZ9                  (*((volatile unsigned int*)(0x4380B024UL)))
#define bM4_USBFS_HCCHAR4_MPSIZ10                 (*((volatile unsigned int*)(0x4380B028UL)))
#define bM4_USBFS_HCCHAR4_EPNUM0                  (*((volatile unsigned int*)(0x4380B02CUL)))
#define bM4_USBFS_HCCHAR4_EPNUM1                  (*((volatile unsigned int*)(0x4380B030UL)))
#define bM4_USBFS_HCCHAR4_EPNUM2                  (*((volatile unsigned int*)(0x4380B034UL)))
#define bM4_USBFS_HCCHAR4_EPNUM3                  (*((volatile unsigned int*)(0x4380B038UL)))
#define bM4_USBFS_HCCHAR4_EPDIR                   (*((volatile unsigned int*)(0x4380B03CUL)))
#define bM4_USBFS_HCCHAR4_LSDEV                   (*((volatile unsigned int*)(0x4380B044UL)))
#define bM4_USBFS_HCCHAR4_EPTYP0                  (*((volatile unsigned int*)(0x4380B048UL)))
#define bM4_USBFS_HCCHAR4_EPTYP1                  (*((volatile unsigned int*)(0x4380B04CUL)))
#define bM4_USBFS_HCCHAR4_DAD0                    (*((volatile unsigned int*)(0x4380B058UL)))
#define bM4_USBFS_HCCHAR4_DAD1                    (*((volatile unsigned int*)(0x4380B05CUL)))
#define bM4_USBFS_HCCHAR4_DAD2                    (*((volatile unsigned int*)(0x4380B060UL)))
#define bM4_USBFS_HCCHAR4_DAD3                    (*((volatile unsigned int*)(0x4380B064UL)))
#define bM4_USBFS_HCCHAR4_DAD4                    (*((volatile unsigned int*)(0x4380B068UL)))
#define bM4_USBFS_HCCHAR4_DAD5                    (*((volatile unsigned int*)(0x4380B06CUL)))
#define bM4_USBFS_HCCHAR4_DAD6                    (*((volatile unsigned int*)(0x4380B070UL)))
#define bM4_USBFS_HCCHAR4_ODDFRM                  (*((volatile unsigned int*)(0x4380B074UL)))
#define bM4_USBFS_HCCHAR4_CHDIS                   (*((volatile unsigned int*)(0x4380B078UL)))
#define bM4_USBFS_HCCHAR4_CHENA                   (*((volatile unsigned int*)(0x4380B07CUL)))
#define bM4_USBFS_HCINT4_XFRC                     (*((volatile unsigned int*)(0x4380B100UL)))
#define bM4_USBFS_HCINT4_CHH                      (*((volatile unsigned int*)(0x4380B104UL)))
#define bM4_USBFS_HCINT4_STALL                    (*((volatile unsigned int*)(0x4380B10CUL)))
#define bM4_USBFS_HCINT4_NAK                      (*((volatile unsigned int*)(0x4380B110UL)))
#define bM4_USBFS_HCINT4_ACK                      (*((volatile unsigned int*)(0x4380B114UL)))
#define bM4_USBFS_HCINT4_TXERR                    (*((volatile unsigned int*)(0x4380B11CUL)))
#define bM4_USBFS_HCINT4_BBERR                    (*((volatile unsigned int*)(0x4380B120UL)))
#define bM4_USBFS_HCINT4_FRMOR                    (*((volatile unsigned int*)(0x4380B124UL)))
#define bM4_USBFS_HCINT4_DTERR                    (*((volatile unsigned int*)(0x4380B128UL)))
#define bM4_USBFS_HCINTMSK4_XFRCM                 (*((volatile unsigned int*)(0x4380B180UL)))
#define bM4_USBFS_HCINTMSK4_CHHM                  (*((volatile unsigned int*)(0x4380B184UL)))
#define bM4_USBFS_HCINTMSK4_STALLM                (*((volatile unsigned int*)(0x4380B18CUL)))
#define bM4_USBFS_HCINTMSK4_NAKM                  (*((volatile unsigned int*)(0x4380B190UL)))
#define bM4_USBFS_HCINTMSK4_ACKM                  (*((volatile unsigned int*)(0x4380B194UL)))
#define bM4_USBFS_HCINTMSK4_TXERRM                (*((volatile unsigned int*)(0x4380B19CUL)))
#define bM4_USBFS_HCINTMSK4_BBERRM                (*((volatile unsigned int*)(0x4380B1A0UL)))
#define bM4_USBFS_HCINTMSK4_FRMORM                (*((volatile unsigned int*)(0x4380B1A4UL)))
#define bM4_USBFS_HCINTMSK4_DTERRM                (*((volatile unsigned int*)(0x4380B1A8UL)))
#define bM4_USBFS_HCTSIZ4_XFRSIZ0                 (*((volatile unsigned int*)(0x4380B200UL)))
#define bM4_USBFS_HCTSIZ4_XFRSIZ1                 (*((volatile unsigned int*)(0x4380B204UL)))
#define bM4_USBFS_HCTSIZ4_XFRSIZ2                 (*((volatile unsigned int*)(0x4380B208UL)))
#define bM4_USBFS_HCTSIZ4_XFRSIZ3                 (*((volatile unsigned int*)(0x4380B20CUL)))
#define bM4_USBFS_HCTSIZ4_XFRSIZ4                 (*((volatile unsigned int*)(0x4380B210UL)))
#define bM4_USBFS_HCTSIZ4_XFRSIZ5                 (*((volatile unsigned int*)(0x4380B214UL)))
#define bM4_USBFS_HCTSIZ4_XFRSIZ6                 (*((volatile unsigned int*)(0x4380B218UL)))
#define bM4_USBFS_HCTSIZ4_XFRSIZ7                 (*((volatile unsigned int*)(0x4380B21CUL)))
#define bM4_USBFS_HCTSIZ4_XFRSIZ8                 (*((volatile unsigned int*)(0x4380B220UL)))
#define bM4_USBFS_HCTSIZ4_XFRSIZ9                 (*((volatile unsigned int*)(0x4380B224UL)))
#define bM4_USBFS_HCTSIZ4_XFRSIZ10                (*((volatile unsigned int*)(0x4380B228UL)))
#define bM4_USBFS_HCTSIZ4_XFRSIZ11                (*((volatile unsigned int*)(0x4380B22CUL)))
#define bM4_USBFS_HCTSIZ4_XFRSIZ12                (*((volatile unsigned int*)(0x4380B230UL)))
#define bM4_USBFS_HCTSIZ4_XFRSIZ13                (*((volatile unsigned int*)(0x4380B234UL)))
#define bM4_USBFS_HCTSIZ4_XFRSIZ14                (*((volatile unsigned int*)(0x4380B238UL)))
#define bM4_USBFS_HCTSIZ4_XFRSIZ15                (*((volatile unsigned int*)(0x4380B23CUL)))
#define bM4_USBFS_HCTSIZ4_XFRSIZ16                (*((volatile unsigned int*)(0x4380B240UL)))
#define bM4_USBFS_HCTSIZ4_XFRSIZ17                (*((volatile unsigned int*)(0x4380B244UL)))
#define bM4_USBFS_HCTSIZ4_XFRSIZ18                (*((volatile unsigned int*)(0x4380B248UL)))
#define bM4_USBFS_HCTSIZ4_PKTCNT0                 (*((volatile unsigned int*)(0x4380B24CUL)))
#define bM4_USBFS_HCTSIZ4_PKTCNT1                 (*((volatile unsigned int*)(0x4380B250UL)))
#define bM4_USBFS_HCTSIZ4_PKTCNT2                 (*((volatile unsigned int*)(0x4380B254UL)))
#define bM4_USBFS_HCTSIZ4_PKTCNT3                 (*((volatile unsigned int*)(0x4380B258UL)))
#define bM4_USBFS_HCTSIZ4_PKTCNT4                 (*((volatile unsigned int*)(0x4380B25CUL)))
#define bM4_USBFS_HCTSIZ4_PKTCNT5                 (*((volatile unsigned int*)(0x4380B260UL)))
#define bM4_USBFS_HCTSIZ4_PKTCNT6                 (*((volatile unsigned int*)(0x4380B264UL)))
#define bM4_USBFS_HCTSIZ4_PKTCNT7                 (*((volatile unsigned int*)(0x4380B268UL)))
#define bM4_USBFS_HCTSIZ4_PKTCNT8                 (*((volatile unsigned int*)(0x4380B26CUL)))
#define bM4_USBFS_HCTSIZ4_PKTCNT9                 (*((volatile unsigned int*)(0x4380B270UL)))
#define bM4_USBFS_HCTSIZ4_DPID0                   (*((volatile unsigned int*)(0x4380B274UL)))
#define bM4_USBFS_HCTSIZ4_DPID1                   (*((volatile unsigned int*)(0x4380B278UL)))
#define bM4_USBFS_HCCHAR5_MPSIZ0                  (*((volatile unsigned int*)(0x4380B400UL)))
#define bM4_USBFS_HCCHAR5_MPSIZ1                  (*((volatile unsigned int*)(0x4380B404UL)))
#define bM4_USBFS_HCCHAR5_MPSIZ2                  (*((volatile unsigned int*)(0x4380B408UL)))
#define bM4_USBFS_HCCHAR5_MPSIZ3                  (*((volatile unsigned int*)(0x4380B40CUL)))
#define bM4_USBFS_HCCHAR5_MPSIZ4                  (*((volatile unsigned int*)(0x4380B410UL)))
#define bM4_USBFS_HCCHAR5_MPSIZ5                  (*((volatile unsigned int*)(0x4380B414UL)))
#define bM4_USBFS_HCCHAR5_MPSIZ6                  (*((volatile unsigned int*)(0x4380B418UL)))
#define bM4_USBFS_HCCHAR5_MPSIZ7                  (*((volatile unsigned int*)(0x4380B41CUL)))
